---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\Joanna\Dropbox\Repositories\ISSP_Income-Pooling\docs\ISSPdata_duration_2020.02.04.log
  log type:  text
 opened on:   4 Feb 2020, 15:24:04

. 
. ************************************************************************************************************
. /// Import the data
> 
. // Data: ISSP2012 wrangled in R. 
. use     "C:\Users\Joanna\Dropbox\Repositories\ISSP_Income-Pooling\data\ISSPdata.dta", clear
(Written by R.              )

. 
. **********************************************************************************************************************
. *Table 3
. **********************************************************************************************************************
. // Model 1
. mlogit          pool    index                                                                   , cluster(country) rrr

Iteration 0:   log pseudolikelihood = -8556.7479  
Iteration 1:   log pseudolikelihood =  -8328.673  
Iteration 2:   log pseudolikelihood =  -8309.529  
Iteration 3:   log pseudolikelihood = -8309.4773  
Iteration 4:   log pseudolikelihood = -8309.4773  

Multinomial logistic regression                 Number of obs     =      7,118
                                                Wald chi2(3)      =      66.05
                                                Prob > chi2       =     0.0000
Log pseudolikelihood = -8309.4773               Pseudo R2         =     0.0289

                                       (Std. Err. adjusted for 18 clusters in country)
--------------------------------------------------------------------------------------
                     |               Robust
                pool |        RRR   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------------+----------------------------------------------------------------
One___Manager        |
               index |   1.046665   .0066037     7.23   0.000     1.033802    1.059689
               _cons |   .1515482   .0289246    -9.89   0.000     .1042533    .2202987
---------------------+----------------------------------------------------------------
Manage___Together    |  (base outcome)
---------------------+----------------------------------------------------------------
Keep_Some___Separate |
               index |   1.009903   .0129194     0.77   0.441     .9848968    1.035545
               _cons |   .3151763   .0823969    -4.42   0.000     .1888091    .5261191
---------------------+----------------------------------------------------------------
Keep_All___Separate  |
               index |   1.027723   .0151633     1.85   0.064     .9984286    1.057876
               _cons |   .1363965   .0438565    -6.20   0.000      .072629    .2561509
--------------------------------------------------------------------------------------
Note: _cons estimates baseline relative risk for each outcome.

. estat           ic

Akaike's information criterion and Bayesian information criterion

-----------------------------------------------------------------------------
       Model |        Obs  ll(null)  ll(model)      df         AIC        BIC
-------------+---------------------------------------------------------------
           . |      7,118 -8556.748  -8309.477       6    16630.95   16672.18
-----------------------------------------------------------------------------
               Note: N=Obs used in calculating BIC; see [R] BIC note.

. // Model 2
. mlogit          pool    index    i.relinc                                               , cluster(country) rrr

Iteration 0:   log pseudolikelihood = -8556.7479  
Iteration 1:   log pseudolikelihood = -8298.7678  
Iteration 2:   log pseudolikelihood = -8279.1365  
Iteration 3:   log pseudolikelihood = -8279.0883  
Iteration 4:   log pseudolikelihood = -8279.0883  

Multinomial logistic regression                 Number of obs     =      7,118
                                                Wald chi2(9)      =      90.27
                                                Prob > chi2       =     0.0000
Log pseudolikelihood = -8279.0883               Pseudo R2         =     0.0324

                                        (Std. Err. adjusted for 18 clusters in country)
---------------------------------------------------------------------------------------
                      |               Robust
                 pool |        RRR   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
One___Manager         |
                index |   1.046602   .0066451     7.17   0.000     1.033659    1.059708
                      |
               relinc |
Woman primary-earner  |   .8365977   .1291176    -1.16   0.248      .618223    1.132109
       Equal-earners  |   .6112054   .1657393    -1.82   0.069     .3592267    1.039934
                      |
                _cons |   .1673989   .0318812    -9.38   0.000     .1152499    .2431445
----------------------+----------------------------------------------------------------
Manage___Together     |  (base outcome)
----------------------+----------------------------------------------------------------
Keep_Some___Separate  |
                index |   1.009865   .0128935     0.77   0.442     .9849076    1.035455
                      |
               relinc |
Woman primary-earner  |   1.315741   .1216125     2.97   0.003     1.097728    1.577052
       Equal-earners  |   1.157822    .151548     1.12   0.263     .8958342    1.496429
                      |
                _cons |   .2925178   .0781822    -4.60   0.000     .1732403     .493919
----------------------+----------------------------------------------------------------
Keep_All___Separate   |
                index |   1.027555   .0151124     1.85   0.065     .9983576    1.057605
                      |
               relinc |
Woman primary-earner  |   1.471342   .2229347     2.55   0.011     1.093305    1.980094
       Equal-earners  |   1.154933   .1481507     1.12   0.261     .8981885    1.485066
                      |
                _cons |   .1240257   .0392812    -6.59   0.000     .0666685    .2307291
---------------------------------------------------------------------------------------
Note: _cons estimates baseline relative risk for each outcome.

. estat           ic

Akaike's information criterion and Bayesian information criterion

-----------------------------------------------------------------------------
       Model |        Obs  ll(null)  ll(model)      df         AIC        BIC
-------------+---------------------------------------------------------------
           . |      7,118 -8556.748  -8279.088      12    16582.18   16664.62
-----------------------------------------------------------------------------
               Note: N=Obs used in calculating BIC; see [R] BIC note.

. // Model 3
. mlogit          pool    index    i.marst                                                , cluster(country) rrr

Iteration 0:   log pseudolikelihood = -8556.7479  
Iteration 1:   log pseudolikelihood = -8132.8662  
Iteration 2:   log pseudolikelihood = -8111.8875  
Iteration 3:   log pseudolikelihood = -8111.8162  
Iteration 4:   log pseudolikelihood = -8111.8162  

Multinomial logistic regression                 Number of obs     =      7,118
                                                Wald chi2(6)      =     168.51
                                                Prob > chi2       =     0.0000
Log pseudolikelihood = -8111.8162               Pseudo R2         =     0.0520

                                       (Std. Err. adjusted for 18 clusters in country)
--------------------------------------------------------------------------------------
                     |               Robust
                pool |        RRR   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------------+----------------------------------------------------------------
One___Manager        |
               index |   1.046621   .0061931     7.70   0.000     1.034553     1.05883
                     |
               marst |
              Cohab  |   1.937943   .2793483     4.59   0.000     1.460975    2.570626
               _cons |   .1397352    .027836    -9.88   0.000     .0945675     .206476
---------------------+----------------------------------------------------------------
Manage___Together    |  (base outcome)
---------------------+----------------------------------------------------------------
Keep_Some___Separate |
               index |   1.009968   .0137074     0.73   0.465     .9834563    1.037195
                     |
               marst |
              Cohab  |   3.676484   .7005795     6.83   0.000      2.53064    5.341154
               _cons |   .2530376   .0649827    -5.35   0.000     .1529635    .4185839
---------------------+----------------------------------------------------------------
Keep_All___Separate  |
               index |   1.027657     .01621     1.73   0.084     .9963725    1.059925
                     |
               marst |
              Cohab  |   5.036242   1.122487     7.25   0.000     3.253788    7.795142
               _cons |   .0997678   .0324002    -7.10   0.000     .0527907    .1885488
--------------------------------------------------------------------------------------
Note: _cons estimates baseline relative risk for each outcome.

. estat           ic

Akaike's information criterion and Bayesian information criterion

-----------------------------------------------------------------------------
       Model |        Obs  ll(null)  ll(model)      df         AIC        BIC
-------------+---------------------------------------------------------------
           . |      7,118 -8556.748  -8111.816       9    16241.63   16303.47
-----------------------------------------------------------------------------
               Note: N=Obs used in calculating BIC; see [R] BIC note.

. 
end of do-file

. do "C:\Users\Joanna\AppData\Local\Temp\STD28a4_000000.tmp"

. global  ivars "sex age parent i.employ homemaker ib4.degree hswrk respmom famlife duration"

. 
. mlogit          pool    index i.relinc          i.marst         $ivars                                  , cluster(country) rrr

Iteration 0:   log pseudolikelihood = -8556.7479  
Iteration 1:   log pseudolikelihood = -7778.0357  
Iteration 2:   log pseudolikelihood =  -7742.417  
Iteration 3:   log pseudolikelihood = -7742.1965  
Iteration 4:   log pseudolikelihood = -7742.1965  

Multinomial logistic regression                 Number of obs     =      7,118
                                                Wald chi2(14)     =          .
                                                Prob > chi2       =          .
Log pseudolikelihood = -7742.1965               Pseudo R2         =     0.0952

                                        (Std. Err. adjusted for 18 clusters in country)
---------------------------------------------------------------------------------------
                      |               Robust
                 pool |        RRR   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
One___Manager         |
                index |   1.037589   .0072149     5.31   0.000     1.023544    1.051827
                      |
               relinc |
Woman primary-earner  |   .9584595   .1491056    -0.27   0.785     .7065681     1.30015
       Equal-earners  |   .6755798   .1632782    -1.62   0.105     .4206812    1.084926
                      |
                marst |
               Cohab  |   1.650386   .2523238     3.28   0.001     1.223059    2.227019
                  sex |    .985112   .1875423    -0.08   0.937     .6783233    1.430654
                  age |   .9849197   .0051991    -2.88   0.004     .9747821    .9951627
               parent |   .8705708   .1161198    -1.04   0.299     .6702978    1.130682
                      |
               employ |
            Parttime  |   1.093875   .1260269     0.78   0.436     .8727697    1.370995
          Unemployed  |   1.390439   .3947782     1.16   0.246     .7970326     2.42565
             Student  |   1.609732   .2455192     3.12   0.002     1.193787    2.170602
  Not in labor force  |   .7289458   .1010919    -2.28   0.023     .5554547    .9566252
                      |
            homemaker |   1.180179   .1248929     1.57   0.117     .9591119    1.452201
                      |
               degree |
 No formal education  |   1.779278   .5888919     1.74   0.082     .9300786    3.403831
      Primary school  |   1.645524   .3041578     2.69   0.007      1.14543    2.363959
     Lower secondary  |   .9948795   .2050599    -0.02   0.980     .6642396    1.490103
      Post secondary  |   .9672381   .2062989    -0.16   0.876     .6367714    1.469208
Lower level tertiary  |   .5818422   .1300506    -2.42   0.015      .375447    .9016994
Upper level tertiary  |   .5656309   .1134275    -2.84   0.004     .3818031     .837967
                      |
                hswrk |   .8949268   .0311763    -3.19   0.001     .8358617    .9581656
              respmom |   1.022576   .0989972     0.23   0.818     .8458426    1.236237
              famlife |   .7959948   .0704494    -2.58   0.010     .6692291    .9467726
             duration |   1.387124   .2123559     2.14   0.033     1.027552    1.872519
                _cons |   1.328501   1.084259     0.35   0.728     .2683194    6.577666
----------------------+----------------------------------------------------------------
Manage___Together     |  (base outcome)
----------------------+----------------------------------------------------------------
Keep_Some___Separate  |
                index |   1.018439   .0120259     1.55   0.122     .9951397    1.042285
                      |
               relinc |
Woman primary-earner  |   1.122717   .1193079     1.09   0.276     .9116232     1.38269
       Equal-earners  |   .9580963   .1226183    -0.33   0.738     .7455407    1.231252
                      |
                marst |
               Cohab  |   3.091456   .5850982     5.96   0.000      2.13335    4.479855
                  sex |   1.097025   .1180536     0.86   0.390     .8884164    1.354617
                  age |    .984724   .0043779    -3.46   0.001     .9761807     .993342
               parent |   .9103649   .0709866    -1.20   0.228     .7813438    1.060691
                      |
               employ |
            Parttime  |   .6341321   .0997677    -2.90   0.004     .4658655    .8631751
          Unemployed  |   .7766545    .177886    -1.10   0.270     .4957555    1.216713
             Student  |   .6620981   .0912684    -2.99   0.003     .5053434    .8674772
  Not in labor force  |   .8178765   .1109467    -1.48   0.138     .6269319    1.066977
                      |
            homemaker |   .7710835   .0817011    -2.45   0.014      .626486    .9490552
                      |
               degree |
 No formal education  |   1.672998   .7557114     1.14   0.255     .6902373    4.055015
      Primary school  |   .8063678   .1514629    -1.15   0.252     .5580191    1.165245
     Lower secondary  |   .9127601     .13264    -0.63   0.530     .6865343    1.213532
      Post secondary  |   .9711235   .1522094    -0.19   0.852     .7142678    1.320346
Lower level tertiary  |   1.545988   .1739331     3.87   0.000     1.240055    1.927399
Upper level tertiary  |   2.043231   .2449723     5.96   0.000     1.615337    2.584473
                      |
                hswrk |   .9789054   .0204878    -1.02   0.308     .9395626    1.019896
              respmom |   1.305874   .1709933     2.04   0.042     1.010284    1.687948
              famlife |   .7887905   .0331046    -5.65   0.000     .7265036    .8564177
             duration |   1.400073   .3311934     1.42   0.155     .8806333    2.225902
                _cons |    1.06698   .4700331     0.15   0.883     .4499659    2.530074
----------------------+----------------------------------------------------------------
Keep_All___Separate   |
                index |   1.031525   .0113798     2.81   0.005      1.00946    1.054072
                      |
               relinc |
Woman primary-earner  |   1.169321   .1846374     0.99   0.322     .8580802    1.593454
       Equal-earners  |   .9288234   .1142779    -0.60   0.548     .7298027    1.182118
                      |
                marst |
               Cohab  |   4.265165   .9081538     6.81   0.000     2.809927    6.474059
                  sex |   1.125362   .1216766     1.09   0.275     .9104547    1.390996
                  age |   .9938032   .0081372    -0.76   0.448     .9779818    1.009881
               parent |   .9496639   .1312687    -0.37   0.709     .7242881     1.24517
                      |
               employ |
            Parttime  |   .5467112   .0988943    -3.34   0.001      .383517    .7793479
          Unemployed  |   1.379422   .4685764     0.95   0.344     .7088465    2.684368
             Student  |    .812452   .2133941    -0.79   0.429     .4855409     1.35947
  Not in labor force  |   1.244109   .1456194     1.87   0.062     .9890719     1.56491
                      |
            homemaker |   .7502429   .0931285    -2.31   0.021     .5882221    .9568911
                      |
               degree |
 No formal education  |   1.681612   .5631157     1.55   0.121     .8723416     3.24164
      Primary school  |   1.302226   .3146816     1.09   0.274     .8109508    2.091117
     Lower secondary  |   1.311921   .2449156     1.45   0.146     .9099165    1.891534
      Post secondary  |   1.497131    .224039     2.70   0.007     1.116558     2.00742
Lower level tertiary  |   1.724928   .2181273     4.31   0.000     1.346268    2.210092
Upper level tertiary  |   1.853886   .3947928     2.90   0.004     1.221282    2.814167
                      |
                hswrk |   1.046573   .0307253     1.55   0.121     .9880522    1.108559
              respmom |   .9377507    .161415    -0.37   0.709     .6692218    1.314028
              famlife |   .6524531   .0220153   -12.66   0.000     .6106997     .697061
             duration |   1.696714   .2936252     3.06   0.002     1.208659    2.381845
                _cons |    .705858   .4233363    -0.58   0.561     .2178772    2.286773
---------------------------------------------------------------------------------------
Note: _cons estimates baseline relative risk for each outcome.

. 
end of do-file

. do "C:\Users\Joanna\AppData\Local\Temp\STD28a4_000000.tmp"

. estat           ic

Akaike's information criterion and Bayesian information criterion

-----------------------------------------------------------------------------
       Model |        Obs  ll(null)  ll(model)      df         AIC        BIC
-------------+---------------------------------------------------------------
           . |      7,118 -8556.748  -7742.196      17    15518.39   15635.19
-----------------------------------------------------------------------------
               Note: N=Obs used in calculating BIC; see [R] BIC note.

. 
. **********************************************************************************************************************
. *Table 4 - Model 5
. **********************************************************************************************************************
. global  ivars " sex age parent i.employ homemaker ib4.degree hswrk respmom famlife duration"

. 
. mlogit          pool    c.index##i.relinc       i.marst         $ivars                                  , cluster(country) rrr

Iteration 0:   log pseudolikelihood = -8556.7479  
Iteration 1:   log pseudolikelihood = -7771.1515  
Iteration 2:   log pseudolikelihood = -7731.6563  
Iteration 3:   log pseudolikelihood = -7731.3233  
Iteration 4:   log pseudolikelihood = -7731.3232  

Multinomial logistic regression                 Number of obs     =      7,118
                                                Wald chi2(14)     =          .
                                                Prob > chi2       =          .
Log pseudolikelihood = -7731.3232               Pseudo R2         =     0.0965

                                        (Std. Err. adjusted for 18 clusters in country)
---------------------------------------------------------------------------------------
                      |               Robust
                 pool |        RRR   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
One___Manager         |
                index |   1.043457   .0096966     4.58   0.000     1.024624    1.062636
                      |
               relinc |
Woman primary-earner  |   1.139705   .2240252     0.67   0.506     .7753128    1.675361
       Equal-earners  |   1.047322   .3107881     0.16   0.876     .5854499    1.873572
                      |
       relinc#c.index |
Woman primary-earner  |   .9900948    .012174    -0.81   0.418     .9665193    1.014245
       Equal-earners  |   .9747734   .0100489    -2.48   0.013     .9552757    .9946691
                      |
                marst |
               Cohab  |   1.654205    .255778     3.26   0.001     1.221726    2.239776
                  sex |   .9918418   .1847774    -0.04   0.965     .6884397    1.428956
                  age |   .9852136   .0052652    -2.79   0.005     .9749479    .9955873
               parent |   .8793608   .1208506    -0.94   0.350     .6717171    1.151192
                      |
               employ |
            Parttime  |   1.114148    .129388     0.93   0.352     .8873429    1.398925
          Unemployed  |    1.39484   .3964366     1.17   0.242     .7990959    2.434725
             Student  |   1.598822   .2442119     3.07   0.002     1.185178    2.156835
  Not in labor force  |   .7220141    .100115    -2.35   0.019     .5501961    .9474884
                      |
            homemaker |   1.187283   .1234217     1.65   0.099     .9684326    1.455591
                      |
               degree |
 No formal education  |   1.711788   .5591892     1.65   0.100     .9023775     3.24722
      Primary school  |    1.64073     .30677     2.65   0.008      1.13733    2.366942
     Lower secondary  |    .999823   .2067942    -0.00   0.999     .6666047    1.499608
      Post secondary  |   .9772531   .2046076    -0.11   0.912     .6483222     1.47307
Lower level tertiary  |   .5857856   .1305632    -2.40   0.016     .3784583    .9066911
Upper level tertiary  |   .5678193   .1132606    -2.84   0.005     .3840824    .8394519
                      |
                hswrk |   .8941636   .0309246    -3.23   0.001     .8355611    .9568763
              respmom |   1.023662   .0987187     0.24   0.808     .8473626    1.236641
              famlife |    .796703   .0698985    -2.59   0.010     .6708362    .9461858
             duration |   1.376107   .2118002     2.07   0.038     1.017751    1.860642
                _cons |    1.15262   .9362966     0.17   0.861     .2345512    5.664146
----------------------+----------------------------------------------------------------
Manage___Together     |  (base outcome)
----------------------+----------------------------------------------------------------
Keep_Some___Separate  |
                index |   1.023866   .0135889     1.78   0.076     .9975753    1.050849
                      |
               relinc |
Woman primary-earner  |   1.200019   .1860547     1.18   0.240     .8855546    1.626152
       Equal-earners  |   1.377796   .3515072     1.26   0.209     .8356491    2.271673
                      |
       relinc#c.index |
Woman primary-earner  |   .9949188   .0085709    -0.59   0.554     .9782612     1.01186
       Equal-earners  |    .973891   .0167181    -1.54   0.123     .9416693    1.007215
                      |
                marst |
               Cohab  |   3.093878   .5826899     6.00   0.000     2.138902    4.475231
                  sex |   1.103631   .1157031     0.94   0.347      .898639    1.355385
                  age |   .9849158    .004452    -3.36   0.001     .9762286    .9936803
               parent |   .9150611   .0741832    -1.09   0.274     .7806277    1.072646
                      |
               employ |
            Parttime  |   .6384095   .1064704    -2.69   0.007     .4604057    .8852337
          Unemployed  |   .7761767   .1797414    -1.09   0.274     .4929983    1.222013
             Student  |   .6531929   .0884343    -3.15   0.002     .5009556    .8516943
  Not in labor force  |    .808985    .109361    -1.57   0.117     .6206868    1.054407
                      |
            homemaker |   .7722343   .0813845    -2.45   0.014     .6281196    .9494145
                      |
               degree |
 No formal education  |   1.567228   .6742117     1.04   0.296     .6744516    3.641781
      Primary school  |   .7983917   .1492705    -1.20   0.228     .5534418    1.151755
     Lower secondary  |    .914154   .1317762    -0.62   0.534     .6891564    1.212609
      Post secondary  |   .9795775   .1533538    -0.13   0.895     .7207463    1.331359
Lower level tertiary  |   1.549149   .1719412     3.94   0.000     1.246286    1.925612
Upper level tertiary  |   2.045449   .2444436     5.99   0.000     1.618322    2.585309
                      |
                hswrk |   .9786972    .020647    -1.02   0.307     .9390551    1.020013
              respmom |   1.309604   .1718973     2.05   0.040      1.01254    1.693822
              famlife |   .7902307   .0337104    -5.52   0.000     .7268462    .8591427
             duration |   1.392361   .3224461     1.43   0.153     .8843591    2.192174
                _cons |   .9571998   .4772917    -0.09   0.930     .3602178    2.543549
----------------------+----------------------------------------------------------------
Keep_All___Separate   |
                index |   1.036681   .0125267     2.98   0.003     1.012418    1.061526
                      |
               relinc |
Woman primary-earner  |   1.448719   .3136905     1.71   0.087     .9477067    2.214596
       Equal-earners  |   1.082768   .1952405     0.44   0.659     .7604137    1.541774
                      |
       relinc#c.index |
Woman primary-earner  |   .9864344   .0076925    -1.75   0.080      .971472    1.001627
       Equal-earners  |   .9885333   .0092884    -1.23   0.220      .970495    1.006907
                      |
                marst |
               Cohab  |   4.247492   .9117189     6.74   0.000     2.788838    6.469071
                  sex |   1.133893   .1160419     1.23   0.220     .9278131    1.385745
                  age |   .9941129   .0080021    -0.73   0.463     .9785522    1.009921
               parent |   .9524022   .1303565    -0.36   0.722     .7283085    1.245447
                      |
               employ |
            Parttime  |   .5526173    .103227    -3.18   0.001     .3831978    .7969406
          Unemployed  |   1.378559   .4703225     0.94   0.347     .7063519    2.690478
             Student  |   .8078769   .2115743    -0.81   0.415     .4835314    1.349789
  Not in labor force  |   1.237998   .1466909     1.80   0.072     .9814332    1.561634
                      |
            homemaker |   .7541512   .0950647    -2.24   0.025     .5890608      .96551
                      |
               degree |
 No formal education  |   1.682745   .5600638     1.56   0.118     .8764253    3.230885
      Primary school  |   1.299458   .3197779     1.06   0.287     .8022206    2.104896
     Lower secondary  |   1.314935    .244269     1.47   0.141     .9136519    1.892465
      Post secondary  |   1.500612   .2250307     2.71   0.007     1.118467    2.013326
Lower level tertiary  |   1.730841   .2223579     4.27   0.000     1.345566    2.226432
Upper level tertiary  |   1.851401   .3901823     2.92   0.003     1.224927    2.798279
                      |
                hswrk |   1.046987   .0308819     1.56   0.120     .9881756    1.109298
              respmom |   .9391396    .162312    -0.36   0.716     .6692934    1.317783
              famlife |   .6534744   .0224148   -12.40   0.000     .6109863    .6989171
             duration |   1.704937   .2843179     3.20   0.001     1.229591    2.364047
                _cons |   .6215539   .3713574    -0.80   0.426     .1927147     2.00467
---------------------------------------------------------------------------------------
Note: _cons estimates baseline relative risk for each outcome.

. estat           ic

Akaike's information criterion and Bayesian information criterion

-----------------------------------------------------------------------------
       Model |        Obs  ll(null)  ll(model)      df         AIC        BIC
-------------+---------------------------------------------------------------
           . |      7,118 -8556.748  -7731.323      17    15496.65   15613.44
-----------------------------------------------------------------------------
               Note: N=Obs used in calculating BIC; see [R] BIC note.

. 
. // Figure 2
. mlogit          pool    c.index##i.relinc       i.marst         $ivars                                  , cluster(country)

Iteration 0:   log pseudolikelihood = -8556.7479  
Iteration 1:   log pseudolikelihood = -7771.1515  
Iteration 2:   log pseudolikelihood = -7731.6563  
Iteration 3:   log pseudolikelihood = -7731.3233  
Iteration 4:   log pseudolikelihood = -7731.3232  

Multinomial logistic regression                 Number of obs     =      7,118
                                                Wald chi2(14)     =          .
                                                Prob > chi2       =          .
Log pseudolikelihood = -7731.3232               Pseudo R2         =     0.0965

                                        (Std. Err. adjusted for 18 clusters in country)
---------------------------------------------------------------------------------------
                      |               Robust
                 pool |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
One___Manager         |
                index |   .0425389   .0092928     4.58   0.000     .0243254    .0607524
                      |
               relinc |
Woman primary-earner  |   .1307698   .1965641     0.67   0.506    -.2544888    .5160284
       Equal-earners  |   .0462361   .2967456     0.16   0.876    -.5353746    .6278468
                      |
       relinc#c.index |
Woman primary-earner  |  -.0099546   .0122958    -0.81   0.418     -.034054    .0141448
       Equal-earners  |  -.0255502   .0103089    -2.48   0.013    -.0457553   -.0053451
                      |
                marst |
               Cohab  |   .5033204   .1546229     3.26   0.001      .200265    .8063758
                  sex |  -.0081917   .1862973    -0.04   0.965    -.3733276    .3569442
                  age |  -.0148968   .0053442    -2.79   0.005    -.0253712   -.0044225
               parent |    -.12856   .1374301    -0.94   0.350    -.3979181     .140798
                      |
               employ |
            Parttime  |   .1080902   .1161317     0.93   0.352    -.1195238    .3357042
          Unemployed  |   .3327798   .2842165     1.17   0.242    -.2242743     .889834
             Student  |   .4692673   .1527448     3.07   0.002     .1698929    .7686417
  Not in labor force  |  -.3257106   .1386607    -2.35   0.019    -.5974805   -.0539406
                      |
            homemaker |   .1716677    .103953     1.65   0.099    -.0320764    .3754119
                      |
               degree |
 No formal education  |   .5375384   .3266697     1.65   0.100    -.1027223    1.177799
      Primary school  |   .4951412   .1869717     2.65   0.008     .1286834    .8615989
     Lower secondary  |   -.000177   .2068308    -0.00   0.999     -.405558     .405204
      Post secondary  |  -.0230096   .2093702    -0.11   0.912    -.4333675    .3873484
Lower level tertiary  |  -.5348015   .2228857    -2.40   0.016    -.9716495   -.0979535
Upper level tertiary  |  -.5659521   .1994659    -2.84   0.005    -.9568981   -.1750061
                      |
                hswrk |  -.1118665    .034585    -3.23   0.001    -.1796518   -.0440812
              respmom |   .0233861   .0964368     0.24   0.808    -.1656266    .2123988
              famlife |  -.2272734   .0877348    -2.59   0.010    -.3992303   -.0553164
             duration |   .3192584   .1539126     2.07   0.038     .0175952    .6209216
                _cons |   .1420374   .8123204     0.17   0.861    -1.450081    1.734156
----------------------+----------------------------------------------------------------
Manage___Together     |  (base outcome)
----------------------+----------------------------------------------------------------
Keep_Some___Separate  |
                index |   .0235853   .0132722     1.78   0.076    -.0024276    .0495983
                      |
               relinc |
Woman primary-earner  |   .1823376   .1550431     1.18   0.240    -.1215412    .4862165
       Equal-earners  |   .3204851   .2551228     1.26   0.209    -.1795465    .8205166
                      |
       relinc#c.index |
Woman primary-earner  |  -.0050941   .0086147    -0.59   0.554    -.0219786    .0117903
       Equal-earners  |  -.0264558   .0171663    -1.54   0.123    -.0601011    .0071895
                      |
                marst |
               Cohab  |   1.129425   .1883364     6.00   0.000     .7602927    1.498558
                  sex |   .0986058   .1048385     0.94   0.347    -.1068739    .3040856
                  age |  -.0151991   .0045202    -3.36   0.001    -.0240585   -.0063398
               parent |  -.0887644   .0810691    -1.09   0.274     -.247657    .0701281
                      |
               employ |
            Parttime  |  -.4487754   .1667744    -2.69   0.007    -.7756471   -.1219036
          Unemployed  |  -.2533751   .2315728    -1.09   0.274    -.7072495    .2004994
             Student  |  -.4258828   .1353878    -3.15   0.002    -.6912379   -.1605276
  Not in labor force  |  -.2119749    .135183    -1.57   0.117    -.4769287     .052979
                      |
            homemaker |  -.2584673   .1053884    -2.45   0.014    -.4650247   -.0519098
                      |
               degree |
 No formal education  |   .4493087   .4301937     1.04   0.296    -.3938554    1.292473
      Primary school  |  -.2251559    .186964    -1.20   0.228    -.5915987    .1412868
     Lower secondary  |  -.0897562    .144151    -0.62   0.534     -.372287    .1927746
      Post secondary  |  -.0206339   .1565509    -0.13   0.895    -.3274681    .2862002
Lower level tertiary  |   .4377059   .1109907     3.94   0.000     .2201681    .6552437
Upper level tertiary  |   .7156172   .1195061     5.99   0.000     .4813896    .9498449
                      |
                hswrk |   -.021533   .0210964    -1.02   0.307    -.0628811    .0198151
              respmom |   .2697247    .131259     2.05   0.040     .0124617    .5269876
              famlife |  -.2354303    .042659    -5.52   0.000    -.3190404   -.1518202
             duration |   .3310009   .2315823     1.43   0.153    -.1228921    .7848938
                _cons |  -.0437431   .4986333    -0.09   0.930    -1.021046    .9335603
----------------------+----------------------------------------------------------------
Keep_All___Separate   |
                index |   .0360246   .0120834     2.98   0.003     .0123415    .0597077
                      |
               relinc |
Woman primary-earner  |   .3706799   .2165295     1.71   0.087    -.0537102    .7950699
       Equal-earners  |   .0795205   .1803161     0.44   0.659    -.2738927    .4329336
                      |
       relinc#c.index |
Woman primary-earner  |  -.0136585   .0077983    -1.75   0.080    -.0289428    .0016258
       Equal-earners  |  -.0115329   .0093962    -1.23   0.220     -.029949    .0068832
                      |
                marst |
               Cohab  |   1.446329   .2146488     6.74   0.000     1.025625    1.867033
                  sex |   .1256566   .1023394     1.23   0.220     -.074925    .3262383
                  age |  -.0059045   .0080494    -0.73   0.463    -.0216811    .0098721
               parent |  -.0487679   .1368712    -0.36   0.722    -.3170305    .2194948
                      |
               employ |
            Parttime  |  -.5930896   .1867965    -3.18   0.001     -.959204   -.2269752
          Unemployed  |   .3210386   .3411697     0.94   0.347    -.3476417     .989719
             Student  |  -.2133456   .2618893    -0.81   0.415    -.7266391    .2999479
  Not in labor force  |   .2134956   .1184904     1.80   0.072    -.0187413    .4457325
                      |
            homemaker |  -.2821624   .1260552    -2.24   0.025    -.5292259   -.0350988
                      |
               degree |
 No formal education  |   .5204262   .3328275     1.56   0.118    -.1319038    1.172756
      Primary school  |   .2619472   .2460856     1.06   0.287    -.2203717    .7442661
     Lower secondary  |   .2737873   .1857651     1.47   0.141    -.0903056    .6378802
      Post secondary  |   .4058733   .1499592     2.71   0.007     .1119586    .6997881
Lower level tertiary  |   .5486077   .1284681     4.27   0.000     .2968149    .8004005
Upper level tertiary  |   .6159428   .2107497     2.92   0.003      .202881    1.029005
                      |
                hswrk |   .0459162    .029496     1.56   0.120    -.0118949    .1037272
              respmom |  -.0627912   .1728305    -0.36   0.716    -.4015328    .2759505
              famlife |  -.4254519    .034301   -12.40   0.000    -.4926807   -.3582232
             duration |   .5335283   .1667615     3.20   0.001     .2066818    .8603748
                _cons |  -.4755326   .5974661    -0.80   0.426    -1.646545    .6954795
---------------------------------------------------------------------------------------

. 
. margin  relinc, at(index=(5(2)62)) predict(outcome(1))  /* One Manages  */

Predictive margins                              Number of obs     =      7,118
Model VCE    : Robust

Expression   : Pr(pool==One___Manager), predict(outcome(1))

1._at        : index           =           5

2._at        : index           =           7

3._at        : index           =           9

4._at        : index           =          11

5._at        : index           =          13

6._at        : index           =          15

7._at        : index           =          17

8._at        : index           =          19

9._at        : index           =          21

10._at       : index           =          23

11._at       : index           =          25

12._at       : index           =          27

13._at       : index           =          29

14._at       : index           =          31

15._at       : index           =          33

16._at       : index           =          35

17._at       : index           =          37

18._at       : index           =          39

19._at       : index           =          41

20._at       : index           =          43

21._at       : index           =          45

22._at       : index           =          47

23._at       : index           =          49

24._at       : index           =          51

25._at       : index           =          53

26._at       : index           =          55

27._at       : index           =          57

28._at       : index           =          59

29._at       : index           =          61

------------------------------------------------------------------------------------------
                         |            Delta-method
                         |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------------------+----------------------------------------------------------------
              _at#relinc |
   1#Man primary-earner  |    .130128    .019034     6.84   0.000      .092822    .1674339
 1#Woman primary-earner  |   .1320105   .0130949    10.08   0.000     .1063449    .1576761
        1#Equal-earners  |   .1175383   .0307575     3.82   0.000     .0572548    .1778218
   2#Man primary-earner  |   .1377389    .018483     7.45   0.000     .1015128     .173965
 2#Woman primary-earner  |   .1378102   .0130653    10.55   0.000     .1122026    .1634178
        2#Equal-earners  |   .1205928   .0299401     4.03   0.000     .0619113    .1792744
   3#Man primary-earner  |   .1456346    .018038     8.07   0.000     .1102808    .1809884
 3#Woman primary-earner  |   .1437769   .0131179    10.96   0.000     .1180662    .1694875
        3#Equal-earners  |   .1236905   .0290825     4.25   0.000     .0666898    .1806911
   4#Man primary-earner  |   .1538101   .0177926     8.64   0.000     .1189372    .1886831
 4#Woman primary-earner  |   .1499091   .0132663    11.30   0.000     .1239076    .1759105
        4#Equal-earners  |   .1268297   .0281892     4.50   0.000     .0715799    .1820794
   5#Man primary-earner  |   .1622591    .017857     9.09   0.000     .1272601    .1972582
 5#Woman primary-earner  |   .1562049   .0135222    11.55   0.000     .1297019    .1827079
        5#Equal-earners  |   .1300089   .0272663     4.77   0.000      .076568    .1834498
   6#Man primary-earner  |   .1709738   .0183432     9.32   0.000     .1350217    .2069258
 6#Woman primary-earner  |   .1626621   .0138943    11.71   0.000     .1354297    .1898944
        6#Equal-earners  |   .1332264   .0263217     5.06   0.000     .0816368    .1848159
   7#Man primary-earner  |   .1799446   .0193446     9.30   0.000     .1420299    .2178593
 7#Woman primary-earner  |   .1692778   .0143879    11.77   0.000      .141078    .1974775
        7#Equal-earners  |   .1364803   .0253657     5.38   0.000     .0867643    .1861962
   8#Man primary-earner  |   .1891607    .020917     9.04   0.000     .1481641    .2301573
 8#Woman primary-earner  |   .1760487   .0150046    11.73   0.000     .1466403    .2054571
        8#Equal-earners  |   .1397686   .0244116     5.73   0.000     .0919228    .1876145
   9#Man primary-earner  |   .1986096   .0230742     8.61   0.000      .153385    .2438342
 9#Woman primary-earner  |   .1829712   .0157428    11.62   0.000     .1521159    .2138266
        9#Equal-earners  |   .1430894    .023476     6.10   0.000     .0970773    .1891015
  10#Man primary-earner  |   .2082776   .0257967     8.07   0.000      .157717    .2588381
10#Woman primary-earner  |   .1900412   .0165985    11.45   0.000     .1575088    .2225736
       10#Equal-earners  |   .1464402     .02258     6.49   0.000     .1021841    .1906963
  11#Man primary-earner  |   .2181494    .029047     7.51   0.000     .1612184    .2750805
11#Woman primary-earner  |    .197254   .0175655    11.23   0.000     .1628262    .2316817
       11#Equal-earners  |   .1498188   .0217498     6.89   0.000       .10719    .1924477
  12#Man primary-earner  |    .228209   .0327823     6.96   0.000     .1639568    .2924611
12#Woman primary-earner  |   .2046046   .0186369    10.98   0.000     .1680769    .2411322
       12#Equal-earners  |   .1532228   .0210167     7.29   0.000     .1120308    .1944147
  13#Man primary-earner  |   .2384387   .0369613     6.45   0.000     .1659959    .3108815
13#Woman primary-earner  |   .2120876    .019805    10.71   0.000     .1732705    .2509047
       13#Equal-earners  |   .1566494   .0204175     7.67   0.000     .1166318    .1966669
  14#Man primary-earner  |   .2488203    .041547     5.99   0.000     .1673896     .330251
14#Woman primary-earner  |   .2196973   .0210623    10.43   0.000     .1784159    .2609787
       14#Equal-earners  |   .1600959   .0199931     8.01   0.000     .1209102    .1992816
  15#Man primary-earner  |   .2593347   .0465072     5.58   0.000     .1681823    .3504871
15#Woman primary-earner  |   .2274276   .0224017    10.15   0.000     .1835211     .271334
       15#Equal-earners  |   .1635596   .0197859     8.27   0.000     .1247799    .2023393
  16#Man primary-earner  |   .2699622   .0518131     5.21   0.000     .1684103     .371514
16#Woman primary-earner  |   .2352719   .0238163     9.88   0.000     .1885927     .281951
       16#Equal-earners  |   .1670375   .0198361     8.42   0.000     .1281594    .2059155
  17#Man primary-earner  |   .2806825   .0574392     4.89   0.000     .1681038    .3932612
17#Woman primary-earner  |   .2432234   .0253003     9.61   0.000     .1936357    .2928112
       17#Equal-earners  |   .1705265   .0201765     8.45   0.000     .1309812    .2100717
  18#Man primary-earner  |   .2914753   .0633616     4.60   0.000     .1672888    .4156618
18#Woman primary-earner  |   .2512753   .0268484     9.36   0.000     .1986535    .3038971
       18#Equal-earners  |   .1740235   .0208288     8.35   0.000     .1331998    .2148472
  19#Man primary-earner  |     .30232    .069558     4.35   0.000     .1659888    .4386513
19#Woman primary-earner  |   .2594201   .0284558     9.12   0.000     .2036478    .3151924
       19#Equal-earners  |   .1775251   .0218012     8.14   0.000     .1347955    .2202548
  20#Man primary-earner  |   .3131964   .0760068     4.12   0.000     .1642257     .462167
20#Woman primary-earner  |   .2676504   .0301187     8.89   0.000     .2086189    .3266819
       20#Equal-earners  |   .1810282   .0230897     7.84   0.000     .1357733    .2262831
  21#Man primary-earner  |   .3240841   .0826869     3.92   0.000     .1620207    .4861475
21#Woman primary-earner  |   .2759586   .0318337     8.67   0.000     .2135658    .3383515
       21#Equal-earners  |   .1845292   .0246804     7.48   0.000     .1361565    .2329019
  22#Man primary-earner  |   .3349636   .0895775     3.74   0.000     .1593948    .5105324
22#Woman primary-earner  |    .284337   .0335981     8.46   0.000     .2184858    .3501881
       22#Equal-earners  |   .1880247   .0265542     7.08   0.000     .1359794    .2400699
  23#Man primary-earner  |   .3458157    .096658     3.58   0.000     .1563694     .535262
23#Woman primary-earner  |   .2927776   .0354098     8.27   0.000     .2233757    .3621795
       23#Equal-earners  |    .191511   .0286896     6.68   0.000     .1352803    .2477417
  24#Man primary-earner  |   .3566222    .103908     3.43   0.001     .1529662    .5602781
24#Woman primary-earner  |   .3012725   .0372669     8.08   0.000     .2282307    .3743143
       24#Equal-earners  |   .1949846   .0310659     6.28   0.000     .1340965    .2558726
  25#Man primary-earner  |   .3673654   .1113072     3.30   0.001     .1492073    .5855235
25#Woman primary-earner  |   .3098139   .0391682     7.91   0.000     .2330456    .3865822
       25#Equal-earners  |   .1984417   .0336639     5.89   0.000     .1324617    .2644218
  26#Man primary-earner  |   .3780289   .1188356     3.18   0.001     .1451155    .6109424
26#Woman primary-earner  |   .3183938   .0411127     7.74   0.000     .2378144    .3989731
       26#Equal-earners  |   .2018787    .036467     5.54   0.000     .1304046    .2733528
  27#Man primary-earner  |   .3885973   .1264735     3.07   0.002     .1407138    .6364808
27#Woman primary-earner  |   .3270043   .0430996     7.59   0.000     .2425307     .411478
       27#Equal-earners  |   .2052918   .0394612     5.20   0.000     .1279492    .2826344
  28#Man primary-earner  |   .3990562   .1342017     2.97   0.003     .1360258    .6620867
28#Woman primary-earner  |   .3356378   .0451285     7.44   0.000     .2471876     .424088
       28#Equal-earners  |   .2086773   .0426348     4.89   0.000     .1251146    .2922399
  29#Man primary-earner  |   .4093925   .1420013     2.88   0.004     .1310751    .6877099
29#Woman primary-earner  |   .3442865    .047199     7.29   0.000     .2517783    .4367948
       29#Equal-earners  |   .2120313    .045978     4.61   0.000      .121916    .3021466
------------------------------------------------------------------------------------------

. margin  relinc, at(index=(5(2)62)) predict(outcome(2))  /* Manage Equal */

Predictive margins                              Number of obs     =      7,118
Model VCE    : Robust

Expression   : Pr(pool==Manage___Together), predict(outcome(2))

1._at        : index           =           5

2._at        : index           =           7

3._at        : index           =           9

4._at        : index           =          11

5._at        : index           =          13

6._at        : index           =          15

7._at        : index           =          17

8._at        : index           =          19

9._at        : index           =          21

10._at       : index           =          23

11._at       : index           =          25

12._at       : index           =          27

13._at       : index           =          29

14._at       : index           =          31

15._at       : index           =          33

16._at       : index           =          35

17._at       : index           =          37

18._at       : index           =          39

19._at       : index           =          41

20._at       : index           =          43

21._at       : index           =          45

22._at       : index           =          47

23._at       : index           =          49

24._at       : index           =          51

25._at       : index           =          53

26._at       : index           =          55

27._at       : index           =          57

28._at       : index           =          59

29._at       : index           =          61

------------------------------------------------------------------------------------------
                         |            Delta-method
                         |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------------------+----------------------------------------------------------------
              _at#relinc |
   1#Man primary-earner  |    .604873   .0310781    19.46   0.000     .5439609     .665785
 1#Woman primary-earner  |   .5682002   .0373892    15.20   0.000     .4949187    .6414817
        1#Equal-earners  |   .5903211   .0429433    13.75   0.000     .5061538    .6744883
   2#Man primary-earner  |   .5902517   .0291993    20.21   0.000     .5330221    .6474813
 2#Woman primary-earner  |   .5572658   .0347336    16.04   0.000     .4891891    .6253424
        2#Equal-earners  |    .586376   .0409199    14.33   0.000     .5061744    .6665775
   3#Man primary-earner  |   .5753916     .02753    20.90   0.000     .5214337    .6293494
 3#Woman primary-earner  |   .5462302   .0325331    16.79   0.000     .4824664    .6099939
        3#Equal-earners  |   .5823003   .0390035    14.93   0.000     .5058549    .6587458
   4#Man primary-earner  |   .5603145   .0261272    21.45   0.000     .5091061    .6115228
 4#Woman primary-earner  |   .5351028   .0309091    17.31   0.000     .4745221    .5956836
        4#Equal-earners  |   .5780935    .037207    15.54   0.000     .5051691    .6510178
   5#Man primary-earner  |   .5450443    .025046    21.76   0.000      .495955    .5941335
 5#Woman primary-earner  |   .5238937   .0299721    17.48   0.000     .4651495    .5826379
        5#Equal-earners  |   .5737548   .0355458    16.14   0.000     .5040863    .6434233
   6#Man primary-earner  |   .5296066   .0243326    21.77   0.000     .4819156    .5772975
 6#Woman primary-earner  |   .5126131   .0297949    17.20   0.000     .4542162      .57101
        6#Equal-earners  |    .569284   .0340379    16.73   0.000      .502571     .635997
   7#Man primary-earner  |   .5140286   .0240149    21.40   0.000     .4669602     .561097
 7#Woman primary-earner  |   .5012718   .0303898    16.49   0.000     .4417089    .5608347
        7#Equal-earners  |   .5646809   .0327036    17.27   0.000      .500583    .6287787
   8#Man primary-earner  |   .4983391   .0240962    20.68   0.000     .4511115    .5455667
 8#Woman primary-earner  |   .4898809   .0317037    15.45   0.000     .4277428     .552019
        8#Equal-earners  |   .5599455   .0315653    17.74   0.000     .4980787    .6218123
   9#Man primary-earner  |    .482568   .0245524    19.65   0.000     .4344461    .5306899
 9#Woman primary-earner  |   .4784519   .0336351    14.22   0.000     .4125284    .5443755
        9#Equal-earners  |   .5550781   .0306462    18.11   0.000     .4950126    .6151437
  10#Man primary-earner  |   .4667463   .0253374    18.42   0.000      .417086    .5164066
10#Woman primary-earner  |   .4669966   .0360611    12.95   0.000     .3963182     .537675
       10#Equal-earners  |   .5500793   .0299694    18.35   0.000     .4913404    .6088181
  11#Man primary-earner  |    .450906   .0263906    17.09   0.000     .3991814    .5026305
11#Woman primary-earner  |    .455527   .0388602    11.72   0.000     .3793624    .5316916
       11#Equal-earners  |   .5449495   .0295552    18.44   0.000     .4870224    .6028767
  12#Man primary-earner  |   .4350795   .0276467    15.74   0.000      .380893     .489266
12#Woman primary-earner  |   .4440554   .0419249    10.59   0.000      .361884    .5262268
       12#Equal-earners  |     .53969   .0294199    18.34   0.000     .4820281    .5973519
  13#Man primary-earner  |   .4192997   .0290424    14.44   0.000     .3623775    .4762218
13#Woman primary-earner  |   .4325941   .0451655     9.58   0.000     .3440713    .5211168
       13#Equal-earners  |   .5343017   .0295733    18.07   0.000     .4763392    .5922642
  14#Man primary-earner  |   .4035994   .0305206    13.22   0.000     .3437801    .4634187
14#Woman primary-earner  |   .4211555    .048509     8.68   0.000     .3260796    .5162315
       14#Equal-earners  |   .5287862   .0300177    17.62   0.000     .4699525    .5876199
  15#Man primary-earner  |   .3880113   .0320317    12.11   0.000     .3252303    .4507923
15#Woman primary-earner  |   .4097524   .0518967     7.90   0.000     .3080367    .5114681
       15#Equal-earners  |   .5231451   .0307482    17.01   0.000     .4628798    .5834103
  16#Man primary-earner  |   .3725676   .0335342    11.11   0.000     .3068417    .4382934
16#Woman primary-earner  |   .3983971   .0552812     7.21   0.000      .290048    .5067462
       16#Equal-earners  |   .5173803   .0317525    16.29   0.000     .4551465    .5796142
  17#Man primary-earner  |   .3572996   .0349938    10.21   0.000     .2887131    .4258861
17#Woman primary-earner  |   .3871021   .0586238     6.60   0.000     .2722015    .5020027
       17#Equal-earners  |   .5114942   .0330138    15.49   0.000     .4467883    .5762001
  18#Man primary-earner  |   .3422377   .0363825     9.41   0.000     .2709293    .4135461
18#Woman primary-earner  |   .3758797   .0618929     6.07   0.000     .2545717    .4971876
       18#Equal-earners  |   .5054891   .0345116    14.65   0.000     .4378477    .5731305
  19#Man primary-earner  |   .3274109   .0376781     8.69   0.000     .2535631    .4012587
19#Woman primary-earner  |    .364742   .0650622     5.61   0.000     .2372224    .4922616
       19#Equal-earners  |   .4993678    .036224    13.79   0.000     .4283702    .5703655
  20#Man primary-earner  |   .3128467    .038863     8.05   0.000     .2366766    .3890168
20#Woman primary-earner  |    .353701   .0681097     5.19   0.000     .2202084    .4871935
       20#Equal-earners  |   .4931333    .038129    12.93   0.000     .4184019    .5678648
  21#Man primary-earner  |   .2985708   .0399237     7.48   0.000     .2203217    .3768199
21#Woman primary-earner  |   .3427681   .0710169     4.83   0.000     .2035775    .4819588
       21#Equal-earners  |   .4867889   .0402055    12.11   0.000     .4079875    .5655903
  22#Man primary-earner  |   .2846071   .0408504     6.97   0.000     .2045419    .3646724
22#Woman primary-earner  |   .3319548   .0737686     4.50   0.000      .187371    .4765385
       22#Equal-earners  |   .4803381   .0424339    11.32   0.000     .3971693     .563507
  23#Man primary-earner  |   .2709773   .0416362     6.51   0.000      .189372    .3525827
23#Woman primary-earner  |   .3212717   .0763518     4.21   0.000     .1716248    .4709185
       23#Equal-earners  |   .4737847   .0447958    10.58   0.000     .3859865    .5615829
  24#Man primary-earner  |   .2577009    .042277     6.10   0.000     .1748396    .3405623
24#Woman primary-earner  |   .3107293   .0787562     3.95   0.000       .15637    .4650886
       24#Equal-earners  |   .4671328   .0472749     9.88   0.000     .3744756    .5597899
  25#Man primary-earner  |   .2447952   .0427712     5.72   0.000     .1609652    .3286251
25#Woman primary-earner  |   .3003375   .0809732     3.71   0.000      .141633     .459042
       25#Equal-earners  |   .4603866   .0498561     9.23   0.000     .3626705    .5581027
  26#Man primary-earner  |   .2322748   .0431191     5.39   0.000     .1477629    .3167867
26#Woman primary-earner  |   .2901057   .0829961     3.50   0.000     .1274362    .4527751
       26#Equal-earners  |   .4535508   .0525255     8.63   0.000     .3506027    .5564988
  27#Man primary-earner  |   .2201524   .0433231     5.08   0.000     .1352408    .3050641
27#Woman primary-earner  |   .2800427   .0848203     3.30   0.001     .1137979    .4462874
       27#Equal-earners  |   .4466301   .0552705     8.08   0.000     .3383018    .5549583
  28#Man primary-earner  |    .208438   .0433868     4.80   0.000     .1234014    .2934746
28#Woman primary-earner  |   .2701567   .0864424     3.13   0.002     .1007328    .4395806
       28#Equal-earners  |   .4396295   .0580794     7.57   0.000      .325796    .5534629
  29#Man primary-earner  |   .1971393   .0433155     4.55   0.000     .1122424    .2820362
29#Woman primary-earner  |   .2604553   .0878605     2.96   0.003     .0882519    .4326588
       29#Equal-earners  |   .4325543   .0609409     7.10   0.000     .3131122    .5519963
------------------------------------------------------------------------------------------

. margin  relinc, at(index=(5(2)62)) predict(outcome(3))  /* Pool Some    */

Predictive margins                              Number of obs     =      7,118
Model VCE    : Robust

Expression   : Pr(pool==Keep_Some___Separate), predict(outcome(3))

1._at        : index           =           5

2._at        : index           =           7

3._at        : index           =           9

4._at        : index           =          11

5._at        : index           =          13

6._at        : index           =          15

7._at        : index           =          17

8._at        : index           =          19

9._at        : index           =          21

10._at       : index           =          23

11._at       : index           =          25

12._at       : index           =          27

13._at       : index           =          29

14._at       : index           =          31

15._at       : index           =          33

16._at       : index           =          35

17._at       : index           =          37

18._at       : index           =          39

19._at       : index           =          41

20._at       : index           =          43

21._at       : index           =          45

22._at       : index           =          47

23._at       : index           =          49

24._at       : index           =          51

25._at       : index           =          53

26._at       : index           =          55

27._at       : index           =          57

28._at       : index           =          59

29._at       : index           =          61

------------------------------------------------------------------------------------------
                         |            Delta-method
                         |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------------------+----------------------------------------------------------------
              _at#relinc |
   1#Man primary-earner  |   .1767974   .0248514     7.11   0.000     .1280896    .2255052
 1#Woman primary-earner  |   .1905463   .0260077     7.33   0.000     .1395722    .2415204
        1#Equal-earners  |   .2053409   .0232518     8.83   0.000     .1597682    .2509135
   2#Man primary-earner  |   .1800788   .0229128     7.86   0.000     .1351706     .224987
 2#Woman primary-earner  |    .193346   .0241024     8.02   0.000     .1461061    .2405859
        2#Equal-earners  |   .2026569    .021148     9.58   0.000     .1612075    .2441062
   3#Man primary-earner  |   .1832476   .0212221     8.63   0.000      .141653    .2248422
 3#Woman primary-earner  |   .1960871   .0225437     8.70   0.000     .1519022    .2402719
        3#Equal-earners  |   .1999453   .0193184    10.35   0.000      .162082    .2378085
   4#Man primary-earner  |   .1862926   .0198922     9.37   0.000     .1473045    .2252807
 4#Woman primary-earner  |   .1987647   .0214289     9.28   0.000     .1567647    .2407646
        4#Equal-earners  |   .1972067   .0178224    11.07   0.000     .1622754    .2321381
   5#Man primary-earner  |   .1892028   .0190481     9.93   0.000     .1518692    .2265365
 5#Woman primary-earner  |    .201374   .0208481     9.66   0.000     .1605123    .2422356
        5#Equal-earners  |    .194442    .016723    11.63   0.000     .1616655    .2272185
   6#Man primary-earner  |   .1919676   .0188023    10.21   0.000     .1551158    .2288193
 6#Woman primary-earner  |   .2039102   .0208606     9.77   0.000     .1630243    .2447961
        6#Equal-earners  |   .1916519   .0160731    11.92   0.000     .1601493    .2231545
   7#Man primary-earner  |   .1945764   .0192198    10.12   0.000     .1569062    .2322466
 7#Woman primary-earner  |   .2063687   .0214753     9.61   0.000     .1642778    .2484596
        7#Equal-earners  |   .1888374   .0158986    11.88   0.000     .1576768    .2199981
   8#Man primary-earner  |   .1970195   .0202961     9.71   0.000     .1572398    .2367991
 8#Woman primary-earner  |   .2087448   .0226494     9.22   0.000     .1643529    .2531367
        8#Equal-earners  |   .1859996    .016186    11.49   0.000     .1542756    .2177235
   9#Man primary-earner  |   .1992873    .021964     9.07   0.000     .1562387     .242336
 9#Woman primary-earner  |    .211034   .0243036     8.68   0.000     .1633999    .2586681
        9#Equal-earners  |   .1831394   .0168838    10.85   0.000     .1500478    .2162311
  10#Man primary-earner  |   .2013713   .0241242     8.35   0.000     .1540888    .2486539
10#Woman primary-earner  |   .2132321   .0263461     8.09   0.000     .1615946    .2648696
       10#Equal-earners  |   .1802582   .0179176    10.06   0.000     .1451403    .2153761
  11#Man primary-earner  |   .2032634   .0266746     7.62   0.000     .1509822    .2555446
11#Woman primary-earner  |   .2153348     .02869     7.51   0.000     .1591035    .2715662
       11#Equal-earners  |    .177357   .0192085     9.23   0.000     .1397091     .215005
  12#Man primary-earner  |   .2049564   .0295264     6.94   0.000     .1470856    .2628271
12#Woman primary-earner  |   .2173382   .0312608     6.95   0.000     .1560681    .2786083
       12#Equal-earners  |   .1744374   .0206852     8.43   0.000     .1338952    .2149795
  13#Man primary-earner  |   .2064439   .0326084     6.33   0.000     .1425326    .2703551
13#Woman primary-earner  |   .2192385    .033999     6.45   0.000     .1526017    .2858753
       13#Equal-earners  |   .1715005   .0222893     7.69   0.000     .1278144    .2151867
  14#Man primary-earner  |   .2077205   .0358652     5.79   0.000      .137426     .278015
14#Woman primary-earner  |   .2210321   .0368576     6.00   0.000     .1487925    .2932716
       14#Equal-earners  |    .168548   .0239753     7.03   0.000     .1215574    .2155387
  15#Man primary-earner  |    .208782   .0392541     5.32   0.000     .1318454    .2857186
15#Woman primary-earner  |   .2227156   .0398001     5.60   0.000     .1447088    .3007224
       15#Equal-earners  |   .1655814   .0257085     6.44   0.000     .1151936    .2159692
  16#Man primary-earner  |   .2096249   .0427417     4.90   0.000     .1258526    .2933972
16#Woman primary-earner  |   .2242861   .0427981     5.24   0.000     .1404033    .3081689
       16#Equal-earners  |   .1626023   .0274629     5.92   0.000      .108776    .2164285
  17#Man primary-earner  |   .2102469   .0463015     4.54   0.000     .1194977    .3009962
17#Woman primary-earner  |   .2257407   .0458291     4.93   0.000     .1359174    .3155641
       17#Equal-earners  |   .1596123   .0292185     5.46   0.000     .1023451    .2168795
  18#Man primary-earner  |   .2106469   .0499117     4.22   0.000     .1128219     .308472
18#Woman primary-earner  |    .227077   .0488751     4.65   0.000     .1312836    .3228704
       18#Equal-earners  |   .1566133   .0309602     5.06   0.000     .0959325     .217294
  19#Man primary-earner  |   .2108248    .053554     3.94   0.000     .1058608    .3157888
19#Woman primary-earner  |   .2282927   .0519216     4.40   0.000     .1265281    .3300572
       19#Equal-earners  |   .1536069   .0326762     4.70   0.000     .0895627    .2176511
  20#Man primary-earner  |   .2107816   .0572131     3.68   0.000     .0986461    .3229172
20#Woman primary-earner  |   .2293859   .0549569     4.17   0.000     .1216723    .3370995
       20#Equal-earners  |   .1505951   .0343574     4.38   0.000     .0832557    .2179344
  21#Man primary-earner  |   .2105194    .060875     3.46   0.001     .0912065    .3298323
21#Woman primary-earner  |   .2303551   .0579712     3.97   0.000     .1167336    .3439766
       21#Equal-earners  |   .1475797   .0359966     4.10   0.000     .0770276    .2181318
  22#Man primary-earner  |   .2100413   .0645278     3.26   0.001     .0835691    .3365134
22#Woman primary-earner  |    .231199   .0609564     3.79   0.000     .1117265    .3506714
       22#Equal-earners  |   .1445627   .0375879     3.85   0.000     .0708917    .2182337
  23#Man primary-earner  |   .2093513   .0681602     3.07   0.002     .0757598    .3429428
23#Woman primary-earner  |   .2319166   .0639059     3.63   0.000     .1066634    .3571699
       23#Equal-earners  |    .141546   .0391267     3.62   0.000     .0648591    .2182328
  24#Man primary-earner  |   .2084545   .0717621     2.90   0.004     .0678035    .3491056
24#Woman primary-earner  |   .2325075    .066814     3.48   0.001     .1015544    .3634605
       24#Equal-earners  |   .1385316    .040609     3.41   0.001     .0589395    .2181238
  25#Man primary-earner  |   .2073569   .0753239     2.75   0.006     .0597247    .3549891
25#Woman primary-earner  |   .2329712   .0696761     3.34   0.001     .0964085    .3695339
       25#Equal-earners  |   .1355216   .0420317     3.22   0.001     .0531409    .2179023
  26#Man primary-earner  |   .2060652   .0788369     2.61   0.009     .0515476    .3605827
26#Woman primary-earner  |   .2333079   .0724884     3.22   0.001     .0912333    .3753825
       26#Equal-earners  |   .1325181   .0433923     3.05   0.002     .0474707    .2175655
  27#Man primary-earner  |   .2045867   .0822928     2.49   0.013     .0432958    .3658776
27#Woman primary-earner  |   .2335179   .0752476     3.10   0.002     .0860354    .3810005
       27#Equal-earners  |   .1295229   .0446886     2.90   0.004     .0419348     .217111
  28#Man primary-earner  |   .2029296   .0856836     2.37   0.018     .0349927    .3708664
28#Woman primary-earner  |    .233602   .0779512     3.00   0.003     .0808205    .3863836
       28#Equal-earners  |   .1265383   .0459189     2.76   0.006      .036539    .2165377
  29#Man primary-earner  |   .2011024   .0890021     2.26   0.024     .0266614    .3755434
29#Woman primary-earner  |   .2335611   .0805972     2.90   0.004     .0755936    .3915287
       29#Equal-earners  |   .1235664   .0470817     2.62   0.009     .0312879    .2158448
------------------------------------------------------------------------------------------

. margin  relinc, at(index=(5(2)62)) predict(outcome(4))  /* Keep Sep             */

Predictive margins                              Number of obs     =      7,118
Model VCE    : Robust

Expression   : Pr(pool==Keep_All___Separate), predict(outcome(4))

1._at        : index           =           5

2._at        : index           =           7

3._at        : index           =           9

4._at        : index           =          11

5._at        : index           =          13

6._at        : index           =          15

7._at        : index           =          17

8._at        : index           =          19

9._at        : index           =          21

10._at       : index           =          23

11._at       : index           =          25

12._at       : index           =          27

13._at       : index           =          29

14._at       : index           =          31

15._at       : index           =          33

16._at       : index           =          35

17._at       : index           =          37

18._at       : index           =          39

19._at       : index           =          41

20._at       : index           =          43

21._at       : index           =          45

22._at       : index           =          47

23._at       : index           =          49

24._at       : index           =          51

25._at       : index           =          53

26._at       : index           =          55

27._at       : index           =          57

28._at       : index           =          59

29._at       : index           =          61

------------------------------------------------------------------------------------------
                         |            Delta-method
                         |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------------------+----------------------------------------------------------------
              _at#relinc |
   1#Man primary-earner  |   .0882017   .0173598     5.08   0.000     .0541771    .1222262
 1#Woman primary-earner  |    .109243   .0167547     6.52   0.000     .0764044    .1420816
        1#Equal-earners  |   .0867998   .0205618     4.22   0.000     .0464994    .1271002
   2#Man primary-earner  |   .0919305   .0169529     5.42   0.000     .0587034    .1251576
 2#Woman primary-earner  |   .1115781   .0163222     6.84   0.000     .0795872    .1435689
        2#Equal-earners  |   .0903743   .0199133     4.54   0.000      .051345    .1294036
   3#Man primary-earner  |   .0957262   .0165603     5.78   0.000     .0632686    .1281839
 3#Woman primary-earner  |   .1139059   .0159054     7.16   0.000      .082732    .1450799
        3#Equal-earners  |   .0940639   .0193221     4.87   0.000     .0561933    .1319345
   4#Man primary-earner  |   .0995828    .016204     6.15   0.000     .0678236     .131342
 4#Woman primary-earner  |   .1162234   .0155086     7.49   0.000     .0858271    .1466198
        4#Equal-earners  |   .0978702   .0188303     5.20   0.000     .0609634     .134777
   5#Man primary-earner  |   .1034938   .0159104     6.50   0.000       .07231    .1346775
 5#Woman primary-earner  |   .1185274   .0151366     7.83   0.000     .0888602    .1481946
        5#Equal-earners  |   .1017944   .0184885     5.51   0.000     .0655575    .1380313
   6#Man primary-earner  |   .1074521   .0157106     6.84   0.000     .0766598    .1382443
 6#Woman primary-earner  |   .1208146   .0147941     8.17   0.000     .0918186    .1498106
        6#Equal-earners  |   .1058378   .0183535     5.77   0.000     .0698655      .14181
   7#Man primary-earner  |   .1114504   .0156391     7.13   0.000     .0807983    .1421024
 7#Woman primary-earner  |   .1230818   .0144863     8.50   0.000     .0946891    .1514745
        7#Equal-earners  |   .1100014   .0184837     5.95   0.000     .0737741    .1462287
   8#Man primary-earner  |   .1154808   .0157313     7.34   0.000     .0846479    .1463136
 8#Woman primary-earner  |   .1253256   .0142183     8.81   0.000     .0974582     .153193
        8#Equal-earners  |   .1142863   .0189319     6.04   0.000     .0771804    .1513921
   9#Man primary-earner  |   .1195351   .0160209     7.46   0.000     .0881348    .1509354
 9#Woman primary-earner  |   .1275428   .0139953     9.11   0.000     .1001126     .154973
        9#Equal-earners  |    .118693   .0197384     6.01   0.000     .0800065    .1573795
  10#Man primary-earner  |   .1236048   .0165357     7.48   0.000     .0911955    .1560141
10#Woman primary-earner  |   .1297301   .0138222     9.39   0.000     .1026391    .1568211
       10#Equal-earners  |   .1232223   .0209255     5.89   0.000     .0822091    .1642356
  11#Man primary-earner  |   .1276812   .0172952     7.38   0.000     .0937833    .1615791
11#Woman primary-earner  |   .1318842   .0137039     9.62   0.000     .1050251    .1587433
       11#Equal-earners  |   .1278746   .0224978     5.68   0.000     .0837797    .1719695
  12#Man primary-earner  |   .1317552   .0183091     7.20   0.000     .0958701    .1676403
12#Woman primary-earner  |   .1340018   .0136445     9.82   0.000      .107259    .1607446
       12#Equal-earners  |   .1326499   .0244454     5.43   0.000     .0847377    .1805621
  13#Man primary-earner  |   .1358178    .019578     6.94   0.000     .0974456      .17419
13#Woman primary-earner  |   .1360798   .0136478     9.97   0.000     .1093306    .1628291
       13#Equal-earners  |   .1375484   .0267499     5.14   0.000     .0851196    .1899773
  14#Man primary-earner  |   .1398598   .0210954     6.63   0.000     .0985135    .1812061
14#Woman primary-earner  |   .1381151   .0137166    10.07   0.000     .1112309    .1649992
       14#Equal-earners  |   .1425699   .0293891     4.85   0.000     .0849683    .2001715
  15#Man primary-earner  |    .143872   .0228505     6.30   0.000     .0990859    .1886582
15#Woman primary-earner  |   .1401044    .013853    10.11   0.000     .1129531    .1672558
       15#Equal-earners  |   .1477139    .032341     4.57   0.000     .0843268    .2111011
  16#Man primary-earner  |   .1478454   .0248302     5.95   0.000     .0991792    .1965116
16#Woman primary-earner  |    .142045   .0140579    10.10   0.000      .114492     .169598
       16#Equal-earners  |   .1529799   .0355852     4.30   0.000     .0832341    .2227257
  17#Man primary-earner  |    .151771    .027021     5.62   0.000     .0988108    .2047311
17#Woman primary-earner  |   .1439338   .0143316    10.04   0.000     .1158443    .1720232
       17#Equal-earners  |    .158367   .0391042     4.05   0.000     .0817241    .2350099
  18#Man primary-earner  |   .1556401   .0294102     5.29   0.000     .0979971     .213283
18#Woman primary-earner  |   .1457681   .0146734     9.93   0.000     .1170087    .1745275
       18#Equal-earners  |   .1638742    .042883     3.82   0.000      .079825    .2479234
  19#Man primary-earner  |   .1594442   .0319861     4.98   0.000     .0967525    .2221359
19#Woman primary-earner  |   .1475452    .015082     9.78   0.000     .1179851    .1771054
       19#Equal-earners  |   .1695001   .0469089     3.61   0.000     .0775604    .2614399
  20#Man primary-earner  |   .1631753   .0347384     4.70   0.000     .0950893    .2312613
20#Woman primary-earner  |   .1492627   .0155553     9.60   0.000     .1187749    .1797505
       20#Equal-earners  |   .1752434   .0511711     3.42   0.001     .0749498     .275537
  21#Man primary-earner  |   .1668256   .0376579     4.43   0.000     .0930176    .2406337
21#Woman primary-earner  |   .1509181    .016091     9.38   0.000     .1193804    .1824559
       21#Equal-earners  |   .1811022   .0556604     3.25   0.001     .0720098    .2901946
  22#Man primary-earner  |    .170388   .0407364     4.18   0.000      .090546      .25023
22#Woman primary-earner  |   .1525093   .0166863     9.14   0.000     .1198047    .1852139
       22#Equal-earners  |   .1870746   .0603685     3.10   0.002     .0687544    .3053947
  23#Man primary-earner  |   .1738557   .0439669     3.95   0.000     .0876821    .2600292
23#Woman primary-earner  |   .1540341   .0173385     8.88   0.000     .1200513    .1880169
       23#Equal-earners  |   .1931583   .0652881     2.96   0.003      .065196    .3211207
  24#Man primary-earner  |   .1772224   .0473428     3.74   0.000     .0844322    .2700126
24#Woman primary-earner  |   .1554907   .0180445     8.62   0.000     .1201241    .1908573
       24#Equal-earners  |    .199351   .0704122     2.83   0.005     .0613456    .3373565
  25#Man primary-earner  |   .1804825   .0508582     3.55   0.000     .0808023    .2801628
25#Woman primary-earner  |   .1568774   .0188015     8.34   0.000     .1200272    .1937276
       25#Equal-earners  |     .20565   .0757343     2.72   0.007     .0572135    .3540866
  26#Man primary-earner  |   .1836311   .0545075     3.37   0.001     .0767983    .2904638
26#Woman primary-earner  |   .1581927   .0196064     8.07   0.000     .1197648    .1966206
       26#Equal-earners  |   .2120525    .081248     2.61   0.009     .0528093    .3712956
  27#Man primary-earner  |   .1866636   .0582855     3.20   0.001     .0724261    .3009011
27#Woman primary-earner  |   .1594351   .0204566     7.79   0.000     .1193409    .1995292
       27#Equal-earners  |   .2185552   .0869468     2.51   0.012     .0481426    .3889678
  28#Man primary-earner  |   .1895762   .0621871     3.05   0.002     .0676917    .3114607
28#Woman primary-earner  |   .1606035   .0213492     7.52   0.000     .1187599    .2024471
       28#Equal-earners  |   .2251549   .0928243     2.43   0.015     .0432226    .4070872
  29#Man primary-earner  |   .1923658   .0662073     2.91   0.004     .0626017    .3221298
29#Woman primary-earner  |    .161697   .0222815     7.26   0.000     .1180261    .2053679
       29#Equal-earners  |   .2318481   .0988739     2.34   0.019     .0380588    .4256373
------------------------------------------------------------------------------------------

. 
. **********************************************************************************************************************
. *Table 4 - Model 6
. **********************************************************************************************************************
. global  ivars "i.marst sex age parent i.employ homemaker ib4.degree hswrk respmom famlife duration"

. 
. mlogit          pool    c.index##i.marst                i.relinc $ivars                                         , cluster(country) rrr

Iteration 0:   log pseudolikelihood = -8556.7479  
Iteration 1:   log pseudolikelihood = -7735.0391  
Iteration 2:   log pseudolikelihood = -7697.3405  
Iteration 3:   log pseudolikelihood = -7697.0997  
Iteration 4:   log pseudolikelihood = -7697.0997  

Multinomial logistic regression                 Number of obs     =      7,118
                                                Wald chi2(14)     =          .
                                                Prob > chi2       =          .
Log pseudolikelihood = -7697.0997               Pseudo R2         =     0.1005

                                        (Std. Err. adjusted for 18 clusters in country)
---------------------------------------------------------------------------------------
                      |               Robust
                 pool |        RRR   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
One___Manager         |
                index |   1.037689   .0075267     5.10   0.000     1.023041    1.052546
                      |
                marst |
               Cohab  |   1.382462   .2616618     1.71   0.087     .9539914    2.003375
                      |
        marst#c.index |
               Cohab  |   .9985373   .0059331    -0.25   0.805     .9869761    1.010234
                      |
               relinc |
Woman primary-earner  |   .9630976   .1495988    -0.24   0.809     .7103173    1.305835
       Equal-earners  |    .674711   .1627857    -1.63   0.103     .4204852    1.082642
                      |
                  sex |   .9849491   .1873347    -0.08   0.936     .6784494    1.429915
                  age |   .9844112   .0051609    -3.00   0.003     .9743478    .9945785
               parent |   .8642866   .1149294    -1.10   0.273      .665991    1.121624
                      |
               employ |
            Parttime  |   1.093345   .1240107     0.79   0.431     .8754098    1.365537
          Unemployed  |   1.388721   .4000511     1.14   0.254     .7896016    2.442429
             Student  |   1.595528   .2419294     3.08   0.002     1.185324    2.147691
  Not in labor force  |   .7319305   .1009647    -2.26   0.024     .5585378    .9591513
                      |
            homemaker |   1.175028   .1244493     1.52   0.128     .9547636    1.446107
                      |
               degree |
 No formal education  |   1.788634   .5908846     1.76   0.078      .936101    3.417594
      Primary school  |   1.649761   .3021908     2.73   0.006     1.152137    2.362314
     Lower secondary  |   .9981421    .205693    -0.01   0.993     .6664695    1.494873
      Post secondary  |   .9650865    .203903    -0.17   0.866     .6378592    1.460184
Lower level tertiary  |   .5766888   .1289704    -2.46   0.014     .3720311    .8939306
Upper level tertiary  |   .5621361   .1130662    -2.86   0.004     .3789952    .8337759
                      |
                hswrk |   .8954095   .0310524    -3.19   0.001     .8365703    .9583871
              respmom |   1.018733   .0970766     0.19   0.846     .8451782    1.227928
              famlife |   .7913543    .068858    -2.69   0.007     .6672759    .9385048
             duration |   1.441402   .2279758     2.31   0.021       1.0572     1.96523
                _cons |   1.416144   1.126261     0.44   0.662     .2979515     6.73084
----------------------+----------------------------------------------------------------
Manage___Together     |  (base outcome)
----------------------+----------------------------------------------------------------
Keep_Some___Separate  |
                index |   1.028866   .0105375     2.78   0.005     1.008419    1.049728
                      |
                marst |
               Cohab  |   7.187383   1.335227    10.62   0.000     4.993901    10.34431
                      |
        marst#c.index |
               Cohab  |   .9420298   .0115708    -4.86   0.000     .9196223    .9649833
                      |
               relinc |
Woman primary-earner  |   1.124363   .1237166     1.07   0.287     .9062471    1.394975
       Equal-earners  |   .9600422   .1230266    -0.32   0.750     .7468121    1.234154
                      |
                  sex |   1.089621   .1179803     0.79   0.428     .8812733    1.347227
                  age |   .9854192   .0047314    -3.06   0.002     .9761893    .9947364
               parent |   .9371039   .0760458    -0.80   0.423     .7993056    1.098658
                      |
               employ |
            Parttime  |   .6295029   .1043923    -2.79   0.005     .4548209    .8712745
          Unemployed  |   .7707864   .1823093    -1.10   0.271     .4848469    1.225359
             Student  |   .6521129   .0876495    -3.18   0.001     .5010881    .8486557
  Not in labor force  |   .8083184   .1132858    -1.52   0.129     .6141671    1.063845
                      |
            homemaker |   .7810112   .0809244    -2.39   0.017     .6374705    .9568733
                      |
               degree |
 No formal education  |   1.790669   .7837324     1.33   0.183     .7593905    4.222461
      Primary school  |   .8881697   .1646826    -0.64   0.522      .617544    1.277391
     Lower secondary  |   .9066344   .1275082    -0.70   0.486     .6882084    1.194385
      Post secondary  |   .9694712   .1565822    -0.19   0.848     .7064067      1.3305
Lower level tertiary  |   1.571078   .1788317     3.97   0.000      1.25692    1.963758
Upper level tertiary  |   2.084967   .2554118     6.00   0.000     1.639931    2.650774
                      |
                hswrk |   .9736444   .0203501    -1.28   0.201     .9345649    1.014358
              respmom |   1.306989   .1704124     2.05   0.040     1.012249    1.687548
              famlife |   .7981475   .0353849    -5.09   0.000     .7317222    .8706029
             duration |   1.340879   .2889467     1.36   0.173     .8789494    2.045575
                _cons |   .8334442   .3982205    -0.38   0.703     .3267169    2.126089
----------------------+----------------------------------------------------------------
Keep_All___Separate   |
                index |   1.039091   .0098213     4.06   0.000     1.020019     1.05852
                      |
                marst |
               Cohab  |   7.799206   2.093626     7.65   0.000     4.608431     13.1992
                      |
        marst#c.index |
               Cohab  |   .9637367   .0184061    -1.93   0.053     .9283282    1.000496
                      |
               relinc |
Woman primary-earner  |   1.169575   .1892206     0.97   0.333     .8517568    1.605981
       Equal-earners  |   .9313928   .1162951    -0.57   0.569     .7292066    1.189639
                      |
                  sex |   1.120611   .1191894     1.07   0.284     .9097456    1.380351
                  age |   .9942274   .0080877    -0.71   0.477     .9785015    1.010206
               parent |   .9709737   .1355778    -0.21   0.833     .7385052    1.276619
                      |
               employ |
            Parttime  |   .5486409   .1026587    -3.21   0.001     .3802034    .7916994
          Unemployed  |   1.371188   .4680726     0.92   0.355     .7023093    2.677106
             Student  |   .8177741    .230582    -0.71   0.476      .470572    1.421152
  Not in labor force  |   1.232675   .1471607     1.75   0.080     .9755046    1.557642
                      |
            homemaker |   .7597883   .0945571    -2.21   0.027     .5953316    .9696751
                      |
               degree |
 No formal education  |    1.79305   .5681189     1.84   0.065     .9635925    3.336502
      Primary school  |   1.391287   .3147137     1.46   0.144     .8930429    2.167511
     Lower secondary  |   1.302464    .246288     1.40   0.162     .8991012    1.886786
      Post secondary  |   1.501908   .2260026     2.70   0.007     1.118297     2.01711
Lower level tertiary  |   1.759338   .2274668     4.37   0.000     1.365515    2.266742
Upper level tertiary  |   1.903141   .4165617     2.94   0.003      1.23925    2.922691
                      |
                hswrk |   1.043637   .0325373     1.37   0.171     .9817739    1.109397
              respmom |   .9344663   .1603641    -0.39   0.693     .6675574    1.308093
              famlife |   .6587939   .0217933   -12.62   0.000     .6174352    .7029231
             duration |   1.601335   .3088947     2.44   0.015     1.097203    2.337101
                _cons |   .5910593    .357162    -0.87   0.384     .1808305    1.931926
---------------------------------------------------------------------------------------
Note: _cons estimates baseline relative risk for each outcome.

. estat           ic

Akaike's information criterion and Bayesian information criterion

-----------------------------------------------------------------------------
       Model |        Obs  ll(null)  ll(model)      df         AIC        BIC
-------------+---------------------------------------------------------------
           . |      7,118 -8556.748    -7697.1      17     15428.2      15545
-----------------------------------------------------------------------------
               Note: N=Obs used in calculating BIC; see [R] BIC note.

. 
. 
. // Figure 3
. mlogit          pool    c.index##i.marst                i.relinc $ivars                                         , cluster(country)

Iteration 0:   log pseudolikelihood = -8556.7479  
Iteration 1:   log pseudolikelihood = -7735.0391  
Iteration 2:   log pseudolikelihood = -7697.3405  
Iteration 3:   log pseudolikelihood = -7697.0997  
Iteration 4:   log pseudolikelihood = -7697.0997  

Multinomial logistic regression                 Number of obs     =      7,118
                                                Wald chi2(14)     =          .
                                                Prob > chi2       =          .
Log pseudolikelihood = -7697.0997               Pseudo R2         =     0.1005

                                        (Std. Err. adjusted for 18 clusters in country)
---------------------------------------------------------------------------------------
                      |               Robust
                 pool |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
One___Manager         |
                index |   .0369957   .0072533     5.10   0.000     .0227794    .0512119
                      |
                marst |
               Cohab  |   .3238662   .1892723     1.71   0.087    -.0471007    .6948331
                      |
        marst#c.index |
               Cohab  |  -.0014637   .0059418    -0.25   0.805    -.0131094     .010182
                      |
               relinc |
Woman primary-earner  |  -.0376005   .1553309    -0.24   0.809    -.3420436    .2668425
       Equal-earners  |  -.3934708   .2412672    -1.63   0.103    -.8663459    .0794043
                      |
                  sex |  -.0151653   .1901974    -0.08   0.936    -.3879454    .3576147
                  age |  -.0157116   .0052426    -3.00   0.003    -.0259869   -.0054362
               parent |  -.1458508    .132976    -1.10   0.273    -.4064791    .1147774
                      |
               employ |
            Parttime  |   .0892421   .1134232     0.79   0.431    -.1330632    .3115474
          Unemployed  |   .3283832   .2880716     1.14   0.254    -.2362268    .8929932
             Student  |   .4672046   .1516297     3.08   0.002     .1700159    .7643934
  Not in labor force  |  -.3120697    .137943    -2.26   0.024     -.582433   -.0417064
                      |
            homemaker |   .1612918   .1059118     1.52   0.128    -.0462915    .3688751
                      |
               degree |
 No formal education  |   .5814524   .3303552     1.76   0.078    -.0660319    1.228937
      Primary school  |   .5006302   .1831725     2.73   0.006     .1416187    .8596418
     Lower secondary  |  -.0018596   .2060758    -0.01   0.993    -.4057608    .4020416
      Post secondary  |  -.0355375   .2112795    -0.17   0.866    -.4496378    .3785627
Lower level tertiary  |  -.5504526   .2236395    -2.46   0.014    -.9887779   -.1121272
Upper level tertiary  |  -.5760112   .2011366    -2.86   0.004    -.9702318   -.1817907
                      |
                hswrk |  -.1104741   .0346795    -3.19   0.001    -.1784447   -.0425035
              respmom |   .0185601   .0952915     0.19   0.846    -.1682078     .205328
              famlife |  -.2340095   .0870129    -2.69   0.007    -.4045516   -.0634673
             duration |   .3656163   .1581625     2.31   0.021     .0556235    .6756092
                _cons |   .3479376   .7953015     0.44   0.662    -1.210825      1.9067
----------------------+----------------------------------------------------------------
Manage___Together     |  (base outcome)
----------------------+----------------------------------------------------------------
Keep_Some___Separate  |
                index |   .0284576   .0102418     2.78   0.005      .008384    .0485313
                      |
                marst |
               Cohab  |   1.972327   .1857737    10.62   0.000     1.608217    2.336437
                      |
        marst#c.index |
               Cohab  |  -.0597184   .0122828    -4.86   0.000    -.0837923   -.0356445
                      |
               relinc |
Woman primary-earner  |   .1172166   .1100326     1.07   0.287    -.0984433    .3328765
       Equal-earners  |   -.040778   .1281471    -0.32   0.750    -.2919416    .2103856
                      |
                  sex |   .0858303   .1082764     0.79   0.428    -.1263875    .2980481
                  age |  -.0146881   .0048014    -3.06   0.002    -.0240988   -.0052775
               parent |  -.0649611   .0811498    -0.80   0.423    -.2240119    .0940896
                      |
               employ |
            Parttime  |  -.4628248    .165833    -2.79   0.005    -.7878515   -.1377982
          Unemployed  |   -.260344   .2365238    -1.10   0.271    -.7239221     .203234
             Student  |  -.4275376   .1344085    -3.18   0.001    -.6909734   -.1641018
  Not in labor force  |  -.2127992     .14015    -1.52   0.129    -.4874882    .0618897
                      |
            homemaker |  -.2471658   .1036149    -2.39   0.017    -.4502473   -.0440843
                      |
               degree |
 No formal education  |   .5825895   .4376757     1.33   0.183    -.2752391    1.440418
      Primary school  |  -.1185925   .1854179    -0.64   0.522    -.4820049      .24482
     Lower secondary  |   -.098016   .1406391    -0.70   0.486    -.3736636    .1776315
      Post secondary  |  -.0310045    .161513    -0.19   0.848    -.3475642    .2855552
Lower level tertiary  |   .4517622   .1138274     3.97   0.000     .2286646    .6748598
Upper level tertiary  |   .7347529   .1225016     6.00   0.000     .4946542    .9748516
                      |
                hswrk |  -.0267091    .020901    -1.28   0.201    -.0676742     .014256
              respmom |   .2677258   .1303855     2.05   0.040     .0121748    .5232767
              famlife |  -.2254619   .0443337    -5.09   0.000    -.3123544   -.1385693
             duration |   .2933256   .2154904     1.36   0.173    -.1290279    .7156791
                _cons |  -.1821886    .477801    -0.38   0.703    -1.118661    .7542842
----------------------+----------------------------------------------------------------
Keep_All___Separate   |
                index |   .0383464   .0094518     4.06   0.000     .0198212    .0568715
                      |
                marst |
               Cohab  |   2.054022   .2684409     7.65   0.000     1.527887    2.580156
                      |
        marst#c.index |
               Cohab  |  -.0369372   .0190987    -1.93   0.053    -.0743699    .0004955
                      |
               relinc |
Woman primary-earner  |   .1566402   .1617858     0.97   0.333    -.1604542    .4737346
       Equal-earners  |  -.0710742   .1248615    -0.57   0.569    -.3157982    .1736499
                      |
                  sex |   .1138737   .1063611     1.07   0.284    -.0945902    .3223377
                  age |  -.0057894   .0081346    -0.71   0.477     -.021733    .0101542
               parent |  -.0294559   .1396308    -0.21   0.833    -.3031272    .2442155
                      |
               employ |
            Parttime  |  -.6003112   .1871145    -3.21   0.001    -.9670488   -.2335735
          Unemployed  |   .3156775   .3413628     0.92   0.355    -.3533814    .9847363
             Student  |  -.2011691    .281963    -0.71   0.476    -.7538064    .3514681
  Not in labor force  |   .2091864   .1193832     1.75   0.080    -.0248004    .4431733
                      |
            homemaker |  -.2747155   .1244519    -2.21   0.027    -.5186367   -.0307942
                      |
               degree |
 No formal education  |   .5839181    .316845     1.84   0.065    -.0370868    1.204923
      Primary school  |   .3302295   .2262032     1.46   0.144    -.1131207    .7735797
     Lower secondary  |   .2642577    .189094     1.40   0.162    -.1063596     .634875
      Post secondary  |   .4067366   .1504769     2.70   0.007     .1118072     .701666
Lower level tertiary  |   .5649375   .1292911     4.37   0.000     .3115315    .8183435
Upper level tertiary  |   .6435057   .2188811     2.94   0.003     .2145065    1.072505
                      |
                hswrk |   .0427113   .0311769     1.37   0.171    -.0183943    .1038169
              respmom |  -.0677797   .1716104    -0.39   0.693    -.4041299    .2685704
              famlife |  -.4173445   .0330806   -12.62   0.000    -.4821812   -.3525078
             duration |   .4708376   .1928982     2.44   0.015      .092764    .8489112
                _cons |  -.5258389   .6042744    -0.87   0.384    -1.710195    .6585172
---------------------------------------------------------------------------------------

. margin          i.marst, at(index=(5(2)62)) predict(outcome(1))         /* One Manages  */

Predictive margins                              Number of obs     =      7,118
Model VCE    : Robust

Expression   : Pr(pool==One___Manager), predict(outcome(1))

1._at        : index           =           5

2._at        : index           =           7

3._at        : index           =           9

4._at        : index           =          11

5._at        : index           =          13

6._at        : index           =          15

7._at        : index           =          17

8._at        : index           =          19

9._at        : index           =          21

10._at       : index           =          23

11._at       : index           =          25

12._at       : index           =          27

13._at       : index           =          29

14._at       : index           =          31

15._at       : index           =          33

16._at       : index           =          35

17._at       : index           =          37

18._at       : index           =          39

19._at       : index           =          41

20._at       : index           =          43

21._at       : index           =          45

22._at       : index           =          47

23._at       : index           =          49

24._at       : index           =          51

25._at       : index           =          53

26._at       : index           =          55

27._at       : index           =          57

28._at       : index           =          59

29._at       : index           =          61

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   _at#marst |
  1#Married  |   .1348204   .0183006     7.37   0.000     .0989518    .1706889
    1#Cohab  |   .0965126    .017317     5.57   0.000     .0625718    .1304533
  2#Married  |   .1414596   .0179253     7.89   0.000     .1063266    .1765926
    2#Cohab  |   .1045834   .0171273     6.11   0.000     .0710145    .1381524
  3#Married  |    .148269   .0175753     8.44   0.000     .1138221     .182716
    3#Cohab  |   .1131376   .0171751     6.59   0.000      .079475    .1468001
  4#Married  |   .1552397   .0172836     8.98   0.000     .1213645    .1891149
    4#Cohab  |    .122183   .0175887     6.95   0.000     .0877098    .1566562
  5#Married  |   .1623615   .0170901     9.50   0.000     .1288655    .1958575
    5#Cohab  |   .1317256   .0184909     7.12   0.000     .0954841    .1679671
  6#Married  |   .1696233   .0170404     9.95   0.000     .1362248    .2030218
    6#Cohab  |   .1417693   .0199737     7.10   0.000     .1026216    .1809169
  7#Married  |   .1770132   .0171824    10.30   0.000     .1433363    .2106902
    7#Cohab  |   .1523155   .0220818     6.90   0.000     .1090361     .195595
  8#Married  |   .1845184   .0175623    10.51   0.000     .1500968    .2189399
    8#Cohab  |   .1633636   .0248153     6.58   0.000     .1147265    .2120006
  9#Married  |   .1921252   .0182187    10.55   0.000     .1564171    .2278332
    9#Cohab  |     .17491   .0281442     6.21   0.000     .1197483    .2300717
 10#Married  |   .1998193   .0191782    10.42   0.000     .1622308    .2374079
   10#Cohab  |   .1869491   .0320248     5.84   0.000     .1241816    .2497166
 11#Married  |   .2075861   .0204533    10.15   0.000     .1674984    .2476738
   11#Cohab  |   .1994724   .0364097     5.48   0.000     .1281106    .2708342
 12#Married  |   .2154102   .0220436     9.77   0.000     .1722055    .2586148
   12#Cohab  |   .2124688   .0412533     5.15   0.000     .1316137    .2933238
 13#Married  |   .2232761   .0239391     9.33   0.000     .1763564    .2701957
   13#Cohab  |   .2259247   .0465126     4.86   0.000     .1347617    .3170876
 14#Married  |    .231168   .0261236     8.85   0.000     .1799668    .2823692
   14#Cohab  |    .239824   .0521468     4.60   0.000     .1376181      .34203
 15#Married  |   .2390701   .0285784     8.37   0.000     .1830575    .2950828
   15#Cohab  |   .2541482   .0581169     4.37   0.000     .1402411    .3680553
 16#Married  |   .2469668   .0312846     7.89   0.000     .1856502    .3082834
   16#Cohab  |   .2688761   .0643842     4.18   0.000     .1426854    .3950668
 17#Married  |   .2548425   .0342238     7.45   0.000     .1877651      .32192
   17#Cohab  |   .2839845   .0709098     4.00   0.000     .1450039    .4229652
 18#Married  |    .262682   .0373794     7.03   0.000     .1894197    .3359443
   18#Cohab  |   .2994481   .0776543     3.86   0.000     .1472484    .4516478
 19#Married  |   .2704705   .0407362     6.64   0.000     .1906291    .3503119
   19#Cohab  |   .3152394   .0845774     3.73   0.000     .1494706    .4810082
 20#Married  |   .2781939   .0442803     6.28   0.000      .191406    .3649817
   20#Cohab  |   .3313293   .0916379     3.62   0.000     .1517222    .5109363
 21#Married  |   .2858385   .0479993     5.96   0.000     .1917615    .3799154
   21#Cohab  |   .3476869   .0987936     3.52   0.000      .154055    .5413189
 22#Married  |   .2933915   .0518816     5.66   0.000     .1917053    .3950776
   22#Cohab  |   .3642802   .1060016     3.44   0.001     .1565209    .5720396
 23#Married  |   .3008409   .0559166     5.38   0.000     .1912465    .4104354
   23#Cohab  |   .3810758   .1132185     3.37   0.001     .1591716      .60298
 24#Married  |   .3081756   .0600941     5.13   0.000     .1903935    .4259578
   24#Cohab  |   .3980394   .1204006     3.31   0.001     .1620585    .6340202
 25#Married  |   .3153854   .0644045     4.90   0.000      .189155    .4416159
   25#Cohab  |    .415136   .1275044     3.26   0.001     .1652318    .6650401
 26#Married  |   .3224611   .0688387     4.68   0.000     .1875396    .4573825
   26#Cohab  |   .4323301    .134487     3.21   0.001     .1687405    .6959197
 27#Married  |   .3293943   .0733879     4.49   0.000     .1855566    .4732319
   27#Cohab  |   .4495861    .141306     3.18   0.001     .1726314    .7265407
 28#Married  |   .3361778   .0780434     4.31   0.000     .1832155    .4891401
   28#Cohab  |   .4668682   .1479206     3.16   0.002     .1769492    .7567872
 29#Married  |   .3428053    .082797     4.14   0.000     .1805262    .5050845
   29#Cohab  |   .4841411   .1542914     3.14   0.002     .1817355    .7865467
------------------------------------------------------------------------------

. margin          i.marst, at(index=(5(2)62)) predict(outcome(2))         /* Manage Equal */

Predictive margins                              Number of obs     =      7,118
Model VCE    : Robust

Expression   : Pr(pool==Manage___Together), predict(outcome(2))

1._at        : index           =           5

2._at        : index           =           7

3._at        : index           =           9

4._at        : index           =          11

5._at        : index           =          13

6._at        : index           =          15

7._at        : index           =          17

8._at        : index           =          19

9._at        : index           =          21

10._at       : index           =          23

11._at       : index           =          25

12._at       : index           =          27

13._at       : index           =          29

14._at       : index           =          31

15._at       : index           =          33

16._at       : index           =          35

17._at       : index           =          37

18._at       : index           =          39

19._at       : index           =          41

20._at       : index           =          43

21._at       : index           =          45

22._at       : index           =          47

23._at       : index           =          49

24._at       : index           =          51

25._at       : index           =          53

26._at       : index           =          55

27._at       : index           =          57

28._at       : index           =          59

29._at       : index           =          61

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   _at#marst |
  1#Married  |    .646942    .031924    20.27   0.000      .584372     .709512
    1#Cohab  |   .3280211   .0315069    10.41   0.000     .2662687    .3897735
  2#Married  |   .6319171   .0304144    20.78   0.000      .572306    .6915282
    2#Cohab  |   .3324331   .0276855    12.01   0.000     .2781705    .3866956
  3#Married  |   .6166194   .0289495    21.30   0.000     .5598794    .6733593
    3#Cohab  |   .3363911   .0249244    13.50   0.000     .2875401     .385242
  4#Married  |   .6010739   .0275741    21.80   0.000     .5470295    .6551182
    4#Cohab  |   .3398732   .0235487    14.43   0.000     .2937186    .3860277
  5#Married  |   .5853076   .0263388    22.22   0.000     .5336846    .6369307
    5#Cohab  |   .3428597   .0237149    14.46   0.000     .2963793    .3893401
  6#Married  |   .5693494   .0252973    22.51   0.000     .5197675    .6189313
    6#Cohab  |   .3453335   .0252842    13.66   0.000     .2957775    .3948896
  7#Married  |   .5532296   .0245034    22.58   0.000     .5052038    .6012553
    7#Cohab  |   .3472801   .0279002    12.45   0.000     .2925968    .4019635
  8#Married  |   .5369798   .0240039    22.37   0.000      .489933    .5840266
    8#Cohab  |    .348688   .0311763    11.18   0.000     .2875834    .4097925
  9#Married  |   .5206328   .0238321    21.85   0.000     .4739227     .567343
    9#Cohab  |   .3495483   .0348041    10.04   0.000     .2813335    .4177631
 10#Married  |   .5042224   .0240012    21.01   0.000     .4571809    .5512639
   10#Cohab  |   .3498557   .0385671     9.07   0.000     .2742655    .4254459
 11#Married  |   .4877828   .0245015    19.91   0.000     .4397607    .5358049
   11#Cohab  |   .3496075   .0423199     8.26   0.000      .266662     .432553
 12#Married  |   .4713487   .0253026    18.63   0.000     .4217564     .520941
   12#Cohab  |   .3488046   .0459648     7.59   0.000     .2587152     .438894
 13#Married  |   .4549547   .0263591    17.26   0.000     .4032919    .5066176
   13#Cohab  |   .3474507    .049436     7.03   0.000      .250558    .4443434
 14#Married  |   .4386354   .0276175    15.88   0.000     .3845062    .4927647
   14#Cohab  |   .3455528   .0526886     6.56   0.000      .242285    .4488206
 15#Married  |   .4224247   .0290229    14.55   0.000      .365541    .4793085
   15#Cohab  |   .3431208   .0556931     6.16   0.000     .2339643    .4522773
 16#Married  |   .4063559   .0305231    13.31   0.000     .3465318    .4661801
   16#Cohab  |   .3401675   .0584305     5.82   0.000     .2256458    .4546892
 17#Married  |   .3904611    .032071    12.17   0.000     .3276031    .4533192
   17#Cohab  |   .3367086   .0608904     5.53   0.000     .2173656    .4560516
 18#Married  |   .3747713   .0336257    11.15   0.000     .3088661    .4406765
   18#Cohab  |   .3327623   .0630689     5.28   0.000     .2091495    .4563751
 19#Married  |   .3593158   .0351522    10.22   0.000     .2904187    .4282128
   19#Cohab  |   .3283491   .0649676     5.05   0.000      .201015    .4556833
 20#Married  |   .3441222   .0366213     9.40   0.000     .2723459    .4158986
   20#Cohab  |    .323492   .0665924     4.86   0.000     .1929734    .4540106
 21#Married  |   .3292164   .0380089     8.66   0.000     .2547204    .4037125
   21#Cohab  |   .3182156   .0679529     4.68   0.000     .1850304    .4514009
 22#Married  |   .3146222   .0392957     8.01   0.000      .237604    .3916404
   22#Cohab  |   .3125466   .0690618     4.53   0.000      .177188    .4479053
 23#Married  |   .3003611   .0404664     7.42   0.000     .2210484    .3796738
   23#Cohab  |   .3065129   .0699341     4.38   0.000     .1694445    .4435813
 24#Married  |   .2864524   .0415093     6.90   0.000     .2050956    .3678092
   24#Cohab  |   .3001437   .0705868     4.25   0.000     .1617962    .4384912
 25#Married  |   .2729132    .042416     6.43   0.000     .1897794    .3560471
   25#Cohab  |   .2934692   .0710378     4.13   0.000     .1542376    .4327008
 26#Married  |   .2597582   .0431809     6.02   0.000     .1751252    .3443911
   26#Cohab  |   .2865203   .0713063     4.02   0.000     .1467625    .4262781
 27#Married  |   .2469996   .0438008     5.64   0.000     .1611516    .3328476
   27#Cohab  |   .2793282   .0714115     3.91   0.000     .1393644    .4192921
 28#Married  |   .2346476    .044275     5.30   0.000     .1478702    .3214249
   28#Cohab  |   .2719246   .0713723     3.81   0.000     .1320374    .4118117
 29#Married  |   .2227097   .0446045     4.99   0.000     .1352865    .3101329
   29#Cohab  |   .2643407   .0712074     3.71   0.000     .1247769    .4039046
------------------------------------------------------------------------------

. margin          i.marst, at(index=(5(2)62)) predict(outcome(3))         /* Pool Some    */

Predictive margins                              Number of obs     =      7,118
Model VCE    : Robust

Expression   : Pr(pool==Keep_Some___Separate), predict(outcome(3))

1._at        : index           =           5

2._at        : index           =           7

3._at        : index           =           9

4._at        : index           =          11

5._at        : index           =          13

6._at        : index           =          15

7._at        : index           =          17

8._at        : index           =          19

9._at        : index           =          21

10._at       : index           =          23

11._at       : index           =          25

12._at       : index           =          27

13._at       : index           =          29

14._at       : index           =          31

15._at       : index           =          33

16._at       : index           =          35

17._at       : index           =          37

18._at       : index           =          39

19._at       : index           =          41

20._at       : index           =          43

21._at       : index           =          45

22._at       : index           =          47

23._at       : index           =          49

24._at       : index           =          51

25._at       : index           =          53

26._at       : index           =          55

27._at       : index           =          57

28._at       : index           =          59

29._at       : index           =          61

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   _at#marst |
  1#Married  |   .1496088    .021416     6.99   0.000     .1076343    .1915834
    1#Cohab  |   .3691817   .0330724    11.16   0.000     .3043611    .4340024
  2#Married  |   .1544116    .020249     7.63   0.000     .1147244    .1940989
    2#Cohab  |   .3528826   .0295443    11.94   0.000     .2949769    .4107883
  3#Married  |   .1592075   .0191769     8.30   0.000     .1216214    .1967935
    3#Cohab  |      .3368   .0265381    12.69   0.000     .2847862    .3888138
  4#Married  |   .1639837   .0182593     8.98   0.000     .1281962    .1997712
    4#Cohab  |   .3209656   .0241931    13.27   0.000      .273548    .3683832
  5#Married  |   .1687273   .0175649     9.61   0.000     .1343008    .2031539
    5#Cohab  |   .3054098    .022634    13.49   0.000      .261048    .3497716
  6#Married  |   .1734251   .0171661    10.10   0.000     .1397801    .2070701
    6#Cohab  |   .2901614   .0219268    13.23   0.000     .2471856    .3331372
  7#Married  |   .1780637   .0171277    10.40   0.000     .1444941    .2116334
    7#Cohab  |   .2752473   .0220384    12.49   0.000     .2320529    .3184417
  8#Married  |   .1826299   .0174933    10.44   0.000     .1483436    .2169162
    8#Cohab  |   .2606927   .0228361    11.42   0.000     .2159348    .3054506
  9#Married  |   .1871103   .0182762    10.24   0.000     .1512897    .2229309
    9#Cohab  |   .2465204   .0241332    10.22   0.000     .1992203    .2938206
 10#Married  |    .191492   .0194583     9.84   0.000     .1533544    .2296297
   10#Cohab  |   .2327511   .0257416     9.04   0.000     .1822985    .2832038
 11#Married  |   .1957624   .0209999     9.32   0.000     .1546034    .2369214
   11#Cohab  |   .2194032   .0275033     7.98   0.000     .1654976    .2733088
 12#Married  |   .1999091   .0228505     8.75   0.000      .155123    .2446952
   12#Cohab  |   .2064925   .0292979     7.05   0.000     .1490696    .2639153
 13#Married  |   .2039205   .0249592     8.17   0.000     .1550013    .2528397
   13#Cohab  |   .1940323   .0310384     6.25   0.000     .1331983    .2548664
 14#Married  |   .2077855     .02728     7.62   0.000     .1543176    .2612533
   14#Cohab  |   .1820337   .0326639     5.57   0.000     .1180136    .2460538
 15#Married  |   .2114936   .0297734     7.10   0.000     .1531389    .2698483
   15#Cohab  |    .170505   .0341332     5.00   0.000     .1036051    .2374049
 16#Married  |   .2150354   .0324065     6.64   0.000     .1515199    .2785509
   16#Cohab  |   .1594521    .035419     4.50   0.000     .0900322     .228872
 17#Married  |   .2184021   .0351524     6.21   0.000     .1495047    .2872995
   17#Cohab  |   .1488786   .0365045     4.08   0.000     .0773311    .2204261
 18#Married  |    .221586   .0379889     5.83   0.000     .1471291    .2960429
   18#Cohab  |   .1387857   .0373809     3.71   0.000     .0655204    .2120509
 19#Married  |   .2245803   .0408977     5.49   0.000     .1444223    .3047382
   19#Cohab  |   .1291722   .0380453     3.40   0.001     .0546047    .2037397
 20#Married  |   .2273791   .0438633     5.18   0.000     .1414085    .3133497
   20#Cohab  |   .1200351   .0384995     3.12   0.002     .0445775    .1954928
 21#Married  |   .2299778   .0468729     4.91   0.000     .1381086     .321847
   21#Cohab  |   .1113693   .0387488     2.87   0.004     .0354231    .1873155
 22#Married  |   .2323726   .0499153     4.66   0.000     .1345405    .3302047
   22#Cohab  |   .1031677   .0388012     2.66   0.008     .0271187    .1792167
 23#Married  |   .2345609   .0529808     4.43   0.000     .1307203    .3384014
   23#Cohab  |   .0954217   .0386672     2.47   0.014     .0196353    .1712081
 24#Married  |    .236541   .0560613     4.22   0.000     .1266629    .3464191
   24#Cohab  |   .0881211   .0383587     2.30   0.022     .0129396    .1633027
 25#Married  |   .2383123   .0591492     4.03   0.000      .122382    .3542425
   25#Cohab  |   .0812545   .0378887     2.14   0.032     .0069941     .155515
 26#Married  |    .239875   .0622381     3.85   0.000     .1178907    .3618594
   26#Cohab  |   .0748091   .0372713     2.01   0.045     .0017587    .1478595
 27#Married  |   .2412306    .065322     3.69   0.000     .1132017    .3692594
   27#Cohab  |   .0687713    .036521     1.88   0.060    -.0028086    .1403511
 28#Married  |   .2423809   .0683958     3.54   0.000     .1083275    .3764343
   28#Cohab  |   .0631264   .0356525     1.77   0.077    -.0067513     .133004
 29#Married  |    .243329   .0714547     3.41   0.001     .1032804    .3833777
   29#Cohab  |   .0578592   .0346806     1.67   0.095    -.0101136     .125832
------------------------------------------------------------------------------

. margin          i.marst, at(index=(5(2)62)) predict(outcome(4))         /* Keep Sep             */

Predictive margins                              Number of obs     =      7,118
Model VCE    : Robust

Expression   : Pr(pool==Keep_All___Separate), predict(outcome(4))

1._at        : index           =           5

2._at        : index           =           7

3._at        : index           =           9

4._at        : index           =          11

5._at        : index           =          13

6._at        : index           =          15

7._at        : index           =          17

8._at        : index           =          19

9._at        : index           =          21

10._at       : index           =          23

11._at       : index           =          25

12._at       : index           =          27

13._at       : index           =          29

14._at       : index           =          31

15._at       : index           =          33

16._at       : index           =          35

17._at       : index           =          37

18._at       : index           =          39

19._at       : index           =          41

20._at       : index           =          43

21._at       : index           =          45

22._at       : index           =          47

23._at       : index           =          49

24._at       : index           =          51

25._at       : index           =          53

26._at       : index           =          55

27._at       : index           =          57

28._at       : index           =          59

29._at       : index           =          61

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   _at#marst |
  1#Married  |   .0686288   .0150355     4.56   0.000     .0391598    .0980978
    1#Cohab  |   .2062846   .0301311     6.85   0.000     .1472287    .2653404
  2#Married  |   .0722117   .0148912     4.85   0.000     .0430255    .1013979
    2#Cohab  |   .2101009   .0276492     7.60   0.000     .1559094    .2642924
  3#Married  |   .0759041   .0147232     5.16   0.000     .0470472    .1047611
    3#Cohab  |   .2136714   .0256923     8.32   0.000     .1633155    .2640273
  4#Married  |   .0797027    .014538     5.48   0.000     .0512089    .1081966
    4#Cohab  |   .2169783   .0245655     8.83   0.000     .1688308    .2651258
  5#Married  |   .0836036   .0143437     5.83   0.000     .0554904    .1117167
    5#Cohab  |   .2200049   .0245662     8.96   0.000     .1718561    .2681537
  6#Married  |   .0876021   .0141507     6.19   0.000     .0598673    .1153369
    6#Cohab  |   .2227358   .0258667     8.61   0.000      .172038    .2734337
  7#Married  |   .0916934   .0139712     6.56   0.000     .0643103    .1190766
    7#Cohab  |    .225157   .0284418     7.92   0.000     .1694121    .2809019
  8#Married  |    .095872   .0138199     6.94   0.000     .0687855    .1229584
    8#Cohab  |   .2272558   .0321146     7.08   0.000     .1643122    .2901993
  9#Married  |   .1001317   .0137131     7.30   0.000     .0732545    .1270089
    9#Cohab  |   .2290212    .036661     6.25   0.000      .157167    .3008754
 10#Married  |   .1044662   .0136689     7.64   0.000     .0776757    .1312567
   10#Cohab  |   .2304441    .041879     5.50   0.000     .1483627    .3125254
 11#Married  |   .1088687    .013706     7.94   0.000     .0820055     .135732
   11#Cohab  |   .2315169   .0476095     4.86   0.000      .138204    .3248298
 12#Married  |    .113332   .0138429     8.19   0.000     .0862004    .1404637
   12#Cohab  |   .2322342   .0537315     4.32   0.000     .1269224     .337546
 13#Married  |   .1178487   .0140966     8.36   0.000       .09022    .1454775
   13#Cohab  |   .2325923    .060152     3.87   0.000     .1146964    .3504881
 14#Married  |   .1224112   .0144808     8.45   0.000     .0940293     .150793
   14#Cohab  |   .2325895   .0667969     3.48   0.000     .1016699     .363509
 15#Married  |   .1270115   .0150057     8.46   0.000     .0976009    .1564221
   15#Cohab  |    .232226   .0736044     3.16   0.002     .0879641     .376488
 16#Married  |   .1316418   .0156769     8.40   0.000     .1009158    .1623679
   16#Cohab  |   .2315043   .0805209     2.88   0.004     .0736862    .3893223
 17#Married  |   .1362942   .0164956     8.26   0.000     .1039633    .1686251
   17#Cohab  |   .2304282   .0874983     2.63   0.008     .0589348    .4019217
 18#Married  |   .1409607   .0174598     8.07   0.000     .1067401    .1751813
   18#Cohab  |    .229004   .0944921     2.42   0.015     .0438029    .4142051
 19#Married  |   .1456335   .0185643     7.84   0.000      .109248    .1820189
   19#Cohab  |   .2272392   .1014607     2.24   0.025     .0283799    .4260986
 20#Married  |   .1503048   .0198025     7.59   0.000     .1114925    .1891171
   20#Cohab  |   .2251436   .1083646     2.08   0.038     .0127528    .4375344
 21#Married  |   .1549673   .0211668     7.32   0.000     .1134811    .1964536
   21#Cohab  |   .2227281    .115166     1.93   0.053    -.0029931    .4484494
 22#Married  |   .1596137   .0226494     7.05   0.000     .1152217    .2040057
   22#Cohab  |   .2200055   .1218288     1.81   0.071    -.0187746    .4587856
 23#Married  |   .1642371   .0242427     6.77   0.000     .1167223    .2117519
   23#Cohab  |   .2169896   .1283185     1.69   0.091      -.03451    .4684893
 24#Married  |   .1688309   .0259396     6.51   0.000     .1179903    .2196716
   24#Cohab  |   .2136958   .1346023     1.59   0.112    -.0501199    .4775115
 25#Married  |   .1733891   .0277337     6.25   0.000     .1190321     .227746
   25#Cohab  |   .2101403   .1406492     1.49   0.135    -.0655271    .4858078
 26#Married  |   .1779057   .0296192     6.01   0.000     .1198532    .2359582
   26#Cohab  |   .2063405   .1464301     1.41   0.159    -.0806573    .4933383
 27#Married  |   .1823755   .0315909     5.77   0.000     .1204584    .2442926
   27#Cohab  |   .2023144   .1519179     1.33   0.183    -.0954392     .500068
 28#Married  |   .1867937   .0336446     5.55   0.000     .1208516    .2527359
   28#Cohab  |   .1980808   .1570876     1.26   0.207    -.1098052    .5059669
 29#Married  |   .1911559   .0357761     5.34   0.000      .121036    .2612757
   29#Cohab  |    .193659   .1619167     1.20   0.232    -.1236919    .5110098
------------------------------------------------------------------------------

. 
. 
. **********************************************************************************************************************
. * Figure data
. **********************************************************************************************************************
. // Figure 2
. global  ivars " sex age parent i.employ homemaker ib4.degree hswrk respmom famlife duration"

. 
. mlogit  pool    c.index##i.relinc       i.marst         $ivars                                          , cluster(country)

Iteration 0:   log pseudolikelihood = -8556.7479  
Iteration 1:   log pseudolikelihood = -7771.1515  
Iteration 2:   log pseudolikelihood = -7731.6563  
Iteration 3:   log pseudolikelihood = -7731.3233  
Iteration 4:   log pseudolikelihood = -7731.3232  

Multinomial logistic regression                 Number of obs     =      7,118
                                                Wald chi2(14)     =          .
                                                Prob > chi2       =          .
Log pseudolikelihood = -7731.3232               Pseudo R2         =     0.0965

                                        (Std. Err. adjusted for 18 clusters in country)
---------------------------------------------------------------------------------------
                      |               Robust
                 pool |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
One___Manager         |
                index |   .0425389   .0092928     4.58   0.000     .0243254    .0607524
                      |
               relinc |
Woman primary-earner  |   .1307698   .1965641     0.67   0.506    -.2544888    .5160284
       Equal-earners  |   .0462361   .2967456     0.16   0.876    -.5353746    .6278468
                      |
       relinc#c.index |
Woman primary-earner  |  -.0099546   .0122958    -0.81   0.418     -.034054    .0141448
       Equal-earners  |  -.0255502   .0103089    -2.48   0.013    -.0457553   -.0053451
                      |
                marst |
               Cohab  |   .5033204   .1546229     3.26   0.001      .200265    .8063758
                  sex |  -.0081917   .1862973    -0.04   0.965    -.3733276    .3569442
                  age |  -.0148968   .0053442    -2.79   0.005    -.0253712   -.0044225
               parent |    -.12856   .1374301    -0.94   0.350    -.3979181     .140798
                      |
               employ |
            Parttime  |   .1080902   .1161317     0.93   0.352    -.1195238    .3357042
          Unemployed  |   .3327798   .2842165     1.17   0.242    -.2242743     .889834
             Student  |   .4692673   .1527448     3.07   0.002     .1698929    .7686417
  Not in labor force  |  -.3257106   .1386607    -2.35   0.019    -.5974805   -.0539406
                      |
            homemaker |   .1716677    .103953     1.65   0.099    -.0320764    .3754119
                      |
               degree |
 No formal education  |   .5375384   .3266697     1.65   0.100    -.1027223    1.177799
      Primary school  |   .4951412   .1869717     2.65   0.008     .1286834    .8615989
     Lower secondary  |   -.000177   .2068308    -0.00   0.999     -.405558     .405204
      Post secondary  |  -.0230096   .2093702    -0.11   0.912    -.4333675    .3873484
Lower level tertiary  |  -.5348015   .2228857    -2.40   0.016    -.9716495   -.0979535
Upper level tertiary  |  -.5659521   .1994659    -2.84   0.005    -.9568981   -.1750061
                      |
                hswrk |  -.1118665    .034585    -3.23   0.001    -.1796518   -.0440812
              respmom |   .0233861   .0964368     0.24   0.808    -.1656266    .2123988
              famlife |  -.2272734   .0877348    -2.59   0.010    -.3992303   -.0553164
             duration |   .3192584   .1539126     2.07   0.038     .0175952    .6209216
                _cons |   .1420374   .8123204     0.17   0.861    -1.450081    1.734156
----------------------+----------------------------------------------------------------
Manage___Together     |  (base outcome)
----------------------+----------------------------------------------------------------
Keep_Some___Separate  |
                index |   .0235853   .0132722     1.78   0.076    -.0024276    .0495983
                      |
               relinc |
Woman primary-earner  |   .1823376   .1550431     1.18   0.240    -.1215412    .4862165
       Equal-earners  |   .3204851   .2551228     1.26   0.209    -.1795465    .8205166
                      |
       relinc#c.index |
Woman primary-earner  |  -.0050941   .0086147    -0.59   0.554    -.0219786    .0117903
       Equal-earners  |  -.0264558   .0171663    -1.54   0.123    -.0601011    .0071895
                      |
                marst |
               Cohab  |   1.129425   .1883364     6.00   0.000     .7602927    1.498558
                  sex |   .0986058   .1048385     0.94   0.347    -.1068739    .3040856
                  age |  -.0151991   .0045202    -3.36   0.001    -.0240585   -.0063398
               parent |  -.0887644   .0810691    -1.09   0.274     -.247657    .0701281
                      |
               employ |
            Parttime  |  -.4487754   .1667744    -2.69   0.007    -.7756471   -.1219036
          Unemployed  |  -.2533751   .2315728    -1.09   0.274    -.7072495    .2004994
             Student  |  -.4258828   .1353878    -3.15   0.002    -.6912379   -.1605276
  Not in labor force  |  -.2119749    .135183    -1.57   0.117    -.4769287     .052979
                      |
            homemaker |  -.2584673   .1053884    -2.45   0.014    -.4650247   -.0519098
                      |
               degree |
 No formal education  |   .4493087   .4301937     1.04   0.296    -.3938554    1.292473
      Primary school  |  -.2251559    .186964    -1.20   0.228    -.5915987    .1412868
     Lower secondary  |  -.0897562    .144151    -0.62   0.534     -.372287    .1927746
      Post secondary  |  -.0206339   .1565509    -0.13   0.895    -.3274681    .2862002
Lower level tertiary  |   .4377059   .1109907     3.94   0.000     .2201681    .6552437
Upper level tertiary  |   .7156172   .1195061     5.99   0.000     .4813896    .9498449
                      |
                hswrk |   -.021533   .0210964    -1.02   0.307    -.0628811    .0198151
              respmom |   .2697247    .131259     2.05   0.040     .0124617    .5269876
              famlife |  -.2354303    .042659    -5.52   0.000    -.3190404   -.1518202
             duration |   .3310009   .2315823     1.43   0.153    -.1228921    .7848938
                _cons |  -.0437431   .4986333    -0.09   0.930    -1.021046    .9335603
----------------------+----------------------------------------------------------------
Keep_All___Separate   |
                index |   .0360246   .0120834     2.98   0.003     .0123415    .0597077
                      |
               relinc |
Woman primary-earner  |   .3706799   .2165295     1.71   0.087    -.0537102    .7950699
       Equal-earners  |   .0795205   .1803161     0.44   0.659    -.2738927    .4329336
                      |
       relinc#c.index |
Woman primary-earner  |  -.0136585   .0077983    -1.75   0.080    -.0289428    .0016258
       Equal-earners  |  -.0115329   .0093962    -1.23   0.220     -.029949    .0068832
                      |
                marst |
               Cohab  |   1.446329   .2146488     6.74   0.000     1.025625    1.867033
                  sex |   .1256566   .1023394     1.23   0.220     -.074925    .3262383
                  age |  -.0059045   .0080494    -0.73   0.463    -.0216811    .0098721
               parent |  -.0487679   .1368712    -0.36   0.722    -.3170305    .2194948
                      |
               employ |
            Parttime  |  -.5930896   .1867965    -3.18   0.001     -.959204   -.2269752
          Unemployed  |   .3210386   .3411697     0.94   0.347    -.3476417     .989719
             Student  |  -.2133456   .2618893    -0.81   0.415    -.7266391    .2999479
  Not in labor force  |   .2134956   .1184904     1.80   0.072    -.0187413    .4457325
                      |
            homemaker |  -.2821624   .1260552    -2.24   0.025    -.5292259   -.0350988
                      |
               degree |
 No formal education  |   .5204262   .3328275     1.56   0.118    -.1319038    1.172756
      Primary school  |   .2619472   .2460856     1.06   0.287    -.2203717    .7442661
     Lower secondary  |   .2737873   .1857651     1.47   0.141    -.0903056    .6378802
      Post secondary  |   .4058733   .1499592     2.71   0.007     .1119586    .6997881
Lower level tertiary  |   .5486077   .1284681     4.27   0.000     .2968149    .8004005
Upper level tertiary  |   .6159428   .2107497     2.92   0.003      .202881    1.029005
                      |
                hswrk |   .0459162    .029496     1.56   0.120    -.0118949    .1037272
              respmom |  -.0627912   .1728305    -0.36   0.716    -.4015328    .2759505
              famlife |  -.4254519    .034301   -12.40   0.000    -.4926807   -.3582232
             duration |   .5335283   .1667615     3.20   0.001     .2066818    .8603748
                _cons |  -.4755326   .5974661    -0.80   0.426    -1.646545    .6954795
---------------------------------------------------------------------------------------

. margin          relinc, at(index=(5(2)62)) predict(outcome(1)) post             /* One Manages  */

Predictive margins                              Number of obs     =      7,118
Model VCE    : Robust

Expression   : Pr(pool==One___Manager), predict(outcome(1))

1._at        : index           =           5

2._at        : index           =           7

3._at        : index           =           9

4._at        : index           =          11

5._at        : index           =          13

6._at        : index           =          15

7._at        : index           =          17

8._at        : index           =          19

9._at        : index           =          21

10._at       : index           =          23

11._at       : index           =          25

12._at       : index           =          27

13._at       : index           =          29

14._at       : index           =          31

15._at       : index           =          33

16._at       : index           =          35

17._at       : index           =          37

18._at       : index           =          39

19._at       : index           =          41

20._at       : index           =          43

21._at       : index           =          45

22._at       : index           =          47

23._at       : index           =          49

24._at       : index           =          51

25._at       : index           =          53

26._at       : index           =          55

27._at       : index           =          57

28._at       : index           =          59

29._at       : index           =          61

------------------------------------------------------------------------------------------
                         |            Delta-method
                         |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------------------+----------------------------------------------------------------
              _at#relinc |
   1#Man primary-earner  |    .130128    .019034     6.84   0.000      .092822    .1674339
 1#Woman primary-earner  |   .1320105   .0130949    10.08   0.000     .1063449    .1576761
        1#Equal-earners  |   .1175383   .0307575     3.82   0.000     .0572548    .1778218
   2#Man primary-earner  |   .1377389    .018483     7.45   0.000     .1015128     .173965
 2#Woman primary-earner  |   .1378102   .0130653    10.55   0.000     .1122026    .1634178
        2#Equal-earners  |   .1205928   .0299401     4.03   0.000     .0619113    .1792744
   3#Man primary-earner  |   .1456346    .018038     8.07   0.000     .1102808    .1809884
 3#Woman primary-earner  |   .1437769   .0131179    10.96   0.000     .1180662    .1694875
        3#Equal-earners  |   .1236905   .0290825     4.25   0.000     .0666898    .1806911
   4#Man primary-earner  |   .1538101   .0177926     8.64   0.000     .1189372    .1886831
 4#Woman primary-earner  |   .1499091   .0132663    11.30   0.000     .1239076    .1759105
        4#Equal-earners  |   .1268297   .0281892     4.50   0.000     .0715799    .1820794
   5#Man primary-earner  |   .1622591    .017857     9.09   0.000     .1272601    .1972582
 5#Woman primary-earner  |   .1562049   .0135222    11.55   0.000     .1297019    .1827079
        5#Equal-earners  |   .1300089   .0272663     4.77   0.000      .076568    .1834498
   6#Man primary-earner  |   .1709738   .0183432     9.32   0.000     .1350217    .2069258
 6#Woman primary-earner  |   .1626621   .0138943    11.71   0.000     .1354297    .1898944
        6#Equal-earners  |   .1332264   .0263217     5.06   0.000     .0816368    .1848159
   7#Man primary-earner  |   .1799446   .0193446     9.30   0.000     .1420299    .2178593
 7#Woman primary-earner  |   .1692778   .0143879    11.77   0.000      .141078    .1974775
        7#Equal-earners  |   .1364803   .0253657     5.38   0.000     .0867643    .1861962
   8#Man primary-earner  |   .1891607    .020917     9.04   0.000     .1481641    .2301573
 8#Woman primary-earner  |   .1760487   .0150046    11.73   0.000     .1466403    .2054571
        8#Equal-earners  |   .1397686   .0244116     5.73   0.000     .0919228    .1876145
   9#Man primary-earner  |   .1986096   .0230742     8.61   0.000      .153385    .2438342
 9#Woman primary-earner  |   .1829712   .0157428    11.62   0.000     .1521159    .2138266
        9#Equal-earners  |   .1430894    .023476     6.10   0.000     .0970773    .1891015
  10#Man primary-earner  |   .2082776   .0257967     8.07   0.000      .157717    .2588381
10#Woman primary-earner  |   .1900412   .0165985    11.45   0.000     .1575088    .2225736
       10#Equal-earners  |   .1464402     .02258     6.49   0.000     .1021841    .1906963
  11#Man primary-earner  |   .2181494    .029047     7.51   0.000     .1612184    .2750805
11#Woman primary-earner  |    .197254   .0175655    11.23   0.000     .1628262    .2316817
       11#Equal-earners  |   .1498188   .0217498     6.89   0.000       .10719    .1924477
  12#Man primary-earner  |    .228209   .0327823     6.96   0.000     .1639568    .2924611
12#Woman primary-earner  |   .2046046   .0186369    10.98   0.000     .1680769    .2411322
       12#Equal-earners  |   .1532228   .0210167     7.29   0.000     .1120308    .1944147
  13#Man primary-earner  |   .2384387   .0369613     6.45   0.000     .1659959    .3108815
13#Woman primary-earner  |   .2120876    .019805    10.71   0.000     .1732705    .2509047
       13#Equal-earners  |   .1566494   .0204175     7.67   0.000     .1166318    .1966669
  14#Man primary-earner  |   .2488203    .041547     5.99   0.000     .1673896     .330251
14#Woman primary-earner  |   .2196973   .0210623    10.43   0.000     .1784159    .2609787
       14#Equal-earners  |   .1600959   .0199931     8.01   0.000     .1209102    .1992816
  15#Man primary-earner  |   .2593347   .0465072     5.58   0.000     .1681823    .3504871
15#Woman primary-earner  |   .2274276   .0224017    10.15   0.000     .1835211     .271334
       15#Equal-earners  |   .1635596   .0197859     8.27   0.000     .1247799    .2023393
  16#Man primary-earner  |   .2699622   .0518131     5.21   0.000     .1684103     .371514
16#Woman primary-earner  |   .2352719   .0238163     9.88   0.000     .1885927     .281951
       16#Equal-earners  |   .1670375   .0198361     8.42   0.000     .1281594    .2059155
  17#Man primary-earner  |   .2806825   .0574392     4.89   0.000     .1681038    .3932612
17#Woman primary-earner  |   .2432234   .0253003     9.61   0.000     .1936357    .2928112
       17#Equal-earners  |   .1705265   .0201765     8.45   0.000     .1309812    .2100717
  18#Man primary-earner  |   .2914753   .0633616     4.60   0.000     .1672888    .4156618
18#Woman primary-earner  |   .2512753   .0268484     9.36   0.000     .1986535    .3038971
       18#Equal-earners  |   .1740235   .0208288     8.35   0.000     .1331998    .2148472
  19#Man primary-earner  |     .30232    .069558     4.35   0.000     .1659888    .4386513
19#Woman primary-earner  |   .2594201   .0284558     9.12   0.000     .2036478    .3151924
       19#Equal-earners  |   .1775251   .0218012     8.14   0.000     .1347955    .2202548
  20#Man primary-earner  |   .3131964   .0760068     4.12   0.000     .1642257     .462167
20#Woman primary-earner  |   .2676504   .0301187     8.89   0.000     .2086189    .3266819
       20#Equal-earners  |   .1810282   .0230897     7.84   0.000     .1357733    .2262831
  21#Man primary-earner  |   .3240841   .0826869     3.92   0.000     .1620207    .4861475
21#Woman primary-earner  |   .2759586   .0318337     8.67   0.000     .2135658    .3383515
       21#Equal-earners  |   .1845292   .0246804     7.48   0.000     .1361565    .2329019
  22#Man primary-earner  |   .3349636   .0895775     3.74   0.000     .1593948    .5105324
22#Woman primary-earner  |    .284337   .0335981     8.46   0.000     .2184858    .3501881
       22#Equal-earners  |   .1880247   .0265542     7.08   0.000     .1359794    .2400699
  23#Man primary-earner  |   .3458157    .096658     3.58   0.000     .1563694     .535262
23#Woman primary-earner  |   .2927776   .0354098     8.27   0.000     .2233757    .3621795
       23#Equal-earners  |    .191511   .0286896     6.68   0.000     .1352803    .2477417
  24#Man primary-earner  |   .3566222    .103908     3.43   0.001     .1529662    .5602781
24#Woman primary-earner  |   .3012725   .0372669     8.08   0.000     .2282307    .3743143
       24#Equal-earners  |   .1949846   .0310659     6.28   0.000     .1340965    .2558726
  25#Man primary-earner  |   .3673654   .1113072     3.30   0.001     .1492073    .5855235
25#Woman primary-earner  |   .3098139   .0391682     7.91   0.000     .2330456    .3865822
       25#Equal-earners  |   .1984417   .0336639     5.89   0.000     .1324617    .2644218
  26#Man primary-earner  |   .3780289   .1188356     3.18   0.001     .1451155    .6109424
26#Woman primary-earner  |   .3183938   .0411127     7.74   0.000     .2378144    .3989731
       26#Equal-earners  |   .2018787    .036467     5.54   0.000     .1304046    .2733528
  27#Man primary-earner  |   .3885973   .1264735     3.07   0.002     .1407138    .6364808
27#Woman primary-earner  |   .3270043   .0430996     7.59   0.000     .2425307     .411478
       27#Equal-earners  |   .2052918   .0394612     5.20   0.000     .1279492    .2826344
  28#Man primary-earner  |   .3990562   .1342017     2.97   0.003     .1360258    .6620867
28#Woman primary-earner  |   .3356378   .0451285     7.44   0.000     .2471876     .424088
       28#Equal-earners  |   .2086773   .0426348     4.89   0.000     .1251146    .2922399
  29#Man primary-earner  |   .4093925   .1420013     2.88   0.004     .1310751    .6877099
29#Woman primary-earner  |   .3442865    .047199     7.29   0.000     .2517783    .4367948
       29#Equal-earners  |   .2120313    .045978     4.61   0.000      .121916    .3021466
------------------------------------------------------------------------------------------

. est store       oneman

. 
. mlogit          pool    c.index##i.relinc       i.marst         $ivars                                  , cluster(country)

Iteration 0:   log pseudolikelihood = -8556.7479  
Iteration 1:   log pseudolikelihood = -7771.1515  
Iteration 2:   log pseudolikelihood = -7731.6563  
Iteration 3:   log pseudolikelihood = -7731.3233  
Iteration 4:   log pseudolikelihood = -7731.3232  

Multinomial logistic regression                 Number of obs     =      7,118
                                                Wald chi2(14)     =          .
                                                Prob > chi2       =          .
Log pseudolikelihood = -7731.3232               Pseudo R2         =     0.0965

                                        (Std. Err. adjusted for 18 clusters in country)
---------------------------------------------------------------------------------------
                      |               Robust
                 pool |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
One___Manager         |
                index |   .0425389   .0092928     4.58   0.000     .0243254    .0607524
                      |
               relinc |
Woman primary-earner  |   .1307698   .1965641     0.67   0.506    -.2544888    .5160284
       Equal-earners  |   .0462361   .2967456     0.16   0.876    -.5353746    .6278468
                      |
       relinc#c.index |
Woman primary-earner  |  -.0099546   .0122958    -0.81   0.418     -.034054    .0141448
       Equal-earners  |  -.0255502   .0103089    -2.48   0.013    -.0457553   -.0053451
                      |
                marst |
               Cohab  |   .5033204   .1546229     3.26   0.001      .200265    .8063758
                  sex |  -.0081917   .1862973    -0.04   0.965    -.3733276    .3569442
                  age |  -.0148968   .0053442    -2.79   0.005    -.0253712   -.0044225
               parent |    -.12856   .1374301    -0.94   0.350    -.3979181     .140798
                      |
               employ |
            Parttime  |   .1080902   .1161317     0.93   0.352    -.1195238    .3357042
          Unemployed  |   .3327798   .2842165     1.17   0.242    -.2242743     .889834
             Student  |   .4692673   .1527448     3.07   0.002     .1698929    .7686417
  Not in labor force  |  -.3257106   .1386607    -2.35   0.019    -.5974805   -.0539406
                      |
            homemaker |   .1716677    .103953     1.65   0.099    -.0320764    .3754119
                      |
               degree |
 No formal education  |   .5375384   .3266697     1.65   0.100    -.1027223    1.177799
      Primary school  |   .4951412   .1869717     2.65   0.008     .1286834    .8615989
     Lower secondary  |   -.000177   .2068308    -0.00   0.999     -.405558     .405204
      Post secondary  |  -.0230096   .2093702    -0.11   0.912    -.4333675    .3873484
Lower level tertiary  |  -.5348015   .2228857    -2.40   0.016    -.9716495   -.0979535
Upper level tertiary  |  -.5659521   .1994659    -2.84   0.005    -.9568981   -.1750061
                      |
                hswrk |  -.1118665    .034585    -3.23   0.001    -.1796518   -.0440812
              respmom |   .0233861   .0964368     0.24   0.808    -.1656266    .2123988
              famlife |  -.2272734   .0877348    -2.59   0.010    -.3992303   -.0553164
             duration |   .3192584   .1539126     2.07   0.038     .0175952    .6209216
                _cons |   .1420374   .8123204     0.17   0.861    -1.450081    1.734156
----------------------+----------------------------------------------------------------
Manage___Together     |  (base outcome)
----------------------+----------------------------------------------------------------
Keep_Some___Separate  |
                index |   .0235853   .0132722     1.78   0.076    -.0024276    .0495983
                      |
               relinc |
Woman primary-earner  |   .1823376   .1550431     1.18   0.240    -.1215412    .4862165
       Equal-earners  |   .3204851   .2551228     1.26   0.209    -.1795465    .8205166
                      |
       relinc#c.index |
Woman primary-earner  |  -.0050941   .0086147    -0.59   0.554    -.0219786    .0117903
       Equal-earners  |  -.0264558   .0171663    -1.54   0.123    -.0601011    .0071895
                      |
                marst |
               Cohab  |   1.129425   .1883364     6.00   0.000     .7602927    1.498558
                  sex |   .0986058   .1048385     0.94   0.347    -.1068739    .3040856
                  age |  -.0151991   .0045202    -3.36   0.001    -.0240585   -.0063398
               parent |  -.0887644   .0810691    -1.09   0.274     -.247657    .0701281
                      |
               employ |
            Parttime  |  -.4487754   .1667744    -2.69   0.007    -.7756471   -.1219036
          Unemployed  |  -.2533751   .2315728    -1.09   0.274    -.7072495    .2004994
             Student  |  -.4258828   .1353878    -3.15   0.002    -.6912379   -.1605276
  Not in labor force  |  -.2119749    .135183    -1.57   0.117    -.4769287     .052979
                      |
            homemaker |  -.2584673   .1053884    -2.45   0.014    -.4650247   -.0519098
                      |
               degree |
 No formal education  |   .4493087   .4301937     1.04   0.296    -.3938554    1.292473
      Primary school  |  -.2251559    .186964    -1.20   0.228    -.5915987    .1412868
     Lower secondary  |  -.0897562    .144151    -0.62   0.534     -.372287    .1927746
      Post secondary  |  -.0206339   .1565509    -0.13   0.895    -.3274681    .2862002
Lower level tertiary  |   .4377059   .1109907     3.94   0.000     .2201681    .6552437
Upper level tertiary  |   .7156172   .1195061     5.99   0.000     .4813896    .9498449
                      |
                hswrk |   -.021533   .0210964    -1.02   0.307    -.0628811    .0198151
              respmom |   .2697247    .131259     2.05   0.040     .0124617    .5269876
              famlife |  -.2354303    .042659    -5.52   0.000    -.3190404   -.1518202
             duration |   .3310009   .2315823     1.43   0.153    -.1228921    .7848938
                _cons |  -.0437431   .4986333    -0.09   0.930    -1.021046    .9335603
----------------------+----------------------------------------------------------------
Keep_All___Separate   |
                index |   .0360246   .0120834     2.98   0.003     .0123415    .0597077
                      |
               relinc |
Woman primary-earner  |   .3706799   .2165295     1.71   0.087    -.0537102    .7950699
       Equal-earners  |   .0795205   .1803161     0.44   0.659    -.2738927    .4329336
                      |
       relinc#c.index |
Woman primary-earner  |  -.0136585   .0077983    -1.75   0.080    -.0289428    .0016258
       Equal-earners  |  -.0115329   .0093962    -1.23   0.220     -.029949    .0068832
                      |
                marst |
               Cohab  |   1.446329   .2146488     6.74   0.000     1.025625    1.867033
                  sex |   .1256566   .1023394     1.23   0.220     -.074925    .3262383
                  age |  -.0059045   .0080494    -0.73   0.463    -.0216811    .0098721
               parent |  -.0487679   .1368712    -0.36   0.722    -.3170305    .2194948
                      |
               employ |
            Parttime  |  -.5930896   .1867965    -3.18   0.001     -.959204   -.2269752
          Unemployed  |   .3210386   .3411697     0.94   0.347    -.3476417     .989719
             Student  |  -.2133456   .2618893    -0.81   0.415    -.7266391    .2999479
  Not in labor force  |   .2134956   .1184904     1.80   0.072    -.0187413    .4457325
                      |
            homemaker |  -.2821624   .1260552    -2.24   0.025    -.5292259   -.0350988
                      |
               degree |
 No formal education  |   .5204262   .3328275     1.56   0.118    -.1319038    1.172756
      Primary school  |   .2619472   .2460856     1.06   0.287    -.2203717    .7442661
     Lower secondary  |   .2737873   .1857651     1.47   0.141    -.0903056    .6378802
      Post secondary  |   .4058733   .1499592     2.71   0.007     .1119586    .6997881
Lower level tertiary  |   .5486077   .1284681     4.27   0.000     .2968149    .8004005
Upper level tertiary  |   .6159428   .2107497     2.92   0.003      .202881    1.029005
                      |
                hswrk |   .0459162    .029496     1.56   0.120    -.0118949    .1037272
              respmom |  -.0627912   .1728305    -0.36   0.716    -.4015328    .2759505
              famlife |  -.4254519    .034301   -12.40   0.000    -.4926807   -.3582232
             duration |   .5335283   .1667615     3.20   0.001     .2066818    .8603748
                _cons |  -.4755326   .5974661    -0.80   0.426    -1.646545    .6954795
---------------------------------------------------------------------------------------

. margin          relinc, at(index=(5(2)62)) predict(outcome(2))  post            /* Manage Equal */

Predictive margins                              Number of obs     =      7,118
Model VCE    : Robust

Expression   : Pr(pool==Manage___Together), predict(outcome(2))

1._at        : index           =           5

2._at        : index           =           7

3._at        : index           =           9

4._at        : index           =          11

5._at        : index           =          13

6._at        : index           =          15

7._at        : index           =          17

8._at        : index           =          19

9._at        : index           =          21

10._at       : index           =          23

11._at       : index           =          25

12._at       : index           =          27

13._at       : index           =          29

14._at       : index           =          31

15._at       : index           =          33

16._at       : index           =          35

17._at       : index           =          37

18._at       : index           =          39

19._at       : index           =          41

20._at       : index           =          43

21._at       : index           =          45

22._at       : index           =          47

23._at       : index           =          49

24._at       : index           =          51

25._at       : index           =          53

26._at       : index           =          55

27._at       : index           =          57

28._at       : index           =          59

29._at       : index           =          61

------------------------------------------------------------------------------------------
                         |            Delta-method
                         |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------------------+----------------------------------------------------------------
              _at#relinc |
   1#Man primary-earner  |    .604873   .0310781    19.46   0.000     .5439609     .665785
 1#Woman primary-earner  |   .5682002   .0373892    15.20   0.000     .4949187    .6414817
        1#Equal-earners  |   .5903211   .0429433    13.75   0.000     .5061538    .6744883
   2#Man primary-earner  |   .5902517   .0291993    20.21   0.000     .5330221    .6474813
 2#Woman primary-earner  |   .5572658   .0347336    16.04   0.000     .4891891    .6253424
        2#Equal-earners  |    .586376   .0409199    14.33   0.000     .5061744    .6665775
   3#Man primary-earner  |   .5753916     .02753    20.90   0.000     .5214337    .6293494
 3#Woman primary-earner  |   .5462302   .0325331    16.79   0.000     .4824664    .6099939
        3#Equal-earners  |   .5823003   .0390035    14.93   0.000     .5058549    .6587458
   4#Man primary-earner  |   .5603145   .0261272    21.45   0.000     .5091061    .6115228
 4#Woman primary-earner  |   .5351028   .0309091    17.31   0.000     .4745221    .5956836
        4#Equal-earners  |   .5780935    .037207    15.54   0.000     .5051691    .6510178
   5#Man primary-earner  |   .5450443    .025046    21.76   0.000      .495955    .5941335
 5#Woman primary-earner  |   .5238937   .0299721    17.48   0.000     .4651495    .5826379
        5#Equal-earners  |   .5737548   .0355458    16.14   0.000     .5040863    .6434233
   6#Man primary-earner  |   .5296066   .0243326    21.77   0.000     .4819156    .5772975
 6#Woman primary-earner  |   .5126131   .0297949    17.20   0.000     .4542162      .57101
        6#Equal-earners  |    .569284   .0340379    16.73   0.000      .502571     .635997
   7#Man primary-earner  |   .5140286   .0240149    21.40   0.000     .4669602     .561097
 7#Woman primary-earner  |   .5012718   .0303898    16.49   0.000     .4417089    .5608347
        7#Equal-earners  |   .5646809   .0327036    17.27   0.000      .500583    .6287787
   8#Man primary-earner  |   .4983391   .0240962    20.68   0.000     .4511115    .5455667
 8#Woman primary-earner  |   .4898809   .0317037    15.45   0.000     .4277428     .552019
        8#Equal-earners  |   .5599455   .0315653    17.74   0.000     .4980787    .6218123
   9#Man primary-earner  |    .482568   .0245524    19.65   0.000     .4344461    .5306899
 9#Woman primary-earner  |   .4784519   .0336351    14.22   0.000     .4125284    .5443755
        9#Equal-earners  |   .5550781   .0306462    18.11   0.000     .4950126    .6151437
  10#Man primary-earner  |   .4667463   .0253374    18.42   0.000      .417086    .5164066
10#Woman primary-earner  |   .4669966   .0360611    12.95   0.000     .3963182     .537675
       10#Equal-earners  |   .5500793   .0299694    18.35   0.000     .4913404    .6088181
  11#Man primary-earner  |    .450906   .0263906    17.09   0.000     .3991814    .5026305
11#Woman primary-earner  |    .455527   .0388602    11.72   0.000     .3793624    .5316916
       11#Equal-earners  |   .5449495   .0295552    18.44   0.000     .4870224    .6028767
  12#Man primary-earner  |   .4350795   .0276467    15.74   0.000      .380893     .489266
12#Woman primary-earner  |   .4440554   .0419249    10.59   0.000      .361884    .5262268
       12#Equal-earners  |     .53969   .0294199    18.34   0.000     .4820281    .5973519
  13#Man primary-earner  |   .4192997   .0290424    14.44   0.000     .3623775    .4762218
13#Woman primary-earner  |   .4325941   .0451655     9.58   0.000     .3440713    .5211168
       13#Equal-earners  |   .5343017   .0295733    18.07   0.000     .4763392    .5922642
  14#Man primary-earner  |   .4035994   .0305206    13.22   0.000     .3437801    .4634187
14#Woman primary-earner  |   .4211555    .048509     8.68   0.000     .3260796    .5162315
       14#Equal-earners  |   .5287862   .0300177    17.62   0.000     .4699525    .5876199
  15#Man primary-earner  |   .3880113   .0320317    12.11   0.000     .3252303    .4507923
15#Woman primary-earner  |   .4097524   .0518967     7.90   0.000     .3080367    .5114681
       15#Equal-earners  |   .5231451   .0307482    17.01   0.000     .4628798    .5834103
  16#Man primary-earner  |   .3725676   .0335342    11.11   0.000     .3068417    .4382934
16#Woman primary-earner  |   .3983971   .0552812     7.21   0.000      .290048    .5067462
       16#Equal-earners  |   .5173803   .0317525    16.29   0.000     .4551465    .5796142
  17#Man primary-earner  |   .3572996   .0349938    10.21   0.000     .2887131    .4258861
17#Woman primary-earner  |   .3871021   .0586238     6.60   0.000     .2722015    .5020027
       17#Equal-earners  |   .5114942   .0330138    15.49   0.000     .4467883    .5762001
  18#Man primary-earner  |   .3422377   .0363825     9.41   0.000     .2709293    .4135461
18#Woman primary-earner  |   .3758797   .0618929     6.07   0.000     .2545717    .4971876
       18#Equal-earners  |   .5054891   .0345116    14.65   0.000     .4378477    .5731305
  19#Man primary-earner  |   .3274109   .0376781     8.69   0.000     .2535631    .4012587
19#Woman primary-earner  |    .364742   .0650622     5.61   0.000     .2372224    .4922616
       19#Equal-earners  |   .4993678    .036224    13.79   0.000     .4283702    .5703655
  20#Man primary-earner  |   .3128467    .038863     8.05   0.000     .2366766    .3890168
20#Woman primary-earner  |    .353701   .0681097     5.19   0.000     .2202084    .4871935
       20#Equal-earners  |   .4931333    .038129    12.93   0.000     .4184019    .5678648
  21#Man primary-earner  |   .2985708   .0399237     7.48   0.000     .2203217    .3768199
21#Woman primary-earner  |   .3427681   .0710169     4.83   0.000     .2035775    .4819588
       21#Equal-earners  |   .4867889   .0402055    12.11   0.000     .4079875    .5655903
  22#Man primary-earner  |   .2846071   .0408504     6.97   0.000     .2045419    .3646724
22#Woman primary-earner  |   .3319548   .0737686     4.50   0.000      .187371    .4765385
       22#Equal-earners  |   .4803381   .0424339    11.32   0.000     .3971693     .563507
  23#Man primary-earner  |   .2709773   .0416362     6.51   0.000      .189372    .3525827
23#Woman primary-earner  |   .3212717   .0763518     4.21   0.000     .1716248    .4709185
       23#Equal-earners  |   .4737847   .0447958    10.58   0.000     .3859865    .5615829
  24#Man primary-earner  |   .2577009    .042277     6.10   0.000     .1748396    .3405623
24#Woman primary-earner  |   .3107293   .0787562     3.95   0.000       .15637    .4650886
       24#Equal-earners  |   .4671328   .0472749     9.88   0.000     .3744756    .5597899
  25#Man primary-earner  |   .2447952   .0427712     5.72   0.000     .1609652    .3286251
25#Woman primary-earner  |   .3003375   .0809732     3.71   0.000      .141633     .459042
       25#Equal-earners  |   .4603866   .0498561     9.23   0.000     .3626705    .5581027
  26#Man primary-earner  |   .2322748   .0431191     5.39   0.000     .1477629    .3167867
26#Woman primary-earner  |   .2901057   .0829961     3.50   0.000     .1274362    .4527751
       26#Equal-earners  |   .4535508   .0525255     8.63   0.000     .3506027    .5564988
  27#Man primary-earner  |   .2201524   .0433231     5.08   0.000     .1352408    .3050641
27#Woman primary-earner  |   .2800427   .0848203     3.30   0.001     .1137979    .4462874
       27#Equal-earners  |   .4466301   .0552705     8.08   0.000     .3383018    .5549583
  28#Man primary-earner  |    .208438   .0433868     4.80   0.000     .1234014    .2934746
28#Woman primary-earner  |   .2701567   .0864424     3.13   0.002     .1007328    .4395806
       28#Equal-earners  |   .4396295   .0580794     7.57   0.000      .325796    .5534629
  29#Man primary-earner  |   .1971393   .0433155     4.55   0.000     .1122424    .2820362
29#Woman primary-earner  |   .2604553   .0878605     2.96   0.003     .0882519    .4326588
       29#Equal-earners  |   .4325543   .0609409     7.10   0.000     .3131122    .5519963
------------------------------------------------------------------------------------------

. est store       equal

. 
. mlogit          pool    c.index##i.relinc       i.marst         $ivars                                  , cluster(country)

Iteration 0:   log pseudolikelihood = -8556.7479  
Iteration 1:   log pseudolikelihood = -7771.1515  
Iteration 2:   log pseudolikelihood = -7731.6563  
Iteration 3:   log pseudolikelihood = -7731.3233  
Iteration 4:   log pseudolikelihood = -7731.3232  

Multinomial logistic regression                 Number of obs     =      7,118
                                                Wald chi2(14)     =          .
                                                Prob > chi2       =          .
Log pseudolikelihood = -7731.3232               Pseudo R2         =     0.0965

                                        (Std. Err. adjusted for 18 clusters in country)
---------------------------------------------------------------------------------------
                      |               Robust
                 pool |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
One___Manager         |
                index |   .0425389   .0092928     4.58   0.000     .0243254    .0607524
                      |
               relinc |
Woman primary-earner  |   .1307698   .1965641     0.67   0.506    -.2544888    .5160284
       Equal-earners  |   .0462361   .2967456     0.16   0.876    -.5353746    .6278468
                      |
       relinc#c.index |
Woman primary-earner  |  -.0099546   .0122958    -0.81   0.418     -.034054    .0141448
       Equal-earners  |  -.0255502   .0103089    -2.48   0.013    -.0457553   -.0053451
                      |
                marst |
               Cohab  |   .5033204   .1546229     3.26   0.001      .200265    .8063758
                  sex |  -.0081917   .1862973    -0.04   0.965    -.3733276    .3569442
                  age |  -.0148968   .0053442    -2.79   0.005    -.0253712   -.0044225
               parent |    -.12856   .1374301    -0.94   0.350    -.3979181     .140798
                      |
               employ |
            Parttime  |   .1080902   .1161317     0.93   0.352    -.1195238    .3357042
          Unemployed  |   .3327798   .2842165     1.17   0.242    -.2242743     .889834
             Student  |   .4692673   .1527448     3.07   0.002     .1698929    .7686417
  Not in labor force  |  -.3257106   .1386607    -2.35   0.019    -.5974805   -.0539406
                      |
            homemaker |   .1716677    .103953     1.65   0.099    -.0320764    .3754119
                      |
               degree |
 No formal education  |   .5375384   .3266697     1.65   0.100    -.1027223    1.177799
      Primary school  |   .4951412   .1869717     2.65   0.008     .1286834    .8615989
     Lower secondary  |   -.000177   .2068308    -0.00   0.999     -.405558     .405204
      Post secondary  |  -.0230096   .2093702    -0.11   0.912    -.4333675    .3873484
Lower level tertiary  |  -.5348015   .2228857    -2.40   0.016    -.9716495   -.0979535
Upper level tertiary  |  -.5659521   .1994659    -2.84   0.005    -.9568981   -.1750061
                      |
                hswrk |  -.1118665    .034585    -3.23   0.001    -.1796518   -.0440812
              respmom |   .0233861   .0964368     0.24   0.808    -.1656266    .2123988
              famlife |  -.2272734   .0877348    -2.59   0.010    -.3992303   -.0553164
             duration |   .3192584   .1539126     2.07   0.038     .0175952    .6209216
                _cons |   .1420374   .8123204     0.17   0.861    -1.450081    1.734156
----------------------+----------------------------------------------------------------
Manage___Together     |  (base outcome)
----------------------+----------------------------------------------------------------
Keep_Some___Separate  |
                index |   .0235853   .0132722     1.78   0.076    -.0024276    .0495983
                      |
               relinc |
Woman primary-earner  |   .1823376   .1550431     1.18   0.240    -.1215412    .4862165
       Equal-earners  |   .3204851   .2551228     1.26   0.209    -.1795465    .8205166
                      |
       relinc#c.index |
Woman primary-earner  |  -.0050941   .0086147    -0.59   0.554    -.0219786    .0117903
       Equal-earners  |  -.0264558   .0171663    -1.54   0.123    -.0601011    .0071895
                      |
                marst |
               Cohab  |   1.129425   .1883364     6.00   0.000     .7602927    1.498558
                  sex |   .0986058   .1048385     0.94   0.347    -.1068739    .3040856
                  age |  -.0151991   .0045202    -3.36   0.001    -.0240585   -.0063398
               parent |  -.0887644   .0810691    -1.09   0.274     -.247657    .0701281
                      |
               employ |
            Parttime  |  -.4487754   .1667744    -2.69   0.007    -.7756471   -.1219036
          Unemployed  |  -.2533751   .2315728    -1.09   0.274    -.7072495    .2004994
             Student  |  -.4258828   .1353878    -3.15   0.002    -.6912379   -.1605276
  Not in labor force  |  -.2119749    .135183    -1.57   0.117    -.4769287     .052979
                      |
            homemaker |  -.2584673   .1053884    -2.45   0.014    -.4650247   -.0519098
                      |
               degree |
 No formal education  |   .4493087   .4301937     1.04   0.296    -.3938554    1.292473
      Primary school  |  -.2251559    .186964    -1.20   0.228    -.5915987    .1412868
     Lower secondary  |  -.0897562    .144151    -0.62   0.534     -.372287    .1927746
      Post secondary  |  -.0206339   .1565509    -0.13   0.895    -.3274681    .2862002
Lower level tertiary  |   .4377059   .1109907     3.94   0.000     .2201681    .6552437
Upper level tertiary  |   .7156172   .1195061     5.99   0.000     .4813896    .9498449
                      |
                hswrk |   -.021533   .0210964    -1.02   0.307    -.0628811    .0198151
              respmom |   .2697247    .131259     2.05   0.040     .0124617    .5269876
              famlife |  -.2354303    .042659    -5.52   0.000    -.3190404   -.1518202
             duration |   .3310009   .2315823     1.43   0.153    -.1228921    .7848938
                _cons |  -.0437431   .4986333    -0.09   0.930    -1.021046    .9335603
----------------------+----------------------------------------------------------------
Keep_All___Separate   |
                index |   .0360246   .0120834     2.98   0.003     .0123415    .0597077
                      |
               relinc |
Woman primary-earner  |   .3706799   .2165295     1.71   0.087    -.0537102    .7950699
       Equal-earners  |   .0795205   .1803161     0.44   0.659    -.2738927    .4329336
                      |
       relinc#c.index |
Woman primary-earner  |  -.0136585   .0077983    -1.75   0.080    -.0289428    .0016258
       Equal-earners  |  -.0115329   .0093962    -1.23   0.220     -.029949    .0068832
                      |
                marst |
               Cohab  |   1.446329   .2146488     6.74   0.000     1.025625    1.867033
                  sex |   .1256566   .1023394     1.23   0.220     -.074925    .3262383
                  age |  -.0059045   .0080494    -0.73   0.463    -.0216811    .0098721
               parent |  -.0487679   .1368712    -0.36   0.722    -.3170305    .2194948
                      |
               employ |
            Parttime  |  -.5930896   .1867965    -3.18   0.001     -.959204   -.2269752
          Unemployed  |   .3210386   .3411697     0.94   0.347    -.3476417     .989719
             Student  |  -.2133456   .2618893    -0.81   0.415    -.7266391    .2999479
  Not in labor force  |   .2134956   .1184904     1.80   0.072    -.0187413    .4457325
                      |
            homemaker |  -.2821624   .1260552    -2.24   0.025    -.5292259   -.0350988
                      |
               degree |
 No formal education  |   .5204262   .3328275     1.56   0.118    -.1319038    1.172756
      Primary school  |   .2619472   .2460856     1.06   0.287    -.2203717    .7442661
     Lower secondary  |   .2737873   .1857651     1.47   0.141    -.0903056    .6378802
      Post secondary  |   .4058733   .1499592     2.71   0.007     .1119586    .6997881
Lower level tertiary  |   .5486077   .1284681     4.27   0.000     .2968149    .8004005
Upper level tertiary  |   .6159428   .2107497     2.92   0.003      .202881    1.029005
                      |
                hswrk |   .0459162    .029496     1.56   0.120    -.0118949    .1037272
              respmom |  -.0627912   .1728305    -0.36   0.716    -.4015328    .2759505
              famlife |  -.4254519    .034301   -12.40   0.000    -.4926807   -.3582232
             duration |   .5335283   .1667615     3.20   0.001     .2066818    .8603748
                _cons |  -.4755326   .5974661    -0.80   0.426    -1.646545    .6954795
---------------------------------------------------------------------------------------

. margin          relinc, at(index=(5(2)62)) predict(outcome(3))  post            /* Pool Some    */

Predictive margins                              Number of obs     =      7,118
Model VCE    : Robust

Expression   : Pr(pool==Keep_Some___Separate), predict(outcome(3))

1._at        : index           =           5

2._at        : index           =           7

3._at        : index           =           9

4._at        : index           =          11

5._at        : index           =          13

6._at        : index           =          15

7._at        : index           =          17

8._at        : index           =          19

9._at        : index           =          21

10._at       : index           =          23

11._at       : index           =          25

12._at       : index           =          27

13._at       : index           =          29

14._at       : index           =          31

15._at       : index           =          33

16._at       : index           =          35

17._at       : index           =          37

18._at       : index           =          39

19._at       : index           =          41

20._at       : index           =          43

21._at       : index           =          45

22._at       : index           =          47

23._at       : index           =          49

24._at       : index           =          51

25._at       : index           =          53

26._at       : index           =          55

27._at       : index           =          57

28._at       : index           =          59

29._at       : index           =          61

------------------------------------------------------------------------------------------
                         |            Delta-method
                         |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------------------+----------------------------------------------------------------
              _at#relinc |
   1#Man primary-earner  |   .1767974   .0248514     7.11   0.000     .1280896    .2255052
 1#Woman primary-earner  |   .1905463   .0260077     7.33   0.000     .1395722    .2415204
        1#Equal-earners  |   .2053409   .0232518     8.83   0.000     .1597682    .2509135
   2#Man primary-earner  |   .1800788   .0229128     7.86   0.000     .1351706     .224987
 2#Woman primary-earner  |    .193346   .0241024     8.02   0.000     .1461061    .2405859
        2#Equal-earners  |   .2026569    .021148     9.58   0.000     .1612075    .2441062
   3#Man primary-earner  |   .1832476   .0212221     8.63   0.000      .141653    .2248422
 3#Woman primary-earner  |   .1960871   .0225437     8.70   0.000     .1519022    .2402719
        3#Equal-earners  |   .1999453   .0193184    10.35   0.000      .162082    .2378085
   4#Man primary-earner  |   .1862926   .0198922     9.37   0.000     .1473045    .2252807
 4#Woman primary-earner  |   .1987647   .0214289     9.28   0.000     .1567647    .2407646
        4#Equal-earners  |   .1972067   .0178224    11.07   0.000     .1622754    .2321381
   5#Man primary-earner  |   .1892028   .0190481     9.93   0.000     .1518692    .2265365
 5#Woman primary-earner  |    .201374   .0208481     9.66   0.000     .1605123    .2422356
        5#Equal-earners  |    .194442    .016723    11.63   0.000     .1616655    .2272185
   6#Man primary-earner  |   .1919676   .0188023    10.21   0.000     .1551158    .2288193
 6#Woman primary-earner  |   .2039102   .0208606     9.77   0.000     .1630243    .2447961
        6#Equal-earners  |   .1916519   .0160731    11.92   0.000     .1601493    .2231545
   7#Man primary-earner  |   .1945764   .0192198    10.12   0.000     .1569062    .2322466
 7#Woman primary-earner  |   .2063687   .0214753     9.61   0.000     .1642778    .2484596
        7#Equal-earners  |   .1888374   .0158986    11.88   0.000     .1576768    .2199981
   8#Man primary-earner  |   .1970195   .0202961     9.71   0.000     .1572398    .2367991
 8#Woman primary-earner  |   .2087448   .0226494     9.22   0.000     .1643529    .2531367
        8#Equal-earners  |   .1859996    .016186    11.49   0.000     .1542756    .2177235
   9#Man primary-earner  |   .1992873    .021964     9.07   0.000     .1562387     .242336
 9#Woman primary-earner  |    .211034   .0243036     8.68   0.000     .1633999    .2586681
        9#Equal-earners  |   .1831394   .0168838    10.85   0.000     .1500478    .2162311
  10#Man primary-earner  |   .2013713   .0241242     8.35   0.000     .1540888    .2486539
10#Woman primary-earner  |   .2132321   .0263461     8.09   0.000     .1615946    .2648696
       10#Equal-earners  |   .1802582   .0179176    10.06   0.000     .1451403    .2153761
  11#Man primary-earner  |   .2032634   .0266746     7.62   0.000     .1509822    .2555446
11#Woman primary-earner  |   .2153348     .02869     7.51   0.000     .1591035    .2715662
       11#Equal-earners  |    .177357   .0192085     9.23   0.000     .1397091     .215005
  12#Man primary-earner  |   .2049564   .0295264     6.94   0.000     .1470856    .2628271
12#Woman primary-earner  |   .2173382   .0312608     6.95   0.000     .1560681    .2786083
       12#Equal-earners  |   .1744374   .0206852     8.43   0.000     .1338952    .2149795
  13#Man primary-earner  |   .2064439   .0326084     6.33   0.000     .1425326    .2703551
13#Woman primary-earner  |   .2192385    .033999     6.45   0.000     .1526017    .2858753
       13#Equal-earners  |   .1715005   .0222893     7.69   0.000     .1278144    .2151867
  14#Man primary-earner  |   .2077205   .0358652     5.79   0.000      .137426     .278015
14#Woman primary-earner  |   .2210321   .0368576     6.00   0.000     .1487925    .2932716
       14#Equal-earners  |    .168548   .0239753     7.03   0.000     .1215574    .2155387
  15#Man primary-earner  |    .208782   .0392541     5.32   0.000     .1318454    .2857186
15#Woman primary-earner  |   .2227156   .0398001     5.60   0.000     .1447088    .3007224
       15#Equal-earners  |   .1655814   .0257085     6.44   0.000     .1151936    .2159692
  16#Man primary-earner  |   .2096249   .0427417     4.90   0.000     .1258526    .2933972
16#Woman primary-earner  |   .2242861   .0427981     5.24   0.000     .1404033    .3081689
       16#Equal-earners  |   .1626023   .0274629     5.92   0.000      .108776    .2164285
  17#Man primary-earner  |   .2102469   .0463015     4.54   0.000     .1194977    .3009962
17#Woman primary-earner  |   .2257407   .0458291     4.93   0.000     .1359174    .3155641
       17#Equal-earners  |   .1596123   .0292185     5.46   0.000     .1023451    .2168795
  18#Man primary-earner  |   .2106469   .0499117     4.22   0.000     .1128219     .308472
18#Woman primary-earner  |    .227077   .0488751     4.65   0.000     .1312836    .3228704
       18#Equal-earners  |   .1566133   .0309602     5.06   0.000     .0959325     .217294
  19#Man primary-earner  |   .2108248    .053554     3.94   0.000     .1058608    .3157888
19#Woman primary-earner  |   .2282927   .0519216     4.40   0.000     .1265281    .3300572
       19#Equal-earners  |   .1536069   .0326762     4.70   0.000     .0895627    .2176511
  20#Man primary-earner  |   .2107816   .0572131     3.68   0.000     .0986461    .3229172
20#Woman primary-earner  |   .2293859   .0549569     4.17   0.000     .1216723    .3370995
       20#Equal-earners  |   .1505951   .0343574     4.38   0.000     .0832557    .2179344
  21#Man primary-earner  |   .2105194    .060875     3.46   0.001     .0912065    .3298323
21#Woman primary-earner  |   .2303551   .0579712     3.97   0.000     .1167336    .3439766
       21#Equal-earners  |   .1475797   .0359966     4.10   0.000     .0770276    .2181318
  22#Man primary-earner  |   .2100413   .0645278     3.26   0.001     .0835691    .3365134
22#Woman primary-earner  |    .231199   .0609564     3.79   0.000     .1117265    .3506714
       22#Equal-earners  |   .1445627   .0375879     3.85   0.000     .0708917    .2182337
  23#Man primary-earner  |   .2093513   .0681602     3.07   0.002     .0757598    .3429428
23#Woman primary-earner  |   .2319166   .0639059     3.63   0.000     .1066634    .3571699
       23#Equal-earners  |    .141546   .0391267     3.62   0.000     .0648591    .2182328
  24#Man primary-earner  |   .2084545   .0717621     2.90   0.004     .0678035    .3491056
24#Woman primary-earner  |   .2325075    .066814     3.48   0.001     .1015544    .3634605
       24#Equal-earners  |   .1385316    .040609     3.41   0.001     .0589395    .2181238
  25#Man primary-earner  |   .2073569   .0753239     2.75   0.006     .0597247    .3549891
25#Woman primary-earner  |   .2329712   .0696761     3.34   0.001     .0964085    .3695339
       25#Equal-earners  |   .1355216   .0420317     3.22   0.001     .0531409    .2179023
  26#Man primary-earner  |   .2060652   .0788369     2.61   0.009     .0515476    .3605827
26#Woman primary-earner  |   .2333079   .0724884     3.22   0.001     .0912333    .3753825
       26#Equal-earners  |   .1325181   .0433923     3.05   0.002     .0474707    .2175655
  27#Man primary-earner  |   .2045867   .0822928     2.49   0.013     .0432958    .3658776
27#Woman primary-earner  |   .2335179   .0752476     3.10   0.002     .0860354    .3810005
       27#Equal-earners  |   .1295229   .0446886     2.90   0.004     .0419348     .217111
  28#Man primary-earner  |   .2029296   .0856836     2.37   0.018     .0349927    .3708664
28#Woman primary-earner  |    .233602   .0779512     3.00   0.003     .0808205    .3863836
       28#Equal-earners  |   .1265383   .0459189     2.76   0.006      .036539    .2165377
  29#Man primary-earner  |   .2011024   .0890021     2.26   0.024     .0266614    .3755434
29#Woman primary-earner  |   .2335611   .0805972     2.90   0.004     .0755936    .3915287
       29#Equal-earners  |   .1235664   .0470817     2.62   0.009     .0312879    .2158448
------------------------------------------------------------------------------------------

. est store       some

. 
. mlogit          pool    c.index##i.relinc       i.marst         $ivars                                  , cluster(country)

Iteration 0:   log pseudolikelihood = -8556.7479  
Iteration 1:   log pseudolikelihood = -7771.1515  
Iteration 2:   log pseudolikelihood = -7731.6563  
Iteration 3:   log pseudolikelihood = -7731.3233  
Iteration 4:   log pseudolikelihood = -7731.3232  

Multinomial logistic regression                 Number of obs     =      7,118
                                                Wald chi2(14)     =          .
                                                Prob > chi2       =          .
Log pseudolikelihood = -7731.3232               Pseudo R2         =     0.0965

                                        (Std. Err. adjusted for 18 clusters in country)
---------------------------------------------------------------------------------------
                      |               Robust
                 pool |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
One___Manager         |
                index |   .0425389   .0092928     4.58   0.000     .0243254    .0607524
                      |
               relinc |
Woman primary-earner  |   .1307698   .1965641     0.67   0.506    -.2544888    .5160284
       Equal-earners  |   .0462361   .2967456     0.16   0.876    -.5353746    .6278468
                      |
       relinc#c.index |
Woman primary-earner  |  -.0099546   .0122958    -0.81   0.418     -.034054    .0141448
       Equal-earners  |  -.0255502   .0103089    -2.48   0.013    -.0457553   -.0053451
                      |
                marst |
               Cohab  |   .5033204   .1546229     3.26   0.001      .200265    .8063758
                  sex |  -.0081917   .1862973    -0.04   0.965    -.3733276    .3569442
                  age |  -.0148968   .0053442    -2.79   0.005    -.0253712   -.0044225
               parent |    -.12856   .1374301    -0.94   0.350    -.3979181     .140798
                      |
               employ |
            Parttime  |   .1080902   .1161317     0.93   0.352    -.1195238    .3357042
          Unemployed  |   .3327798   .2842165     1.17   0.242    -.2242743     .889834
             Student  |   .4692673   .1527448     3.07   0.002     .1698929    .7686417
  Not in labor force  |  -.3257106   .1386607    -2.35   0.019    -.5974805   -.0539406
                      |
            homemaker |   .1716677    .103953     1.65   0.099    -.0320764    .3754119
                      |
               degree |
 No formal education  |   .5375384   .3266697     1.65   0.100    -.1027223    1.177799
      Primary school  |   .4951412   .1869717     2.65   0.008     .1286834    .8615989
     Lower secondary  |   -.000177   .2068308    -0.00   0.999     -.405558     .405204
      Post secondary  |  -.0230096   .2093702    -0.11   0.912    -.4333675    .3873484
Lower level tertiary  |  -.5348015   .2228857    -2.40   0.016    -.9716495   -.0979535
Upper level tertiary  |  -.5659521   .1994659    -2.84   0.005    -.9568981   -.1750061
                      |
                hswrk |  -.1118665    .034585    -3.23   0.001    -.1796518   -.0440812
              respmom |   .0233861   .0964368     0.24   0.808    -.1656266    .2123988
              famlife |  -.2272734   .0877348    -2.59   0.010    -.3992303   -.0553164
             duration |   .3192584   .1539126     2.07   0.038     .0175952    .6209216
                _cons |   .1420374   .8123204     0.17   0.861    -1.450081    1.734156
----------------------+----------------------------------------------------------------
Manage___Together     |  (base outcome)
----------------------+----------------------------------------------------------------
Keep_Some___Separate  |
                index |   .0235853   .0132722     1.78   0.076    -.0024276    .0495983
                      |
               relinc |
Woman primary-earner  |   .1823376   .1550431     1.18   0.240    -.1215412    .4862165
       Equal-earners  |   .3204851   .2551228     1.26   0.209    -.1795465    .8205166
                      |
       relinc#c.index |
Woman primary-earner  |  -.0050941   .0086147    -0.59   0.554    -.0219786    .0117903
       Equal-earners  |  -.0264558   .0171663    -1.54   0.123    -.0601011    .0071895
                      |
                marst |
               Cohab  |   1.129425   .1883364     6.00   0.000     .7602927    1.498558
                  sex |   .0986058   .1048385     0.94   0.347    -.1068739    .3040856
                  age |  -.0151991   .0045202    -3.36   0.001    -.0240585   -.0063398
               parent |  -.0887644   .0810691    -1.09   0.274     -.247657    .0701281
                      |
               employ |
            Parttime  |  -.4487754   .1667744    -2.69   0.007    -.7756471   -.1219036
          Unemployed  |  -.2533751   .2315728    -1.09   0.274    -.7072495    .2004994
             Student  |  -.4258828   .1353878    -3.15   0.002    -.6912379   -.1605276
  Not in labor force  |  -.2119749    .135183    -1.57   0.117    -.4769287     .052979
                      |
            homemaker |  -.2584673   .1053884    -2.45   0.014    -.4650247   -.0519098
                      |
               degree |
 No formal education  |   .4493087   .4301937     1.04   0.296    -.3938554    1.292473
      Primary school  |  -.2251559    .186964    -1.20   0.228    -.5915987    .1412868
     Lower secondary  |  -.0897562    .144151    -0.62   0.534     -.372287    .1927746
      Post secondary  |  -.0206339   .1565509    -0.13   0.895    -.3274681    .2862002
Lower level tertiary  |   .4377059   .1109907     3.94   0.000     .2201681    .6552437
Upper level tertiary  |   .7156172   .1195061     5.99   0.000     .4813896    .9498449
                      |
                hswrk |   -.021533   .0210964    -1.02   0.307    -.0628811    .0198151
              respmom |   .2697247    .131259     2.05   0.040     .0124617    .5269876
              famlife |  -.2354303    .042659    -5.52   0.000    -.3190404   -.1518202
             duration |   .3310009   .2315823     1.43   0.153    -.1228921    .7848938
                _cons |  -.0437431   .4986333    -0.09   0.930    -1.021046    .9335603
----------------------+----------------------------------------------------------------
Keep_All___Separate   |
                index |   .0360246   .0120834     2.98   0.003     .0123415    .0597077
                      |
               relinc |
Woman primary-earner  |   .3706799   .2165295     1.71   0.087    -.0537102    .7950699
       Equal-earners  |   .0795205   .1803161     0.44   0.659    -.2738927    .4329336
                      |
       relinc#c.index |
Woman primary-earner  |  -.0136585   .0077983    -1.75   0.080    -.0289428    .0016258
       Equal-earners  |  -.0115329   .0093962    -1.23   0.220     -.029949    .0068832
                      |
                marst |
               Cohab  |   1.446329   .2146488     6.74   0.000     1.025625    1.867033
                  sex |   .1256566   .1023394     1.23   0.220     -.074925    .3262383
                  age |  -.0059045   .0080494    -0.73   0.463    -.0216811    .0098721
               parent |  -.0487679   .1368712    -0.36   0.722    -.3170305    .2194948
                      |
               employ |
            Parttime  |  -.5930896   .1867965    -3.18   0.001     -.959204   -.2269752
          Unemployed  |   .3210386   .3411697     0.94   0.347    -.3476417     .989719
             Student  |  -.2133456   .2618893    -0.81   0.415    -.7266391    .2999479
  Not in labor force  |   .2134956   .1184904     1.80   0.072    -.0187413    .4457325
                      |
            homemaker |  -.2821624   .1260552    -2.24   0.025    -.5292259   -.0350988
                      |
               degree |
 No formal education  |   .5204262   .3328275     1.56   0.118    -.1319038    1.172756
      Primary school  |   .2619472   .2460856     1.06   0.287    -.2203717    .7442661
     Lower secondary  |   .2737873   .1857651     1.47   0.141    -.0903056    .6378802
      Post secondary  |   .4058733   .1499592     2.71   0.007     .1119586    .6997881
Lower level tertiary  |   .5486077   .1284681     4.27   0.000     .2968149    .8004005
Upper level tertiary  |   .6159428   .2107497     2.92   0.003      .202881    1.029005
                      |
                hswrk |   .0459162    .029496     1.56   0.120    -.0118949    .1037272
              respmom |  -.0627912   .1728305    -0.36   0.716    -.4015328    .2759505
              famlife |  -.4254519    .034301   -12.40   0.000    -.4926807   -.3582232
             duration |   .5335283   .1667615     3.20   0.001     .2066818    .8603748
                _cons |  -.4755326   .5974661    -0.80   0.426    -1.646545    .6954795
---------------------------------------------------------------------------------------

. margin          relinc, at(index=(5(2)62)) predict(outcome(4))  post            /* Keep Sep             */

Predictive margins                              Number of obs     =      7,118
Model VCE    : Robust

Expression   : Pr(pool==Keep_All___Separate), predict(outcome(4))

1._at        : index           =           5

2._at        : index           =           7

3._at        : index           =           9

4._at        : index           =          11

5._at        : index           =          13

6._at        : index           =          15

7._at        : index           =          17

8._at        : index           =          19

9._at        : index           =          21

10._at       : index           =          23

11._at       : index           =          25

12._at       : index           =          27

13._at       : index           =          29

14._at       : index           =          31

15._at       : index           =          33

16._at       : index           =          35

17._at       : index           =          37

18._at       : index           =          39

19._at       : index           =          41

20._at       : index           =          43

21._at       : index           =          45

22._at       : index           =          47

23._at       : index           =          49

24._at       : index           =          51

25._at       : index           =          53

26._at       : index           =          55

27._at       : index           =          57

28._at       : index           =          59

29._at       : index           =          61

------------------------------------------------------------------------------------------
                         |            Delta-method
                         |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------------------+----------------------------------------------------------------
              _at#relinc |
   1#Man primary-earner  |   .0882017   .0173598     5.08   0.000     .0541771    .1222262
 1#Woman primary-earner  |    .109243   .0167547     6.52   0.000     .0764044    .1420816
        1#Equal-earners  |   .0867998   .0205618     4.22   0.000     .0464994    .1271002
   2#Man primary-earner  |   .0919305   .0169529     5.42   0.000     .0587034    .1251576
 2#Woman primary-earner  |   .1115781   .0163222     6.84   0.000     .0795872    .1435689
        2#Equal-earners  |   .0903743   .0199133     4.54   0.000      .051345    .1294036
   3#Man primary-earner  |   .0957262   .0165603     5.78   0.000     .0632686    .1281839
 3#Woman primary-earner  |   .1139059   .0159054     7.16   0.000      .082732    .1450799
        3#Equal-earners  |   .0940639   .0193221     4.87   0.000     .0561933    .1319345
   4#Man primary-earner  |   .0995828    .016204     6.15   0.000     .0678236     .131342
 4#Woman primary-earner  |   .1162234   .0155086     7.49   0.000     .0858271    .1466198
        4#Equal-earners  |   .0978702   .0188303     5.20   0.000     .0609634     .134777
   5#Man primary-earner  |   .1034938   .0159104     6.50   0.000       .07231    .1346775
 5#Woman primary-earner  |   .1185274   .0151366     7.83   0.000     .0888602    .1481946
        5#Equal-earners  |   .1017944   .0184885     5.51   0.000     .0655575    .1380313
   6#Man primary-earner  |   .1074521   .0157106     6.84   0.000     .0766598    .1382443
 6#Woman primary-earner  |   .1208146   .0147941     8.17   0.000     .0918186    .1498106
        6#Equal-earners  |   .1058378   .0183535     5.77   0.000     .0698655      .14181
   7#Man primary-earner  |   .1114504   .0156391     7.13   0.000     .0807983    .1421024
 7#Woman primary-earner  |   .1230818   .0144863     8.50   0.000     .0946891    .1514745
        7#Equal-earners  |   .1100014   .0184837     5.95   0.000     .0737741    .1462287
   8#Man primary-earner  |   .1154808   .0157313     7.34   0.000     .0846479    .1463136
 8#Woman primary-earner  |   .1253256   .0142183     8.81   0.000     .0974582     .153193
        8#Equal-earners  |   .1142863   .0189319     6.04   0.000     .0771804    .1513921
   9#Man primary-earner  |   .1195351   .0160209     7.46   0.000     .0881348    .1509354
 9#Woman primary-earner  |   .1275428   .0139953     9.11   0.000     .1001126     .154973
        9#Equal-earners  |    .118693   .0197384     6.01   0.000     .0800065    .1573795
  10#Man primary-earner  |   .1236048   .0165357     7.48   0.000     .0911955    .1560141
10#Woman primary-earner  |   .1297301   .0138222     9.39   0.000     .1026391    .1568211
       10#Equal-earners  |   .1232223   .0209255     5.89   0.000     .0822091    .1642356
  11#Man primary-earner  |   .1276812   .0172952     7.38   0.000     .0937833    .1615791
11#Woman primary-earner  |   .1318842   .0137039     9.62   0.000     .1050251    .1587433
       11#Equal-earners  |   .1278746   .0224978     5.68   0.000     .0837797    .1719695
  12#Man primary-earner  |   .1317552   .0183091     7.20   0.000     .0958701    .1676403
12#Woman primary-earner  |   .1340018   .0136445     9.82   0.000      .107259    .1607446
       12#Equal-earners  |   .1326499   .0244454     5.43   0.000     .0847377    .1805621
  13#Man primary-earner  |   .1358178    .019578     6.94   0.000     .0974456      .17419
13#Woman primary-earner  |   .1360798   .0136478     9.97   0.000     .1093306    .1628291
       13#Equal-earners  |   .1375484   .0267499     5.14   0.000     .0851196    .1899773
  14#Man primary-earner  |   .1398598   .0210954     6.63   0.000     .0985135    .1812061
14#Woman primary-earner  |   .1381151   .0137166    10.07   0.000     .1112309    .1649992
       14#Equal-earners  |   .1425699   .0293891     4.85   0.000     .0849683    .2001715
  15#Man primary-earner  |    .143872   .0228505     6.30   0.000     .0990859    .1886582
15#Woman primary-earner  |   .1401044    .013853    10.11   0.000     .1129531    .1672558
       15#Equal-earners  |   .1477139    .032341     4.57   0.000     .0843268    .2111011
  16#Man primary-earner  |   .1478454   .0248302     5.95   0.000     .0991792    .1965116
16#Woman primary-earner  |    .142045   .0140579    10.10   0.000      .114492     .169598
       16#Equal-earners  |   .1529799   .0355852     4.30   0.000     .0832341    .2227257
  17#Man primary-earner  |    .151771    .027021     5.62   0.000     .0988108    .2047311
17#Woman primary-earner  |   .1439338   .0143316    10.04   0.000     .1158443    .1720232
       17#Equal-earners  |    .158367   .0391042     4.05   0.000     .0817241    .2350099
  18#Man primary-earner  |   .1556401   .0294102     5.29   0.000     .0979971     .213283
18#Woman primary-earner  |   .1457681   .0146734     9.93   0.000     .1170087    .1745275
       18#Equal-earners  |   .1638742    .042883     3.82   0.000      .079825    .2479234
  19#Man primary-earner  |   .1594442   .0319861     4.98   0.000     .0967525    .2221359
19#Woman primary-earner  |   .1475452    .015082     9.78   0.000     .1179851    .1771054
       19#Equal-earners  |   .1695001   .0469089     3.61   0.000     .0775604    .2614399
  20#Man primary-earner  |   .1631753   .0347384     4.70   0.000     .0950893    .2312613
20#Woman primary-earner  |   .1492627   .0155553     9.60   0.000     .1187749    .1797505
       20#Equal-earners  |   .1752434   .0511711     3.42   0.001     .0749498     .275537
  21#Man primary-earner  |   .1668256   .0376579     4.43   0.000     .0930176    .2406337
21#Woman primary-earner  |   .1509181    .016091     9.38   0.000     .1193804    .1824559
       21#Equal-earners  |   .1811022   .0556604     3.25   0.001     .0720098    .2901946
  22#Man primary-earner  |    .170388   .0407364     4.18   0.000      .090546      .25023
22#Woman primary-earner  |   .1525093   .0166863     9.14   0.000     .1198047    .1852139
       22#Equal-earners  |   .1870746   .0603685     3.10   0.002     .0687544    .3053947
  23#Man primary-earner  |   .1738557   .0439669     3.95   0.000     .0876821    .2600292
23#Woman primary-earner  |   .1540341   .0173385     8.88   0.000     .1200513    .1880169
       23#Equal-earners  |   .1931583   .0652881     2.96   0.003      .065196    .3211207
  24#Man primary-earner  |   .1772224   .0473428     3.74   0.000     .0844322    .2700126
24#Woman primary-earner  |   .1554907   .0180445     8.62   0.000     .1201241    .1908573
       24#Equal-earners  |    .199351   .0704122     2.83   0.005     .0613456    .3373565
  25#Man primary-earner  |   .1804825   .0508582     3.55   0.000     .0808023    .2801628
25#Woman primary-earner  |   .1568774   .0188015     8.34   0.000     .1200272    .1937276
       25#Equal-earners  |     .20565   .0757343     2.72   0.007     .0572135    .3540866
  26#Man primary-earner  |   .1836311   .0545075     3.37   0.001     .0767983    .2904638
26#Woman primary-earner  |   .1581927   .0196064     8.07   0.000     .1197648    .1966206
       26#Equal-earners  |   .2120525    .081248     2.61   0.009     .0528093    .3712956
  27#Man primary-earner  |   .1866636   .0582855     3.20   0.001     .0724261    .3009011
27#Woman primary-earner  |   .1594351   .0204566     7.79   0.000     .1193409    .1995292
       27#Equal-earners  |   .2185552   .0869468     2.51   0.012     .0481426    .3889678
  28#Man primary-earner  |   .1895762   .0621871     3.05   0.002     .0676917    .3114607
28#Woman primary-earner  |   .1606035   .0213492     7.52   0.000     .1187599    .2024471
       28#Equal-earners  |   .2251549   .0928243     2.43   0.015     .0432226    .4070872
  29#Man primary-earner  |   .1923658   .0662073     2.91   0.004     .0626017    .3221298
29#Woman primary-earner  |    .161697   .0222815     7.26   0.000     .1180261    .2053679
       29#Equal-earners  |   .2318481   .0988739     2.34   0.019     .0380588    .4256373
------------------------------------------------------------------------------------------

. est store       sep

. 
. est table oneman equal some sep 

------------------------------------------------------------------
    Variable |   oneman       equal         some         sep      
-------------+----------------------------------------------------
  _at#relinc |
          1 #|
Man prima..  |  .13012795    .60487296     .1767974    .08820169  
          1 #|
Woman pri..  |  .13201051    .56820021    .19054632    .10924297  
          1 #|
Equal-ear~s  |  .11753827    .59032108    .20534086    .08679979  
          2 #|
Man prima..  |  .13773894    .59025173     .1800788    .09193053  
          2 #|
Woman pri..  |   .1378102    .55726576    .19334598    .11157806  
          2 #|
Equal-ear~s  |  .12059283    .58637598    .20265688     .0903743  
          3 #|
Man prima..  |   .1456346    .57539156    .18324759    .09572624  
          3 #|
Woman pri..  |  .14377686    .54623016    .19608705    .11390593  
          3 #|
Equal-ear~s  |  .12369045    .58230035    .19994527    .09406393  
          4 #|
Man prima..  |  .15381012    .56031446    .18629261    .09958282  
          4 #|
Woman pri..  |  .14990905    .53510285    .19876466    .11622344  
          4 #|
Equal-ear~s  |  .12682966    .57809347    .19720671    .09787017  
          5 #|
Man prima..  |  .16225915    .54504426    .18920284    .10349376  
          5 #|
Woman pri..  |   .1562049    .52389372    .20137397    .11852742  
          5 #|
Equal-ear~s  |  .13000887     .5737548    .19444197    .10179437  
          6 #|
Man prima..  |  .17097378    .52960657    .19196757    .10745208  
          6 #|
Woman pri..  |  .16266207    .51261311     .2039102    .12081462  
          6 #|
Equal-ear~s  |  .13322635    .56928399     .1916519    .10583776  
          7 #|
Man prima..  |   .1799446    .51402862    .19457641    .11145036  
          7 #|
Woman pri..  |  .16927775     .5012718    .20636867    .12308177  
          7 #|
Equal-ear~s  |  .13648027    .56468088    .18883744    .11000142  
          8 #|
Man prima..  |  .18916067     .4983391    .19701946    .11548076  
          8 #|
Woman pri..  |  .17604871    .48988091    .20874477    .12532561  
          8 #|
Equal-ear~s  |  .13976864    .55994551    .18599959    .11428626  
          9 #|
Man prima..  |  .19860959    .48256798    .19928734    .11953508  
          9 #|
Woman pri..  |  .18297123    .47845192    .21103403    .12754281  
          9 #|
Equal-ear~s  |  .14308937    .55507814    .18313945    .11869304  
         10 #|
Man prima..  |  .20827755    .46674631    .20137133    .12360481  
         10 #|
Woman pri..  |  .19004118    .46699662    .21323211     .1297301  
         10 #|
Equal-ear~s  |  .14644022    .55007925    .18025818    .12322234  
         11 #|
Man prima..  |  .21814945    .45090599     .2032634    .12768117  
         11 #|
Woman pri..  |  .19725395    .45552702    .21533484    .13188418  
         11 #|
Equal-ear~s  |  .14981884    .54494955    .17735704    .12787456  
         12 #|
Man prima..  |  .22820896     .4350795    .20495635     .1317552  
         12 #|
Woman pri..  |  .20460457    .44405537    .21733822    .13400183  
         12 #|
Equal-ear~s  |  .15322275    .53968997    .17443736    .13264992  
         13 #|
Man prima..  |  .23843869    .41929966    .20644386    .13581779  
         13 #|
Woman pri..  |  .21208762    .43259405    .21923848    .13607984  
         13 #|
Equal-ear~s  |  .15664935     .5343017    .17150053    .13754842  
         14 #|
Man prima..  |  .24882031    .40359938    .20772054    .13985978  
         14 #|
Woman pri..  |  .21969734    .42115555    .22103205    .13811506  
         14 #|
Equal-ear~s  |  .16009592    .52878617    .16854803    .14256989  
         15 #|
Man prima..  |  .25933471    .38801129      .208782    .14387201  
         15 #|
Woman pri..  |  .22742757    .40975238    .22271561    .14010443  
         15 #|
Equal-ear~s  |  .16355961    .52314507    .16558141    .14771391  
         16 #|
Man prima..  |  .26996216    .37256757    .20962488    .14784539  
         16 #|
Woman pri..  |  .23527186    .39839708     .2242861    .14204496  
         16 #|
Equal-ear~s  |  .16703749    .51738034    .16260228    .15297989  
         17 #|
Man prima..  |  .28068249     .3572996    .21024693    .15177098  
         17 #|
Woman pri..  |  .24322343    .38710207    .22574073    .14393377  
         17 #|
Equal-ear~s  |  .17052649     .5114942    .15961232      .158367  
         18 #|
Man prima..  |  .29147529     .3422377    .21064694    .15564007  
         18 #|
Woman pri..  |  .25127527    .37587967    .22707699    .14576807  
         18 #|
Equal-ear~s  |  .17402346    .50548911    .15661325    .16387417  
         19 #|
Man prima..  |  .30232005     .3274109    .21082485     .1594442  
         19 #|
Woman pri..  |  .25942009    .36474201    .22829268    .14754522  
         19 #|
Equal-ear~s  |  .17752514    .49936782    .15360689    .16950014  
         20 #|
Man prima..  |  .31319636     .3128467    .21078165     .1631753  
         20 #|
Woman pri..  |  .26765043    .35370097     .2293859     .1492627  
         20 #|
Equal-ear~s  |   .1810282    .49313333    .15059507     .1752434  
         21 #|
Man prima..  |   .3240841    .29857084    .21051941    .16682565  
         21 #|
Woman pri..  |  .27595864    .34276814    .23035508    .15091813  
         21 #|
Equal-ear~s  |  .18452921    .48678892    .14757968     .1811022  
         22 #|
Man prima..  |  .33496359    .28460714    .21004125    .17038801  
         22 #|
Woman pri..  |  .28433697    .33195477    .23119897    .15250929  
         22 #|
Equal-ear~s  |  .18802466    .48033811    .14456266    .18707458  
         23 #|
Man prima..  |  .34581573    .27097734    .20935128    .17385565  
         23 #|
Woman pri..  |  .29277756    .32127168    .23191662    .15403413  
         23 #|
Equal-ear~s  |  .19151098    .47378471    .14154597    .19315834  
         24 #|
Man prima..  |  .35662216    .25770094    .20845453    .17722237  
         24 #|
Woman pri..  |  .30127251    .31072929    .23250746    .15549074  
         24 #|
Equal-ear~s  |  .19498456    .46713278    .13853162    .19935104  
         25 #|
Man prima..  |  .36736541    .24479516    .20735692    .18048252  
         25 #|
Woman pri..  |  .30981388    .30033749    .23297119    .15687743  
         25 #|
Equal-ear~s  |  .19844171    .46038661    .13552163    .20565004  
         26 #|
Man prima..  |  .37802895    .23227484    .20606515    .18363106  
         26 #|
Woman pri..  |  .31839377    .29010568    .23330789    .15819266  
         26 #|
Equal-ear~s  |  .20187872    .45355078    .13251805    .21205245  
         27 #|
Man prima..  |  .38859732    .22015244    .20458668    .18666356  
         27 #|
Woman pri..  |  .32700433    .28004267    .23351793    .15943507  
         27 #|
Equal-ear~s  |  .20529183    .44663006    .12952294    .21855517  
         28 #|
Man prima..  |  .39905622    .20843803    .20292955     .1895762  
         28 #|
Woman pri..  |  .33563781    .27015668    .23360201     .1606035  
         28 #|
Equal-ear~s  |  .20867729    .43962948    .12653835    .22515488  
         29 #|
Man prima..  |  .40939252    .19713931     .2011024    .19236577  
         29 #|
Woman pri..  |  .34428655    .26045534    .23356111    .16169699  
         29 #|
Equal-ear~s  |  .21203132    .43255427    .12356636    .23184805  
------------------------------------------------------------------

. 
. // Figure 3
. global  ivars "i.marst sex age parent i.employ homemaker ib4.degree hswrk respmom famlife duration"

. 
. mlogit          pool    c.index##i.marst                i.relinc $ivars                                 , cluster(country)

Iteration 0:   log pseudolikelihood = -8556.7479  
Iteration 1:   log pseudolikelihood = -7735.0391  
Iteration 2:   log pseudolikelihood = -7697.3405  
Iteration 3:   log pseudolikelihood = -7697.0997  
Iteration 4:   log pseudolikelihood = -7697.0997  

Multinomial logistic regression                 Number of obs     =      7,118
                                                Wald chi2(14)     =          .
                                                Prob > chi2       =          .
Log pseudolikelihood = -7697.0997               Pseudo R2         =     0.1005

                                        (Std. Err. adjusted for 18 clusters in country)
---------------------------------------------------------------------------------------
                      |               Robust
                 pool |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
One___Manager         |
                index |   .0369957   .0072533     5.10   0.000     .0227794    .0512119
                      |
                marst |
               Cohab  |   .3238662   .1892723     1.71   0.087    -.0471007    .6948331
                      |
        marst#c.index |
               Cohab  |  -.0014637   .0059418    -0.25   0.805    -.0131094     .010182
                      |
               relinc |
Woman primary-earner  |  -.0376005   .1553309    -0.24   0.809    -.3420436    .2668425
       Equal-earners  |  -.3934708   .2412672    -1.63   0.103    -.8663459    .0794043
                      |
                  sex |  -.0151653   .1901974    -0.08   0.936    -.3879454    .3576147
                  age |  -.0157116   .0052426    -3.00   0.003    -.0259869   -.0054362
               parent |  -.1458508    .132976    -1.10   0.273    -.4064791    .1147774
                      |
               employ |
            Parttime  |   .0892421   .1134232     0.79   0.431    -.1330632    .3115474
          Unemployed  |   .3283832   .2880716     1.14   0.254    -.2362268    .8929932
             Student  |   .4672046   .1516297     3.08   0.002     .1700159    .7643934
  Not in labor force  |  -.3120697    .137943    -2.26   0.024     -.582433   -.0417064
                      |
            homemaker |   .1612918   .1059118     1.52   0.128    -.0462915    .3688751
                      |
               degree |
 No formal education  |   .5814524   .3303552     1.76   0.078    -.0660319    1.228937
      Primary school  |   .5006302   .1831725     2.73   0.006     .1416187    .8596418
     Lower secondary  |  -.0018596   .2060758    -0.01   0.993    -.4057608    .4020416
      Post secondary  |  -.0355375   .2112795    -0.17   0.866    -.4496378    .3785627
Lower level tertiary  |  -.5504526   .2236395    -2.46   0.014    -.9887779   -.1121272
Upper level tertiary  |  -.5760112   .2011366    -2.86   0.004    -.9702318   -.1817907
                      |
                hswrk |  -.1104741   .0346795    -3.19   0.001    -.1784447   -.0425035
              respmom |   .0185601   .0952915     0.19   0.846    -.1682078     .205328
              famlife |  -.2340095   .0870129    -2.69   0.007    -.4045516   -.0634673
             duration |   .3656163   .1581625     2.31   0.021     .0556235    .6756092
                _cons |   .3479376   .7953015     0.44   0.662    -1.210825      1.9067
----------------------+----------------------------------------------------------------
Manage___Together     |  (base outcome)
----------------------+----------------------------------------------------------------
Keep_Some___Separate  |
                index |   .0284576   .0102418     2.78   0.005      .008384    .0485313
                      |
                marst |
               Cohab  |   1.972327   .1857737    10.62   0.000     1.608217    2.336437
                      |
        marst#c.index |
               Cohab  |  -.0597184   .0122828    -4.86   0.000    -.0837923   -.0356445
                      |
               relinc |
Woman primary-earner  |   .1172166   .1100326     1.07   0.287    -.0984433    .3328765
       Equal-earners  |   -.040778   .1281471    -0.32   0.750    -.2919416    .2103856
                      |
                  sex |   .0858303   .1082764     0.79   0.428    -.1263875    .2980481
                  age |  -.0146881   .0048014    -3.06   0.002    -.0240988   -.0052775
               parent |  -.0649611   .0811498    -0.80   0.423    -.2240119    .0940896
                      |
               employ |
            Parttime  |  -.4628248    .165833    -2.79   0.005    -.7878515   -.1377982
          Unemployed  |   -.260344   .2365238    -1.10   0.271    -.7239221     .203234
             Student  |  -.4275376   .1344085    -3.18   0.001    -.6909734   -.1641018
  Not in labor force  |  -.2127992     .14015    -1.52   0.129    -.4874882    .0618897
                      |
            homemaker |  -.2471658   .1036149    -2.39   0.017    -.4502473   -.0440843
                      |
               degree |
 No formal education  |   .5825895   .4376757     1.33   0.183    -.2752391    1.440418
      Primary school  |  -.1185925   .1854179    -0.64   0.522    -.4820049      .24482
     Lower secondary  |   -.098016   .1406391    -0.70   0.486    -.3736636    .1776315
      Post secondary  |  -.0310045    .161513    -0.19   0.848    -.3475642    .2855552
Lower level tertiary  |   .4517622   .1138274     3.97   0.000     .2286646    .6748598
Upper level tertiary  |   .7347529   .1225016     6.00   0.000     .4946542    .9748516
                      |
                hswrk |  -.0267091    .020901    -1.28   0.201    -.0676742     .014256
              respmom |   .2677258   .1303855     2.05   0.040     .0121748    .5232767
              famlife |  -.2254619   .0443337    -5.09   0.000    -.3123544   -.1385693
             duration |   .2933256   .2154904     1.36   0.173    -.1290279    .7156791
                _cons |  -.1821886    .477801    -0.38   0.703    -1.118661    .7542842
----------------------+----------------------------------------------------------------
Keep_All___Separate   |
                index |   .0383464   .0094518     4.06   0.000     .0198212    .0568715
                      |
                marst |
               Cohab  |   2.054022   .2684409     7.65   0.000     1.527887    2.580156
                      |
        marst#c.index |
               Cohab  |  -.0369372   .0190987    -1.93   0.053    -.0743699    .0004955
                      |
               relinc |
Woman primary-earner  |   .1566402   .1617858     0.97   0.333    -.1604542    .4737346
       Equal-earners  |  -.0710742   .1248615    -0.57   0.569    -.3157982    .1736499
                      |
                  sex |   .1138737   .1063611     1.07   0.284    -.0945902    .3223377
                  age |  -.0057894   .0081346    -0.71   0.477     -.021733    .0101542
               parent |  -.0294559   .1396308    -0.21   0.833    -.3031272    .2442155
                      |
               employ |
            Parttime  |  -.6003112   .1871145    -3.21   0.001    -.9670488   -.2335735
          Unemployed  |   .3156775   .3413628     0.92   0.355    -.3533814    .9847363
             Student  |  -.2011691    .281963    -0.71   0.476    -.7538064    .3514681
  Not in labor force  |   .2091864   .1193832     1.75   0.080    -.0248004    .4431733
                      |
            homemaker |  -.2747155   .1244519    -2.21   0.027    -.5186367   -.0307942
                      |
               degree |
 No formal education  |   .5839181    .316845     1.84   0.065    -.0370868    1.204923
      Primary school  |   .3302295   .2262032     1.46   0.144    -.1131207    .7735797
     Lower secondary  |   .2642577    .189094     1.40   0.162    -.1063596     .634875
      Post secondary  |   .4067366   .1504769     2.70   0.007     .1118072     .701666
Lower level tertiary  |   .5649375   .1292911     4.37   0.000     .3115315    .8183435
Upper level tertiary  |   .6435057   .2188811     2.94   0.003     .2145065    1.072505
                      |
                hswrk |   .0427113   .0311769     1.37   0.171    -.0183943    .1038169
              respmom |  -.0677797   .1716104    -0.39   0.693    -.4041299    .2685704
              famlife |  -.4173445   .0330806   -12.62   0.000    -.4821812   -.3525078
             duration |   .4708376   .1928982     2.44   0.015      .092764    .8489112
                _cons |  -.5258389   .6042744    -0.87   0.384    -1.710195    .6585172
---------------------------------------------------------------------------------------

. margin          i.marst, at(index=(5(2)62)) predict(outcome(1)) post            /* One Manages  */

Predictive margins                              Number of obs     =      7,118
Model VCE    : Robust

Expression   : Pr(pool==One___Manager), predict(outcome(1))

1._at        : index           =           5

2._at        : index           =           7

3._at        : index           =           9

4._at        : index           =          11

5._at        : index           =          13

6._at        : index           =          15

7._at        : index           =          17

8._at        : index           =          19

9._at        : index           =          21

10._at       : index           =          23

11._at       : index           =          25

12._at       : index           =          27

13._at       : index           =          29

14._at       : index           =          31

15._at       : index           =          33

16._at       : index           =          35

17._at       : index           =          37

18._at       : index           =          39

19._at       : index           =          41

20._at       : index           =          43

21._at       : index           =          45

22._at       : index           =          47

23._at       : index           =          49

24._at       : index           =          51

25._at       : index           =          53

26._at       : index           =          55

27._at       : index           =          57

28._at       : index           =          59

29._at       : index           =          61

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   _at#marst |
  1#Married  |   .1348204   .0183006     7.37   0.000     .0989518    .1706889
    1#Cohab  |   .0965126    .017317     5.57   0.000     .0625718    .1304533
  2#Married  |   .1414596   .0179253     7.89   0.000     .1063266    .1765926
    2#Cohab  |   .1045834   .0171273     6.11   0.000     .0710145    .1381524
  3#Married  |    .148269   .0175753     8.44   0.000     .1138221     .182716
    3#Cohab  |   .1131376   .0171751     6.59   0.000      .079475    .1468001
  4#Married  |   .1552397   .0172836     8.98   0.000     .1213645    .1891149
    4#Cohab  |    .122183   .0175887     6.95   0.000     .0877098    .1566562
  5#Married  |   .1623615   .0170901     9.50   0.000     .1288655    .1958575
    5#Cohab  |   .1317256   .0184909     7.12   0.000     .0954841    .1679671
  6#Married  |   .1696233   .0170404     9.95   0.000     .1362248    .2030218
    6#Cohab  |   .1417693   .0199737     7.10   0.000     .1026216    .1809169
  7#Married  |   .1770132   .0171824    10.30   0.000     .1433363    .2106902
    7#Cohab  |   .1523155   .0220818     6.90   0.000     .1090361     .195595
  8#Married  |   .1845184   .0175623    10.51   0.000     .1500968    .2189399
    8#Cohab  |   .1633636   .0248153     6.58   0.000     .1147265    .2120006
  9#Married  |   .1921252   .0182187    10.55   0.000     .1564171    .2278332
    9#Cohab  |     .17491   .0281442     6.21   0.000     .1197483    .2300717
 10#Married  |   .1998193   .0191782    10.42   0.000     .1622308    .2374079
   10#Cohab  |   .1869491   .0320248     5.84   0.000     .1241816    .2497166
 11#Married  |   .2075861   .0204533    10.15   0.000     .1674984    .2476738
   11#Cohab  |   .1994724   .0364097     5.48   0.000     .1281106    .2708342
 12#Married  |   .2154102   .0220436     9.77   0.000     .1722055    .2586148
   12#Cohab  |   .2124688   .0412533     5.15   0.000     .1316137    .2933238
 13#Married  |   .2232761   .0239391     9.33   0.000     .1763564    .2701957
   13#Cohab  |   .2259247   .0465126     4.86   0.000     .1347617    .3170876
 14#Married  |    .231168   .0261236     8.85   0.000     .1799668    .2823692
   14#Cohab  |    .239824   .0521468     4.60   0.000     .1376181      .34203
 15#Married  |   .2390701   .0285784     8.37   0.000     .1830575    .2950828
   15#Cohab  |   .2541482   .0581169     4.37   0.000     .1402411    .3680553
 16#Married  |   .2469668   .0312846     7.89   0.000     .1856502    .3082834
   16#Cohab  |   .2688761   .0643842     4.18   0.000     .1426854    .3950668
 17#Married  |   .2548425   .0342238     7.45   0.000     .1877651      .32192
   17#Cohab  |   .2839845   .0709098     4.00   0.000     .1450039    .4229652
 18#Married  |    .262682   .0373794     7.03   0.000     .1894197    .3359443
   18#Cohab  |   .2994481   .0776543     3.86   0.000     .1472484    .4516478
 19#Married  |   .2704705   .0407362     6.64   0.000     .1906291    .3503119
   19#Cohab  |   .3152394   .0845774     3.73   0.000     .1494706    .4810082
 20#Married  |   .2781939   .0442803     6.28   0.000      .191406    .3649817
   20#Cohab  |   .3313293   .0916379     3.62   0.000     .1517222    .5109363
 21#Married  |   .2858385   .0479993     5.96   0.000     .1917615    .3799154
   21#Cohab  |   .3476869   .0987936     3.52   0.000      .154055    .5413189
 22#Married  |   .2933915   .0518816     5.66   0.000     .1917053    .3950776
   22#Cohab  |   .3642802   .1060016     3.44   0.001     .1565209    .5720396
 23#Married  |   .3008409   .0559166     5.38   0.000     .1912465    .4104354
   23#Cohab  |   .3810758   .1132185     3.37   0.001     .1591716      .60298
 24#Married  |   .3081756   .0600941     5.13   0.000     .1903935    .4259578
   24#Cohab  |   .3980394   .1204006     3.31   0.001     .1620585    .6340202
 25#Married  |   .3153854   .0644045     4.90   0.000      .189155    .4416159
   25#Cohab  |    .415136   .1275044     3.26   0.001     .1652318    .6650401
 26#Married  |   .3224611   .0688387     4.68   0.000     .1875396    .4573825
   26#Cohab  |   .4323301    .134487     3.21   0.001     .1687405    .6959197
 27#Married  |   .3293943   .0733879     4.49   0.000     .1855566    .4732319
   27#Cohab  |   .4495861    .141306     3.18   0.001     .1726314    .7265407
 28#Married  |   .3361778   .0780434     4.31   0.000     .1832155    .4891401
   28#Cohab  |   .4668682   .1479206     3.16   0.002     .1769492    .7567872
 29#Married  |   .3428053    .082797     4.14   0.000     .1805262    .5050845
   29#Cohab  |   .4841411   .1542914     3.14   0.002     .1817355    .7865467
------------------------------------------------------------------------------

. est store       oneman

. 
. mlogit          pool    c.index##i.marst                i.relinc $ivars                                 , cluster(country)

Iteration 0:   log pseudolikelihood = -8556.7479  
Iteration 1:   log pseudolikelihood = -7735.0391  
Iteration 2:   log pseudolikelihood = -7697.3405  
Iteration 3:   log pseudolikelihood = -7697.0997  
Iteration 4:   log pseudolikelihood = -7697.0997  

Multinomial logistic regression                 Number of obs     =      7,118
                                                Wald chi2(14)     =          .
                                                Prob > chi2       =          .
Log pseudolikelihood = -7697.0997               Pseudo R2         =     0.1005

                                        (Std. Err. adjusted for 18 clusters in country)
---------------------------------------------------------------------------------------
                      |               Robust
                 pool |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
One___Manager         |
                index |   .0369957   .0072533     5.10   0.000     .0227794    .0512119
                      |
                marst |
               Cohab  |   .3238662   .1892723     1.71   0.087    -.0471007    .6948331
                      |
        marst#c.index |
               Cohab  |  -.0014637   .0059418    -0.25   0.805    -.0131094     .010182
                      |
               relinc |
Woman primary-earner  |  -.0376005   .1553309    -0.24   0.809    -.3420436    .2668425
       Equal-earners  |  -.3934708   .2412672    -1.63   0.103    -.8663459    .0794043
                      |
                  sex |  -.0151653   .1901974    -0.08   0.936    -.3879454    .3576147
                  age |  -.0157116   .0052426    -3.00   0.003    -.0259869   -.0054362
               parent |  -.1458508    .132976    -1.10   0.273    -.4064791    .1147774
                      |
               employ |
            Parttime  |   .0892421   .1134232     0.79   0.431    -.1330632    .3115474
          Unemployed  |   .3283832   .2880716     1.14   0.254    -.2362268    .8929932
             Student  |   .4672046   .1516297     3.08   0.002     .1700159    .7643934
  Not in labor force  |  -.3120697    .137943    -2.26   0.024     -.582433   -.0417064
                      |
            homemaker |   .1612918   .1059118     1.52   0.128    -.0462915    .3688751
                      |
               degree |
 No formal education  |   .5814524   .3303552     1.76   0.078    -.0660319    1.228937
      Primary school  |   .5006302   .1831725     2.73   0.006     .1416187    .8596418
     Lower secondary  |  -.0018596   .2060758    -0.01   0.993    -.4057608    .4020416
      Post secondary  |  -.0355375   .2112795    -0.17   0.866    -.4496378    .3785627
Lower level tertiary  |  -.5504526   .2236395    -2.46   0.014    -.9887779   -.1121272
Upper level tertiary  |  -.5760112   .2011366    -2.86   0.004    -.9702318   -.1817907
                      |
                hswrk |  -.1104741   .0346795    -3.19   0.001    -.1784447   -.0425035
              respmom |   .0185601   .0952915     0.19   0.846    -.1682078     .205328
              famlife |  -.2340095   .0870129    -2.69   0.007    -.4045516   -.0634673
             duration |   .3656163   .1581625     2.31   0.021     .0556235    .6756092
                _cons |   .3479376   .7953015     0.44   0.662    -1.210825      1.9067
----------------------+----------------------------------------------------------------
Manage___Together     |  (base outcome)
----------------------+----------------------------------------------------------------
Keep_Some___Separate  |
                index |   .0284576   .0102418     2.78   0.005      .008384    .0485313
                      |
                marst |
               Cohab  |   1.972327   .1857737    10.62   0.000     1.608217    2.336437
                      |
        marst#c.index |
               Cohab  |  -.0597184   .0122828    -4.86   0.000    -.0837923   -.0356445
                      |
               relinc |
Woman primary-earner  |   .1172166   .1100326     1.07   0.287    -.0984433    .3328765
       Equal-earners  |   -.040778   .1281471    -0.32   0.750    -.2919416    .2103856
                      |
                  sex |   .0858303   .1082764     0.79   0.428    -.1263875    .2980481
                  age |  -.0146881   .0048014    -3.06   0.002    -.0240988   -.0052775
               parent |  -.0649611   .0811498    -0.80   0.423    -.2240119    .0940896
                      |
               employ |
            Parttime  |  -.4628248    .165833    -2.79   0.005    -.7878515   -.1377982
          Unemployed  |   -.260344   .2365238    -1.10   0.271    -.7239221     .203234
             Student  |  -.4275376   .1344085    -3.18   0.001    -.6909734   -.1641018
  Not in labor force  |  -.2127992     .14015    -1.52   0.129    -.4874882    .0618897
                      |
            homemaker |  -.2471658   .1036149    -2.39   0.017    -.4502473   -.0440843
                      |
               degree |
 No formal education  |   .5825895   .4376757     1.33   0.183    -.2752391    1.440418
      Primary school  |  -.1185925   .1854179    -0.64   0.522    -.4820049      .24482
     Lower secondary  |   -.098016   .1406391    -0.70   0.486    -.3736636    .1776315
      Post secondary  |  -.0310045    .161513    -0.19   0.848    -.3475642    .2855552
Lower level tertiary  |   .4517622   .1138274     3.97   0.000     .2286646    .6748598
Upper level tertiary  |   .7347529   .1225016     6.00   0.000     .4946542    .9748516
                      |
                hswrk |  -.0267091    .020901    -1.28   0.201    -.0676742     .014256
              respmom |   .2677258   .1303855     2.05   0.040     .0121748    .5232767
              famlife |  -.2254619   .0443337    -5.09   0.000    -.3123544   -.1385693
             duration |   .2933256   .2154904     1.36   0.173    -.1290279    .7156791
                _cons |  -.1821886    .477801    -0.38   0.703    -1.118661    .7542842
----------------------+----------------------------------------------------------------
Keep_All___Separate   |
                index |   .0383464   .0094518     4.06   0.000     .0198212    .0568715
                      |
                marst |
               Cohab  |   2.054022   .2684409     7.65   0.000     1.527887    2.580156
                      |
        marst#c.index |
               Cohab  |  -.0369372   .0190987    -1.93   0.053    -.0743699    .0004955
                      |
               relinc |
Woman primary-earner  |   .1566402   .1617858     0.97   0.333    -.1604542    .4737346
       Equal-earners  |  -.0710742   .1248615    -0.57   0.569    -.3157982    .1736499
                      |
                  sex |   .1138737   .1063611     1.07   0.284    -.0945902    .3223377
                  age |  -.0057894   .0081346    -0.71   0.477     -.021733    .0101542
               parent |  -.0294559   .1396308    -0.21   0.833    -.3031272    .2442155
                      |
               employ |
            Parttime  |  -.6003112   .1871145    -3.21   0.001    -.9670488   -.2335735
          Unemployed  |   .3156775   .3413628     0.92   0.355    -.3533814    .9847363
             Student  |  -.2011691    .281963    -0.71   0.476    -.7538064    .3514681
  Not in labor force  |   .2091864   .1193832     1.75   0.080    -.0248004    .4431733
                      |
            homemaker |  -.2747155   .1244519    -2.21   0.027    -.5186367   -.0307942
                      |
               degree |
 No formal education  |   .5839181    .316845     1.84   0.065    -.0370868    1.204923
      Primary school  |   .3302295   .2262032     1.46   0.144    -.1131207    .7735797
     Lower secondary  |   .2642577    .189094     1.40   0.162    -.1063596     .634875
      Post secondary  |   .4067366   .1504769     2.70   0.007     .1118072     .701666
Lower level tertiary  |   .5649375   .1292911     4.37   0.000     .3115315    .8183435
Upper level tertiary  |   .6435057   .2188811     2.94   0.003     .2145065    1.072505
                      |
                hswrk |   .0427113   .0311769     1.37   0.171    -.0183943    .1038169
              respmom |  -.0677797   .1716104    -0.39   0.693    -.4041299    .2685704
              famlife |  -.4173445   .0330806   -12.62   0.000    -.4821812   -.3525078
             duration |   .4708376   .1928982     2.44   0.015      .092764    .8489112
                _cons |  -.5258389   .6042744    -0.87   0.384    -1.710195    .6585172
---------------------------------------------------------------------------------------

. margin          i.marst, at(index=(5(2)62)) predict(outcome(2)) post            /* Manage Equal */

Predictive margins                              Number of obs     =      7,118
Model VCE    : Robust

Expression   : Pr(pool==Manage___Together), predict(outcome(2))

1._at        : index           =           5

2._at        : index           =           7

3._at        : index           =           9

4._at        : index           =          11

5._at        : index           =          13

6._at        : index           =          15

7._at        : index           =          17

8._at        : index           =          19

9._at        : index           =          21

10._at       : index           =          23

11._at       : index           =          25

12._at       : index           =          27

13._at       : index           =          29

14._at       : index           =          31

15._at       : index           =          33

16._at       : index           =          35

17._at       : index           =          37

18._at       : index           =          39

19._at       : index           =          41

20._at       : index           =          43

21._at       : index           =          45

22._at       : index           =          47

23._at       : index           =          49

24._at       : index           =          51

25._at       : index           =          53

26._at       : index           =          55

27._at       : index           =          57

28._at       : index           =          59

29._at       : index           =          61

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   _at#marst |
  1#Married  |    .646942    .031924    20.27   0.000      .584372     .709512
    1#Cohab  |   .3280211   .0315069    10.41   0.000     .2662687    .3897735
  2#Married  |   .6319171   .0304144    20.78   0.000      .572306    .6915282
    2#Cohab  |   .3324331   .0276855    12.01   0.000     .2781705    .3866956
  3#Married  |   .6166194   .0289495    21.30   0.000     .5598794    .6733593
    3#Cohab  |   .3363911   .0249244    13.50   0.000     .2875401     .385242
  4#Married  |   .6010739   .0275741    21.80   0.000     .5470295    .6551182
    4#Cohab  |   .3398732   .0235487    14.43   0.000     .2937186    .3860277
  5#Married  |   .5853076   .0263388    22.22   0.000     .5336846    .6369307
    5#Cohab  |   .3428597   .0237149    14.46   0.000     .2963793    .3893401
  6#Married  |   .5693494   .0252973    22.51   0.000     .5197675    .6189313
    6#Cohab  |   .3453335   .0252842    13.66   0.000     .2957775    .3948896
  7#Married  |   .5532296   .0245034    22.58   0.000     .5052038    .6012553
    7#Cohab  |   .3472801   .0279002    12.45   0.000     .2925968    .4019635
  8#Married  |   .5369798   .0240039    22.37   0.000      .489933    .5840266
    8#Cohab  |    .348688   .0311763    11.18   0.000     .2875834    .4097925
  9#Married  |   .5206328   .0238321    21.85   0.000     .4739227     .567343
    9#Cohab  |   .3495483   .0348041    10.04   0.000     .2813335    .4177631
 10#Married  |   .5042224   .0240012    21.01   0.000     .4571809    .5512639
   10#Cohab  |   .3498557   .0385671     9.07   0.000     .2742655    .4254459
 11#Married  |   .4877828   .0245015    19.91   0.000     .4397607    .5358049
   11#Cohab  |   .3496075   .0423199     8.26   0.000      .266662     .432553
 12#Married  |   .4713487   .0253026    18.63   0.000     .4217564     .520941
   12#Cohab  |   .3488046   .0459648     7.59   0.000     .2587152     .438894
 13#Married  |   .4549547   .0263591    17.26   0.000     .4032919    .5066176
   13#Cohab  |   .3474507    .049436     7.03   0.000      .250558    .4443434
 14#Married  |   .4386354   .0276175    15.88   0.000     .3845062    .4927647
   14#Cohab  |   .3455528   .0526886     6.56   0.000      .242285    .4488206
 15#Married  |   .4224247   .0290229    14.55   0.000      .365541    .4793085
   15#Cohab  |   .3431208   .0556931     6.16   0.000     .2339643    .4522773
 16#Married  |   .4063559   .0305231    13.31   0.000     .3465318    .4661801
   16#Cohab  |   .3401675   .0584305     5.82   0.000     .2256458    .4546892
 17#Married  |   .3904611    .032071    12.17   0.000     .3276031    .4533192
   17#Cohab  |   .3367086   .0608904     5.53   0.000     .2173656    .4560516
 18#Married  |   .3747713   .0336257    11.15   0.000     .3088661    .4406765
   18#Cohab  |   .3327623   .0630689     5.28   0.000     .2091495    .4563751
 19#Married  |   .3593158   .0351522    10.22   0.000     .2904187    .4282128
   19#Cohab  |   .3283491   .0649676     5.05   0.000      .201015    .4556833
 20#Married  |   .3441222   .0366213     9.40   0.000     .2723459    .4158986
   20#Cohab  |    .323492   .0665924     4.86   0.000     .1929734    .4540106
 21#Married  |   .3292164   .0380089     8.66   0.000     .2547204    .4037125
   21#Cohab  |   .3182156   .0679529     4.68   0.000     .1850304    .4514009
 22#Married  |   .3146222   .0392957     8.01   0.000      .237604    .3916404
   22#Cohab  |   .3125466   .0690618     4.53   0.000      .177188    .4479053
 23#Married  |   .3003611   .0404664     7.42   0.000     .2210484    .3796738
   23#Cohab  |   .3065129   .0699341     4.38   0.000     .1694445    .4435813
 24#Married  |   .2864524   .0415093     6.90   0.000     .2050956    .3678092
   24#Cohab  |   .3001437   .0705868     4.25   0.000     .1617962    .4384912
 25#Married  |   .2729132    .042416     6.43   0.000     .1897794    .3560471
   25#Cohab  |   .2934692   .0710378     4.13   0.000     .1542376    .4327008
 26#Married  |   .2597582   .0431809     6.02   0.000     .1751252    .3443911
   26#Cohab  |   .2865203   .0713063     4.02   0.000     .1467625    .4262781
 27#Married  |   .2469996   .0438008     5.64   0.000     .1611516    .3328476
   27#Cohab  |   .2793282   .0714115     3.91   0.000     .1393644    .4192921
 28#Married  |   .2346476    .044275     5.30   0.000     .1478702    .3214249
   28#Cohab  |   .2719246   .0713723     3.81   0.000     .1320374    .4118117
 29#Married  |   .2227097   .0446045     4.99   0.000     .1352865    .3101329
   29#Cohab  |   .2643407   .0712074     3.71   0.000     .1247769    .4039046
------------------------------------------------------------------------------

. est store       equal

. 
. mlogit          pool    c.index##i.marst                i.relinc $ivars                                 , cluster(country)

Iteration 0:   log pseudolikelihood = -8556.7479  
Iteration 1:   log pseudolikelihood = -7735.0391  
Iteration 2:   log pseudolikelihood = -7697.3405  
Iteration 3:   log pseudolikelihood = -7697.0997  
Iteration 4:   log pseudolikelihood = -7697.0997  

Multinomial logistic regression                 Number of obs     =      7,118
                                                Wald chi2(14)     =          .
                                                Prob > chi2       =          .
Log pseudolikelihood = -7697.0997               Pseudo R2         =     0.1005

                                        (Std. Err. adjusted for 18 clusters in country)
---------------------------------------------------------------------------------------
                      |               Robust
                 pool |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
One___Manager         |
                index |   .0369957   .0072533     5.10   0.000     .0227794    .0512119
                      |
                marst |
               Cohab  |   .3238662   .1892723     1.71   0.087    -.0471007    .6948331
                      |
        marst#c.index |
               Cohab  |  -.0014637   .0059418    -0.25   0.805    -.0131094     .010182
                      |
               relinc |
Woman primary-earner  |  -.0376005   .1553309    -0.24   0.809    -.3420436    .2668425
       Equal-earners  |  -.3934708   .2412672    -1.63   0.103    -.8663459    .0794043
                      |
                  sex |  -.0151653   .1901974    -0.08   0.936    -.3879454    .3576147
                  age |  -.0157116   .0052426    -3.00   0.003    -.0259869   -.0054362
               parent |  -.1458508    .132976    -1.10   0.273    -.4064791    .1147774
                      |
               employ |
            Parttime  |   .0892421   .1134232     0.79   0.431    -.1330632    .3115474
          Unemployed  |   .3283832   .2880716     1.14   0.254    -.2362268    .8929932
             Student  |   .4672046   .1516297     3.08   0.002     .1700159    .7643934
  Not in labor force  |  -.3120697    .137943    -2.26   0.024     -.582433   -.0417064
                      |
            homemaker |   .1612918   .1059118     1.52   0.128    -.0462915    .3688751
                      |
               degree |
 No formal education  |   .5814524   .3303552     1.76   0.078    -.0660319    1.228937
      Primary school  |   .5006302   .1831725     2.73   0.006     .1416187    .8596418
     Lower secondary  |  -.0018596   .2060758    -0.01   0.993    -.4057608    .4020416
      Post secondary  |  -.0355375   .2112795    -0.17   0.866    -.4496378    .3785627
Lower level tertiary  |  -.5504526   .2236395    -2.46   0.014    -.9887779   -.1121272
Upper level tertiary  |  -.5760112   .2011366    -2.86   0.004    -.9702318   -.1817907
                      |
                hswrk |  -.1104741   .0346795    -3.19   0.001    -.1784447   -.0425035
              respmom |   .0185601   .0952915     0.19   0.846    -.1682078     .205328
              famlife |  -.2340095   .0870129    -2.69   0.007    -.4045516   -.0634673
             duration |   .3656163   .1581625     2.31   0.021     .0556235    .6756092
                _cons |   .3479376   .7953015     0.44   0.662    -1.210825      1.9067
----------------------+----------------------------------------------------------------
Manage___Together     |  (base outcome)
----------------------+----------------------------------------------------------------
Keep_Some___Separate  |
                index |   .0284576   .0102418     2.78   0.005      .008384    .0485313
                      |
                marst |
               Cohab  |   1.972327   .1857737    10.62   0.000     1.608217    2.336437
                      |
        marst#c.index |
               Cohab  |  -.0597184   .0122828    -4.86   0.000    -.0837923   -.0356445
                      |
               relinc |
Woman primary-earner  |   .1172166   .1100326     1.07   0.287    -.0984433    .3328765
       Equal-earners  |   -.040778   .1281471    -0.32   0.750    -.2919416    .2103856
                      |
                  sex |   .0858303   .1082764     0.79   0.428    -.1263875    .2980481
                  age |  -.0146881   .0048014    -3.06   0.002    -.0240988   -.0052775
               parent |  -.0649611   .0811498    -0.80   0.423    -.2240119    .0940896
                      |
               employ |
            Parttime  |  -.4628248    .165833    -2.79   0.005    -.7878515   -.1377982
          Unemployed  |   -.260344   .2365238    -1.10   0.271    -.7239221     .203234
             Student  |  -.4275376   .1344085    -3.18   0.001    -.6909734   -.1641018
  Not in labor force  |  -.2127992     .14015    -1.52   0.129    -.4874882    .0618897
                      |
            homemaker |  -.2471658   .1036149    -2.39   0.017    -.4502473   -.0440843
                      |
               degree |
 No formal education  |   .5825895   .4376757     1.33   0.183    -.2752391    1.440418
      Primary school  |  -.1185925   .1854179    -0.64   0.522    -.4820049      .24482
     Lower secondary  |   -.098016   .1406391    -0.70   0.486    -.3736636    .1776315
      Post secondary  |  -.0310045    .161513    -0.19   0.848    -.3475642    .2855552
Lower level tertiary  |   .4517622   .1138274     3.97   0.000     .2286646    .6748598
Upper level tertiary  |   .7347529   .1225016     6.00   0.000     .4946542    .9748516
                      |
                hswrk |  -.0267091    .020901    -1.28   0.201    -.0676742     .014256
              respmom |   .2677258   .1303855     2.05   0.040     .0121748    .5232767
              famlife |  -.2254619   .0443337    -5.09   0.000    -.3123544   -.1385693
             duration |   .2933256   .2154904     1.36   0.173    -.1290279    .7156791
                _cons |  -.1821886    .477801    -0.38   0.703    -1.118661    .7542842
----------------------+----------------------------------------------------------------
Keep_All___Separate   |
                index |   .0383464   .0094518     4.06   0.000     .0198212    .0568715
                      |
                marst |
               Cohab  |   2.054022   .2684409     7.65   0.000     1.527887    2.580156
                      |
        marst#c.index |
               Cohab  |  -.0369372   .0190987    -1.93   0.053    -.0743699    .0004955
                      |
               relinc |
Woman primary-earner  |   .1566402   .1617858     0.97   0.333    -.1604542    .4737346
       Equal-earners  |  -.0710742   .1248615    -0.57   0.569    -.3157982    .1736499
                      |
                  sex |   .1138737   .1063611     1.07   0.284    -.0945902    .3223377
                  age |  -.0057894   .0081346    -0.71   0.477     -.021733    .0101542
               parent |  -.0294559   .1396308    -0.21   0.833    -.3031272    .2442155
                      |
               employ |
            Parttime  |  -.6003112   .1871145    -3.21   0.001    -.9670488   -.2335735
          Unemployed  |   .3156775   .3413628     0.92   0.355    -.3533814    .9847363
             Student  |  -.2011691    .281963    -0.71   0.476    -.7538064    .3514681
  Not in labor force  |   .2091864   .1193832     1.75   0.080    -.0248004    .4431733
                      |
            homemaker |  -.2747155   .1244519    -2.21   0.027    -.5186367   -.0307942
                      |
               degree |
 No formal education  |   .5839181    .316845     1.84   0.065    -.0370868    1.204923
      Primary school  |   .3302295   .2262032     1.46   0.144    -.1131207    .7735797
     Lower secondary  |   .2642577    .189094     1.40   0.162    -.1063596     .634875
      Post secondary  |   .4067366   .1504769     2.70   0.007     .1118072     .701666
Lower level tertiary  |   .5649375   .1292911     4.37   0.000     .3115315    .8183435
Upper level tertiary  |   .6435057   .2188811     2.94   0.003     .2145065    1.072505
                      |
                hswrk |   .0427113   .0311769     1.37   0.171    -.0183943    .1038169
              respmom |  -.0677797   .1716104    -0.39   0.693    -.4041299    .2685704
              famlife |  -.4173445   .0330806   -12.62   0.000    -.4821812   -.3525078
             duration |   .4708376   .1928982     2.44   0.015      .092764    .8489112
                _cons |  -.5258389   .6042744    -0.87   0.384    -1.710195    .6585172
---------------------------------------------------------------------------------------

. margin          i.marst, at(index=(5(2)62)) predict(outcome(3)) post            /* Pool Some    */

Predictive margins                              Number of obs     =      7,118
Model VCE    : Robust

Expression   : Pr(pool==Keep_Some___Separate), predict(outcome(3))

1._at        : index           =           5

2._at        : index           =           7

3._at        : index           =           9

4._at        : index           =          11

5._at        : index           =          13

6._at        : index           =          15

7._at        : index           =          17

8._at        : index           =          19

9._at        : index           =          21

10._at       : index           =          23

11._at       : index           =          25

12._at       : index           =          27

13._at       : index           =          29

14._at       : index           =          31

15._at       : index           =          33

16._at       : index           =          35

17._at       : index           =          37

18._at       : index           =          39

19._at       : index           =          41

20._at       : index           =          43

21._at       : index           =          45

22._at       : index           =          47

23._at       : index           =          49

24._at       : index           =          51

25._at       : index           =          53

26._at       : index           =          55

27._at       : index           =          57

28._at       : index           =          59

29._at       : index           =          61

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   _at#marst |
  1#Married  |   .1496088    .021416     6.99   0.000     .1076343    .1915834
    1#Cohab  |   .3691817   .0330724    11.16   0.000     .3043611    .4340024
  2#Married  |   .1544116    .020249     7.63   0.000     .1147244    .1940989
    2#Cohab  |   .3528826   .0295443    11.94   0.000     .2949769    .4107883
  3#Married  |   .1592075   .0191769     8.30   0.000     .1216214    .1967935
    3#Cohab  |      .3368   .0265381    12.69   0.000     .2847862    .3888138
  4#Married  |   .1639837   .0182593     8.98   0.000     .1281962    .1997712
    4#Cohab  |   .3209656   .0241931    13.27   0.000      .273548    .3683832
  5#Married  |   .1687273   .0175649     9.61   0.000     .1343008    .2031539
    5#Cohab  |   .3054098    .022634    13.49   0.000      .261048    .3497716
  6#Married  |   .1734251   .0171661    10.10   0.000     .1397801    .2070701
    6#Cohab  |   .2901614   .0219268    13.23   0.000     .2471856    .3331372
  7#Married  |   .1780637   .0171277    10.40   0.000     .1444941    .2116334
    7#Cohab  |   .2752473   .0220384    12.49   0.000     .2320529    .3184417
  8#Married  |   .1826299   .0174933    10.44   0.000     .1483436    .2169162
    8#Cohab  |   .2606927   .0228361    11.42   0.000     .2159348    .3054506
  9#Married  |   .1871103   .0182762    10.24   0.000     .1512897    .2229309
    9#Cohab  |   .2465204   .0241332    10.22   0.000     .1992203    .2938206
 10#Married  |    .191492   .0194583     9.84   0.000     .1533544    .2296297
   10#Cohab  |   .2327511   .0257416     9.04   0.000     .1822985    .2832038
 11#Married  |   .1957624   .0209999     9.32   0.000     .1546034    .2369214
   11#Cohab  |   .2194032   .0275033     7.98   0.000     .1654976    .2733088
 12#Married  |   .1999091   .0228505     8.75   0.000      .155123    .2446952
   12#Cohab  |   .2064925   .0292979     7.05   0.000     .1490696    .2639153
 13#Married  |   .2039205   .0249592     8.17   0.000     .1550013    .2528397
   13#Cohab  |   .1940323   .0310384     6.25   0.000     .1331983    .2548664
 14#Married  |   .2077855     .02728     7.62   0.000     .1543176    .2612533
   14#Cohab  |   .1820337   .0326639     5.57   0.000     .1180136    .2460538
 15#Married  |   .2114936   .0297734     7.10   0.000     .1531389    .2698483
   15#Cohab  |    .170505   .0341332     5.00   0.000     .1036051    .2374049
 16#Married  |   .2150354   .0324065     6.64   0.000     .1515199    .2785509
   16#Cohab  |   .1594521    .035419     4.50   0.000     .0900322     .228872
 17#Married  |   .2184021   .0351524     6.21   0.000     .1495047    .2872995
   17#Cohab  |   .1488786   .0365045     4.08   0.000     .0773311    .2204261
 18#Married  |    .221586   .0379889     5.83   0.000     .1471291    .2960429
   18#Cohab  |   .1387857   .0373809     3.71   0.000     .0655204    .2120509
 19#Married  |   .2245803   .0408977     5.49   0.000     .1444223    .3047382
   19#Cohab  |   .1291722   .0380453     3.40   0.001     .0546047    .2037397
 20#Married  |   .2273791   .0438633     5.18   0.000     .1414085    .3133497
   20#Cohab  |   .1200351   .0384995     3.12   0.002     .0445775    .1954928
 21#Married  |   .2299778   .0468729     4.91   0.000     .1381086     .321847
   21#Cohab  |   .1113693   .0387488     2.87   0.004     .0354231    .1873155
 22#Married  |   .2323726   .0499153     4.66   0.000     .1345405    .3302047
   22#Cohab  |   .1031677   .0388012     2.66   0.008     .0271187    .1792167
 23#Married  |   .2345609   .0529808     4.43   0.000     .1307203    .3384014
   23#Cohab  |   .0954217   .0386672     2.47   0.014     .0196353    .1712081
 24#Married  |    .236541   .0560613     4.22   0.000     .1266629    .3464191
   24#Cohab  |   .0881211   .0383587     2.30   0.022     .0129396    .1633027
 25#Married  |   .2383123   .0591492     4.03   0.000      .122382    .3542425
   25#Cohab  |   .0812545   .0378887     2.14   0.032     .0069941     .155515
 26#Married  |    .239875   .0622381     3.85   0.000     .1178907    .3618594
   26#Cohab  |   .0748091   .0372713     2.01   0.045     .0017587    .1478595
 27#Married  |   .2412306    .065322     3.69   0.000     .1132017    .3692594
   27#Cohab  |   .0687713    .036521     1.88   0.060    -.0028086    .1403511
 28#Married  |   .2423809   .0683958     3.54   0.000     .1083275    .3764343
   28#Cohab  |   .0631264   .0356525     1.77   0.077    -.0067513     .133004
 29#Married  |    .243329   .0714547     3.41   0.001     .1032804    .3833777
   29#Cohab  |   .0578592   .0346806     1.67   0.095    -.0101136     .125832
------------------------------------------------------------------------------

. est store       some

. 
. mlogit          pool    c.index##i.marst                i.relinc $ivars                                 , cluster(country)

Iteration 0:   log pseudolikelihood = -8556.7479  
Iteration 1:   log pseudolikelihood = -7735.0391  
Iteration 2:   log pseudolikelihood = -7697.3405  
Iteration 3:   log pseudolikelihood = -7697.0997  
Iteration 4:   log pseudolikelihood = -7697.0997  

Multinomial logistic regression                 Number of obs     =      7,118
                                                Wald chi2(14)     =          .
                                                Prob > chi2       =          .
Log pseudolikelihood = -7697.0997               Pseudo R2         =     0.1005

                                        (Std. Err. adjusted for 18 clusters in country)
---------------------------------------------------------------------------------------
                      |               Robust
                 pool |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
One___Manager         |
                index |   .0369957   .0072533     5.10   0.000     .0227794    .0512119
                      |
                marst |
               Cohab  |   .3238662   .1892723     1.71   0.087    -.0471007    .6948331
                      |
        marst#c.index |
               Cohab  |  -.0014637   .0059418    -0.25   0.805    -.0131094     .010182
                      |
               relinc |
Woman primary-earner  |  -.0376005   .1553309    -0.24   0.809    -.3420436    .2668425
       Equal-earners  |  -.3934708   .2412672    -1.63   0.103    -.8663459    .0794043
                      |
                  sex |  -.0151653   .1901974    -0.08   0.936    -.3879454    .3576147
                  age |  -.0157116   .0052426    -3.00   0.003    -.0259869   -.0054362
               parent |  -.1458508    .132976    -1.10   0.273    -.4064791    .1147774
                      |
               employ |
            Parttime  |   .0892421   .1134232     0.79   0.431    -.1330632    .3115474
          Unemployed  |   .3283832   .2880716     1.14   0.254    -.2362268    .8929932
             Student  |   .4672046   .1516297     3.08   0.002     .1700159    .7643934
  Not in labor force  |  -.3120697    .137943    -2.26   0.024     -.582433   -.0417064
                      |
            homemaker |   .1612918   .1059118     1.52   0.128    -.0462915    .3688751
                      |
               degree |
 No formal education  |   .5814524   .3303552     1.76   0.078    -.0660319    1.228937
      Primary school  |   .5006302   .1831725     2.73   0.006     .1416187    .8596418
     Lower secondary  |  -.0018596   .2060758    -0.01   0.993    -.4057608    .4020416
      Post secondary  |  -.0355375   .2112795    -0.17   0.866    -.4496378    .3785627
Lower level tertiary  |  -.5504526   .2236395    -2.46   0.014    -.9887779   -.1121272
Upper level tertiary  |  -.5760112   .2011366    -2.86   0.004    -.9702318   -.1817907
                      |
                hswrk |  -.1104741   .0346795    -3.19   0.001    -.1784447   -.0425035
              respmom |   .0185601   .0952915     0.19   0.846    -.1682078     .205328
              famlife |  -.2340095   .0870129    -2.69   0.007    -.4045516   -.0634673
             duration |   .3656163   .1581625     2.31   0.021     .0556235    .6756092
                _cons |   .3479376   .7953015     0.44   0.662    -1.210825      1.9067
----------------------+----------------------------------------------------------------
Manage___Together     |  (base outcome)
----------------------+----------------------------------------------------------------
Keep_Some___Separate  |
                index |   .0284576   .0102418     2.78   0.005      .008384    .0485313
                      |
                marst |
               Cohab  |   1.972327   .1857737    10.62   0.000     1.608217    2.336437
                      |
        marst#c.index |
               Cohab  |  -.0597184   .0122828    -4.86   0.000    -.0837923   -.0356445
                      |
               relinc |
Woman primary-earner  |   .1172166   .1100326     1.07   0.287    -.0984433    .3328765
       Equal-earners  |   -.040778   .1281471    -0.32   0.750    -.2919416    .2103856
                      |
                  sex |   .0858303   .1082764     0.79   0.428    -.1263875    .2980481
                  age |  -.0146881   .0048014    -3.06   0.002    -.0240988   -.0052775
               parent |  -.0649611   .0811498    -0.80   0.423    -.2240119    .0940896
                      |
               employ |
            Parttime  |  -.4628248    .165833    -2.79   0.005    -.7878515   -.1377982
          Unemployed  |   -.260344   .2365238    -1.10   0.271    -.7239221     .203234
             Student  |  -.4275376   .1344085    -3.18   0.001    -.6909734   -.1641018
  Not in labor force  |  -.2127992     .14015    -1.52   0.129    -.4874882    .0618897
                      |
            homemaker |  -.2471658   .1036149    -2.39   0.017    -.4502473   -.0440843
                      |
               degree |
 No formal education  |   .5825895   .4376757     1.33   0.183    -.2752391    1.440418
      Primary school  |  -.1185925   .1854179    -0.64   0.522    -.4820049      .24482
     Lower secondary  |   -.098016   .1406391    -0.70   0.486    -.3736636    .1776315
      Post secondary  |  -.0310045    .161513    -0.19   0.848    -.3475642    .2855552
Lower level tertiary  |   .4517622   .1138274     3.97   0.000     .2286646    .6748598
Upper level tertiary  |   .7347529   .1225016     6.00   0.000     .4946542    .9748516
                      |
                hswrk |  -.0267091    .020901    -1.28   0.201    -.0676742     .014256
              respmom |   .2677258   .1303855     2.05   0.040     .0121748    .5232767
              famlife |  -.2254619   .0443337    -5.09   0.000    -.3123544   -.1385693
             duration |   .2933256   .2154904     1.36   0.173    -.1290279    .7156791
                _cons |  -.1821886    .477801    -0.38   0.703    -1.118661    .7542842
----------------------+----------------------------------------------------------------
Keep_All___Separate   |
                index |   .0383464   .0094518     4.06   0.000     .0198212    .0568715
                      |
                marst |
               Cohab  |   2.054022   .2684409     7.65   0.000     1.527887    2.580156
                      |
        marst#c.index |
               Cohab  |  -.0369372   .0190987    -1.93   0.053    -.0743699    .0004955
                      |
               relinc |
Woman primary-earner  |   .1566402   .1617858     0.97   0.333    -.1604542    .4737346
       Equal-earners  |  -.0710742   .1248615    -0.57   0.569    -.3157982    .1736499
                      |
                  sex |   .1138737   .1063611     1.07   0.284    -.0945902    .3223377
                  age |  -.0057894   .0081346    -0.71   0.477     -.021733    .0101542
               parent |  -.0294559   .1396308    -0.21   0.833    -.3031272    .2442155
                      |
               employ |
            Parttime  |  -.6003112   .1871145    -3.21   0.001    -.9670488   -.2335735
          Unemployed  |   .3156775   .3413628     0.92   0.355    -.3533814    .9847363
             Student  |  -.2011691    .281963    -0.71   0.476    -.7538064    .3514681
  Not in labor force  |   .2091864   .1193832     1.75   0.080    -.0248004    .4431733
                      |
            homemaker |  -.2747155   .1244519    -2.21   0.027    -.5186367   -.0307942
                      |
               degree |
 No formal education  |   .5839181    .316845     1.84   0.065    -.0370868    1.204923
      Primary school  |   .3302295   .2262032     1.46   0.144    -.1131207    .7735797
     Lower secondary  |   .2642577    .189094     1.40   0.162    -.1063596     .634875
      Post secondary  |   .4067366   .1504769     2.70   0.007     .1118072     .701666
Lower level tertiary  |   .5649375   .1292911     4.37   0.000     .3115315    .8183435
Upper level tertiary  |   .6435057   .2188811     2.94   0.003     .2145065    1.072505
                      |
                hswrk |   .0427113   .0311769     1.37   0.171    -.0183943    .1038169
              respmom |  -.0677797   .1716104    -0.39   0.693    -.4041299    .2685704
              famlife |  -.4173445   .0330806   -12.62   0.000    -.4821812   -.3525078
             duration |   .4708376   .1928982     2.44   0.015      .092764    .8489112
                _cons |  -.5258389   .6042744    -0.87   0.384    -1.710195    .6585172
---------------------------------------------------------------------------------------

. margin          i.marst, at(index=(5(2)62)) predict(outcome(4)) post            /* Keep Sep             */

Predictive margins                              Number of obs     =      7,118
Model VCE    : Robust

Expression   : Pr(pool==Keep_All___Separate), predict(outcome(4))

1._at        : index           =           5

2._at        : index           =           7

3._at        : index           =           9

4._at        : index           =          11

5._at        : index           =          13

6._at        : index           =          15

7._at        : index           =          17

8._at        : index           =          19

9._at        : index           =          21

10._at       : index           =          23

11._at       : index           =          25

12._at       : index           =          27

13._at       : index           =          29

14._at       : index           =          31

15._at       : index           =          33

16._at       : index           =          35

17._at       : index           =          37

18._at       : index           =          39

19._at       : index           =          41

20._at       : index           =          43

21._at       : index           =          45

22._at       : index           =          47

23._at       : index           =          49

24._at       : index           =          51

25._at       : index           =          53

26._at       : index           =          55

27._at       : index           =          57

28._at       : index           =          59

29._at       : index           =          61

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   _at#marst |
  1#Married  |   .0686288   .0150355     4.56   0.000     .0391598    .0980978
    1#Cohab  |   .2062846   .0301311     6.85   0.000     .1472287    .2653404
  2#Married  |   .0722117   .0148912     4.85   0.000     .0430255    .1013979
    2#Cohab  |   .2101009   .0276492     7.60   0.000     .1559094    .2642924
  3#Married  |   .0759041   .0147232     5.16   0.000     .0470472    .1047611
    3#Cohab  |   .2136714   .0256923     8.32   0.000     .1633155    .2640273
  4#Married  |   .0797027    .014538     5.48   0.000     .0512089    .1081966
    4#Cohab  |   .2169783   .0245655     8.83   0.000     .1688308    .2651258
  5#Married  |   .0836036   .0143437     5.83   0.000     .0554904    .1117167
    5#Cohab  |   .2200049   .0245662     8.96   0.000     .1718561    .2681537
  6#Married  |   .0876021   .0141507     6.19   0.000     .0598673    .1153369
    6#Cohab  |   .2227358   .0258667     8.61   0.000      .172038    .2734337
  7#Married  |   .0916934   .0139712     6.56   0.000     .0643103    .1190766
    7#Cohab  |    .225157   .0284418     7.92   0.000     .1694121    .2809019
  8#Married  |    .095872   .0138199     6.94   0.000     .0687855    .1229584
    8#Cohab  |   .2272558   .0321146     7.08   0.000     .1643122    .2901993
  9#Married  |   .1001317   .0137131     7.30   0.000     .0732545    .1270089
    9#Cohab  |   .2290212    .036661     6.25   0.000      .157167    .3008754
 10#Married  |   .1044662   .0136689     7.64   0.000     .0776757    .1312567
   10#Cohab  |   .2304441    .041879     5.50   0.000     .1483627    .3125254
 11#Married  |   .1088687    .013706     7.94   0.000     .0820055     .135732
   11#Cohab  |   .2315169   .0476095     4.86   0.000      .138204    .3248298
 12#Married  |    .113332   .0138429     8.19   0.000     .0862004    .1404637
   12#Cohab  |   .2322342   .0537315     4.32   0.000     .1269224     .337546
 13#Married  |   .1178487   .0140966     8.36   0.000       .09022    .1454775
   13#Cohab  |   .2325923    .060152     3.87   0.000     .1146964    .3504881
 14#Married  |   .1224112   .0144808     8.45   0.000     .0940293     .150793
   14#Cohab  |   .2325895   .0667969     3.48   0.000     .1016699     .363509
 15#Married  |   .1270115   .0150057     8.46   0.000     .0976009    .1564221
   15#Cohab  |    .232226   .0736044     3.16   0.002     .0879641     .376488
 16#Married  |   .1316418   .0156769     8.40   0.000     .1009158    .1623679
   16#Cohab  |   .2315043   .0805209     2.88   0.004     .0736862    .3893223
 17#Married  |   .1362942   .0164956     8.26   0.000     .1039633    .1686251
   17#Cohab  |   .2304282   .0874983     2.63   0.008     .0589348    .4019217
 18#Married  |   .1409607   .0174598     8.07   0.000     .1067401    .1751813
   18#Cohab  |    .229004   .0944921     2.42   0.015     .0438029    .4142051
 19#Married  |   .1456335   .0185643     7.84   0.000      .109248    .1820189
   19#Cohab  |   .2272392   .1014607     2.24   0.025     .0283799    .4260986
 20#Married  |   .1503048   .0198025     7.59   0.000     .1114925    .1891171
   20#Cohab  |   .2251436   .1083646     2.08   0.038     .0127528    .4375344
 21#Married  |   .1549673   .0211668     7.32   0.000     .1134811    .1964536
   21#Cohab  |   .2227281    .115166     1.93   0.053    -.0029931    .4484494
 22#Married  |   .1596137   .0226494     7.05   0.000     .1152217    .2040057
   22#Cohab  |   .2200055   .1218288     1.81   0.071    -.0187746    .4587856
 23#Married  |   .1642371   .0242427     6.77   0.000     .1167223    .2117519
   23#Cohab  |   .2169896   .1283185     1.69   0.091      -.03451    .4684893
 24#Married  |   .1688309   .0259396     6.51   0.000     .1179903    .2196716
   24#Cohab  |   .2136958   .1346023     1.59   0.112    -.0501199    .4775115
 25#Married  |   .1733891   .0277337     6.25   0.000     .1190321     .227746
   25#Cohab  |   .2101403   .1406492     1.49   0.135    -.0655271    .4858078
 26#Married  |   .1779057   .0296192     6.01   0.000     .1198532    .2359582
   26#Cohab  |   .2063405   .1464301     1.41   0.159    -.0806573    .4933383
 27#Married  |   .1823755   .0315909     5.77   0.000     .1204584    .2442926
   27#Cohab  |   .2023144   .1519179     1.33   0.183    -.0954392     .500068
 28#Married  |   .1867937   .0336446     5.55   0.000     .1208516    .2527359
   28#Cohab  |   .1980808   .1570876     1.26   0.207    -.1098052    .5059669
 29#Married  |   .1911559   .0357761     5.34   0.000      .121036    .2612757
   29#Cohab  |    .193659   .1619167     1.20   0.232    -.1236919    .5110098
------------------------------------------------------------------------------

. est store       sep

. 
. est table oneman equal some sep 

------------------------------------------------------------------
    Variable |   oneman       equal         some         sep      
-------------+----------------------------------------------------
   _at#marst |
  1#Married  |  .13482036    .64694198    .14960882    .06862883  
    1#Cohab  |  .09651257    .32802113    .36918174    .20628456  
  2#Married  |  .14145956    .63191712    .15441162     .0722117  
    2#Cohab  |  .10458343    .33243306    .35288261    .21010091  
  3#Married  |  .14826902    .61661937    .15920749    .07590413  
    3#Cohab  |  .11313758    .33639106    .33679998    .21367138  
  4#Married  |  .15523969    .60107386    .16398373    .07970272  
    4#Cohab  |  .12218297    .33987317    .32096559    .21697827  
  5#Married  |  .16236148    .58530762    .16872735    .08360355  
    5#Cohab  |  .13172559    .34285971    .30540979    .22000491  
  6#Married  |  .16962333    .56934942    .17342512    .08760213  
    6#Cohab  |  .14176927    .34533352    .29016137    .22273584  
  7#Married  |  .17701324    .55322958    .17806374    .09169344  
    7#Cohab  |  .15231554    .34728014    .27524733    .22515699  
  8#Married  |  .18451838    .53697979    .18262987    .09587196  
    8#Cohab  |  .16336357    .34868796    .26069271    .22725576  
  9#Married  |  .19212517    .52063284     .1871103    .10013169  
    9#Cohab  |  .17491004    .34954833    .24652042     .2290212  
 10#Married  |  .19981934    .50422242    .19149203    .10446621  
   10#Cohab  |  .18694912    .34985567    .23275115    .23044406  
 11#Married  |  .20758609    .48778282    .19576239     .1088687  
   11#Cohab  |  .19947236    .34960753     .2194032    .23151691  
 12#Married  |  .21541018    .47134869    .19990912    .11333202  
   12#Cohab  |  .21246875    .34880461    .20649245    .23223419  
 13#Married  |  .22327606    .45495472     .2039205    .11784872  
   13#Cohab  |  .22592469    .34745072    .19403232    .23259227  
 14#Married  |  .23116798    .43863541    .20778545    .12241115  
   14#Cohab  |  .23982403    .34555281     .1820337    .23258946  
 15#Married  |  .23907015    .42242474    .21149361     .1270115  
   15#Cohab  |  .25414816     .3431208    .17050499    .23222605  
 16#Married  |  .24696684    .40635593     .2150354    .13164183  
   16#Cohab  |  .26887609    .34016754    .15945212    .23150426  
 17#Married  |  .25484252    .39046115    .21840213     .1362942  
   17#Cohab  |  .28398453    .33670863    .14887861    .23042823  
 18#Married  |    .262682    .37477129    .22158601    .14096069  
   18#Cohab  |  .29944809    .33276229    .13878566    .22900395  
 19#Married  |  .27047052    .35931575    .22458027    .14563346  
   19#Cohab  |   .3152394    .32834914    .12917222    .22723924  
 20#Married  |  .27819386    .34412221    .22737912    .15030482  
   20#Cohab  |  .33132927    .32349199    .12003514    .22514359  
 21#Married  |  .28583845    .32921644     .2299778    .15496731  
   21#Cohab  |  .34768694    .31821564    .11136929    .22272813  
 22#Married  |  .29339148    .31462221    .23237261     .1596137  
   22#Cohab  |  .36428023    .31254661    .10316769    .22000548  
 23#Married  |  .30084092    .30036109    .23456089     .1642371  
   23#Cohab  |   .3810758    .30651288     .0954217    .21698961  
 24#Married  |  .30817565    .28645243    .23654099    .16883094  
   24#Cohab  |  .39803938    .30014369    .08812115    .21369578  
 25#Married  |  .31538545    .27291323    .23831227    .17338905  
   25#Cohab  |  .41513596     .2934692    .08125452    .21014031  
 26#Married  |  .32246107    .25975819    .23987505    .17790569  
   26#Cohab  |  .43233009    .28652029    .07480913     .2063405  
 27#Married  |  .32939427    .24699964    .24123056    .18237553  
   27#Cohab  |  .44958606    .27932825    .06877127    .20231442  
 28#Married  |  .33617778    .23464757    .24238093    .18679372  
   28#Cohab  |  .46686821    .27192459    .06312637    .19808083  
 29#Married  |  .34280534    .22270973    .24332905    .19115588  
   29#Cohab  |  .48414108    .26434075    .05785922    .19365896  
------------------------------------------------------------------

. **********************************************************************************************************************
. *Appendix Table B
. **********************************************************************************************************************
. // Dual-earners
. preserve

. drop if dualearn==2 /* Drops 1,353 respondents */
(965 observations deleted)

. count
  6,153

. global  ivars "sex age parent i.employ homemaker ib4.degree hswrk respmom famlife duration"

. 
. mlogit          pool    index i.relinc          i.marst         $ivars                                  , cluster(country) rrr

Iteration 0:   log pseudolikelihood = -7314.1239  
Iteration 1:   log pseudolikelihood = -6741.7963  
Iteration 2:   log pseudolikelihood = -6710.8954  
Iteration 3:   log pseudolikelihood = -6710.5274  
Iteration 4:   log pseudolikelihood = -6710.5272  

Multinomial logistic regression                 Number of obs     =      6,153
                                                Wald chi2(14)     =          .
                                                Prob > chi2       =          .
Log pseudolikelihood = -6710.5272               Pseudo R2         =     0.0825

                                        (Std. Err. adjusted for 18 clusters in country)
---------------------------------------------------------------------------------------
                      |               Robust
                 pool |        RRR   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
One___Manager         |
                index |   1.033985   .0067726     5.10   0.000     1.020796    1.047345
                      |
               relinc |
Woman primary-earner  |   .9036026   .1437463    -0.64   0.524     .6615569    1.234206
       Equal-earners  |   .7654305   .1561189    -1.31   0.190     .5132073    1.141612
                      |
                marst |
               Cohab  |   1.487548   .2318861     2.55   0.011     1.095927    2.019112
                  sex |   1.001263   .1868563     0.01   0.995     .6945382    1.443444
                  age |   .9799336   .0056959    -3.49   0.000     .9688331    .9911613
               parent |   .8641927   .1154734    -1.09   0.275     .6650788    1.122918
                      |
               employ |
            Parttime  |   1.128988   .1969818     0.70   0.487     .8020012    1.589293
          Unemployed  |    1.44331   .5440757     0.97   0.330     .6894256    3.021564
             Student  |   1.389455   .2559045     1.79   0.074     .9684417    1.993497
  Not in labor force  |   .7588329    .133474    -1.57   0.117     .5375577    1.071192
                      |
            homemaker |   1.174553   .1493208     1.27   0.206     .9155026    1.506905
                      |
               degree |
 No formal education  |   2.237938   .7913363     2.28   0.023     1.119084    4.475416
      Primary school  |   1.532731   .2791134     2.35   0.019     1.072656    2.190138
     Lower secondary  |   .8856455   .1809261    -0.59   0.552      .593431    1.321751
      Post secondary  |   1.030666    .257486     0.12   0.904      .631636     1.68178
Lower level tertiary  |   .6037748   .1504379    -2.03   0.043     .3704995    .9839257
Upper level tertiary  |   .5691637   .1259987    -2.55   0.011     .3688097     .878359
                      |
                hswrk |   .9220988   .0315427    -2.37   0.018     .8623031    .9860409
              respmom |   1.071918   .1377717     0.54   0.589     .8332171    1.379002
              famlife |   .7453905   .0606288    -3.61   0.000     .6355484    .8742168
             duration |   1.242898   .2215907     1.22   0.223     .8763522    1.762757
                _cons |    2.07613   1.661001     0.91   0.361     .4327664    9.959915
----------------------+----------------------------------------------------------------
Manage___Together     |  (base outcome)
----------------------+----------------------------------------------------------------
Keep_Some___Separate  |
                index |   1.012417   .0118278     1.06   0.291      .989498    1.035866
                      |
               relinc |
Woman primary-earner  |   1.111101    .133627     0.88   0.381     .8777757    1.406448
       Equal-earners  |   .9119217   .1179987    -0.71   0.476     .7076456    1.175166
                      |
                marst |
               Cohab  |    3.19751   .5332845     6.97   0.000     2.305938    4.433803
                  sex |   1.068118   .1095757     0.64   0.521      .873568    1.305997
                  age |   .9853984   .0039148    -3.70   0.000     .9777553    .9931012
               parent |   .9101358   .0717926    -1.19   0.233     .7797625    1.062307
                      |
               employ |
            Parttime  |   .7102616   .1025883    -2.37   0.018     .5351468    .9426786
          Unemployed  |   .8607664   .2233784    -0.58   0.563     .5175938    1.431468
             Student  |   .7136888   .1137477    -2.12   0.034     .5222091    .9753788
  Not in labor force  |   .8110586   .1226752    -1.38   0.166     .6029834    1.090936
                      |
            homemaker |   .7693176   .0830469    -2.43   0.015     .6226148    .9505871
                      |
               degree |
 No formal education  |    1.25113   .6150041     0.46   0.649     .4774044    3.278824
      Primary school  |   .7306296   .1474727    -1.55   0.120     .4919125    1.085192
     Lower secondary  |    .872399   .1241831    -0.96   0.338     .6600084    1.153137
      Post secondary  |   .9430931    .149024    -0.37   0.711      .691912    1.285459
Lower level tertiary  |    1.52422    .151086     4.25   0.000     1.255087    1.851066
Upper level tertiary  |   1.992821   .2267468     6.06   0.000     1.594473     2.49069
                      |
                hswrk |   .9665689    .020041    -1.64   0.101     .9280767    1.006658
              respmom |   1.280949   .1710814     1.85   0.064     .9859316    1.664244
              famlife |   .7786063   .0355082    -5.49   0.000     .7120312    .8514061
             duration |   1.394849   .3289509     1.41   0.158     .8785896    2.214462
                _cons |    1.47752   .6611795     0.87   0.383     .6146484    3.551729
----------------------+----------------------------------------------------------------
Keep_All___Separate   |
                index |   1.026382   .0110993     2.41   0.016     1.004857    1.048369
                      |
               relinc |
Woman primary-earner  |   1.191756   .1961557     1.07   0.287     .8631474     1.64547
       Equal-earners  |    .894863    .112681    -0.88   0.378     .6991549    1.145354
                      |
                marst |
               Cohab  |   4.328661   .8400125     7.55   0.000     2.959177    6.331933
                  sex |   1.095265   .1209986     0.82   0.410     .8820303    1.360051
                  age |   .9956428   .0079657    -0.55   0.585     .9801521    1.011378
               parent |   1.006387    .137269     0.05   0.963     .7703051    1.314822
                      |
               employ |
            Parttime  |   .6198862    .105178    -2.82   0.005     .4445146    .8644462
          Unemployed  |   1.560415   .4971253     1.40   0.163      .835718    2.913536
             Student  |   .9785593    .299553    -0.07   0.944     .5370571     1.78301
  Not in labor force  |   1.279406   .1588487     1.98   0.047     1.003055    1.631894
                      |
            homemaker |   .7206421   .0904046    -2.61   0.009     .5635551    .9215161
                      |
               degree |
 No formal education  |   1.762747    .745066     1.34   0.180     .7698563    4.036176
      Primary school  |   1.379996   .3782215     1.18   0.240     .8064646    2.361404
     Lower secondary  |   1.324686    .274717     1.36   0.175     .8822435    1.989012
      Post secondary  |   1.530617   .2350094     2.77   0.006     1.132854    2.068041
Lower level tertiary  |   1.728132   .2161298     4.37   0.000     1.352449    2.208172
Upper level tertiary  |   1.818874   .4064816     2.68   0.007     1.173751    2.818571
                      |
                hswrk |   1.024919   .0276365     0.91   0.361     .9721589    1.080542
              respmom |   .9315837   .1691759    -0.39   0.696     .6525946    1.329843
              famlife |   .6542631   .0186228   -14.90   0.000     .6187625    .6918004
             duration |    1.70821    .295052     3.10   0.002     1.217634    2.396436
                _cons |   .7793482   .4516168    -0.43   0.667     .2503094    2.426531
---------------------------------------------------------------------------------------
Note: _cons estimates baseline relative risk for each outcome.

. estat           ic

Akaike's information criterion and Bayesian information criterion

-----------------------------------------------------------------------------
       Model |        Obs  ll(null)  ll(model)      df         AIC        BIC
-------------+---------------------------------------------------------------
           . |      6,153 -7314.124  -6710.527      17    13455.05   13569.37
-----------------------------------------------------------------------------
               Note: N=Obs used in calculating BIC; see [R] BIC note.

. mlogit          pool    c.index##i.relinc       i.marst         $ivars                                  , cluster(country) rrr

Iteration 0:   log pseudolikelihood = -7314.1239  
Iteration 1:   log pseudolikelihood = -6739.7115  
Iteration 2:   log pseudolikelihood = -6704.7891  
Iteration 3:   log pseudolikelihood = -6704.0978  
Iteration 4:   log pseudolikelihood = -6704.0971  
Iteration 5:   log pseudolikelihood = -6704.0971  

Multinomial logistic regression                 Number of obs     =      6,153
                                                Wald chi2(14)     =          .
                                                Prob > chi2       =          .
Log pseudolikelihood = -6704.0971               Pseudo R2         =     0.0834

                                        (Std. Err. adjusted for 18 clusters in country)
---------------------------------------------------------------------------------------
                      |               Robust
                 pool |        RRR   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
One___Manager         |
                index |   1.039555    .007994     5.04   0.000     1.024005    1.055342
                      |
               relinc |
Woman primary-earner  |   1.044588   .2000024     0.23   0.820     .7177435    1.520269
       Equal-earners  |   1.102402   .2919233     0.37   0.713     .6560492    1.852439
                      |
       relinc#c.index |
Woman primary-earner  |   .9923282   .0108296    -0.71   0.480     .9713279    1.013783
       Equal-earners  |   .9791565   .0079453    -2.60   0.009      .963707    .9948535
                      |
                marst |
               Cohab  |   1.488304   .2349589     2.52   0.012     1.092225    2.028014
                  sex |   1.005997   .1871218     0.03   0.974     .6986628    1.448523
                  age |   .9802275   .0057455    -3.41   0.001     .9690309    .9915534
               parent |   .8742832   .1190821    -0.99   0.324     .6694434    1.141801
                      |
               employ |
            Parttime  |   1.148781   .1991449     0.80   0.424     .8178591    1.613599
          Unemployed  |   1.452462   .5469911     0.99   0.322     .6942976    3.038531
             Student  |   1.374227   .2518426     1.73   0.083     .9595464    1.968116
  Not in labor force  |   .7507382   .1327672    -1.62   0.105     .5308288    1.061751
                      |
            homemaker |   1.179565   .1491093     1.31   0.191      .920706    1.511202
                      |
               degree |
 No formal education  |    2.11662   .7485134     2.12   0.034     1.058345      4.2331
      Primary school  |   1.532405   .2813131     2.33   0.020     1.069334    2.196008
     Lower secondary  |   .8870164   .1817454    -0.59   0.558     .5936419    1.325375
      Post secondary  |   1.037006   .2565135     0.15   0.883     .6385987    1.683969
Lower level tertiary  |   .6040691   .1509304    -2.02   0.044     .3701764     .985745
Upper level tertiary  |   .5687884    .125697    -2.55   0.011     .3688443    .8771187
                      |
                hswrk |   .9216779   .0315198    -2.38   0.017     .8619252     .985573
              respmom |   1.073997   .1378555     0.56   0.578     .8351129    1.381215
              famlife |   .7455349   .0601754    -3.64   0.000     .6364492    .8733176
             duration |   1.238723   .2271328     1.17   0.243     .8647641    1.774398
                _cons |   1.816678   1.452247     0.75   0.455     .3791666    8.704143
----------------------+----------------------------------------------------------------
Manage___Together     |  (base outcome)
----------------------+----------------------------------------------------------------
Keep_Some___Separate  |
                index |   1.015759    .013957     1.14   0.255     .9887693    1.043486
                      |
               relinc |
Woman primary-earner  |   1.078577   .1835593     0.44   0.657     .7726595    1.505616
       Equal-earners  |   1.171152   .2965985     0.62   0.533     .7129244    1.923903
                      |
       relinc#c.index |
Woman primary-earner  |   1.001735   .0086299     0.20   0.841      .984963    1.018793
       Equal-earners  |   .9816307   .0168321    -1.08   0.280     .9491886    1.015182
                      |
                marst |
               Cohab  |   3.203679   .5309674     7.02   0.000     2.315121    4.433272
                  sex |   1.071949    .108064     0.69   0.491     .8797594    1.306124
                  age |   .9854712   .0039796    -3.62   0.000     .9777021     .993302
               parent |   .9134464   .0738648    -1.12   0.263     .7795637    1.070322
                      |
               employ |
            Parttime  |   .7130419   .1061341    -2.27   0.023     .5326186    .9545833
          Unemployed  |   .8595071   .2239297    -0.58   0.561     .5158027    1.432238
             Student  |   .7044189   .1095591    -2.25   0.024      .519329    .9554753
  Not in labor force  |   .8037559   .1211411    -1.45   0.147     .5981802    1.079981
                      |
            homemaker |   .7686481   .0826278    -2.45   0.014     .6226234    .9489201
                      |
               degree |
 No formal education  |   1.155664   .5409473     0.31   0.757     .4617406    2.892445
      Primary school  |   .7231715   .1469733    -1.59   0.111     .4855655    1.077047
     Lower secondary  |     .87185   .1240046    -0.96   0.335     .6597418    1.152151
      Post secondary  |   .9460925   .1491395    -0.35   0.725     .6946283     1.28859
Lower level tertiary  |   1.521379   .1509382     4.23   0.000     1.252531    1.847934
Upper level tertiary  |   1.991556   .2259213     6.07   0.000      1.59453     2.48744
                      |
                hswrk |   .9664502   .0202775    -1.63   0.104     .9275131    1.007022
              respmom |   1.283734   .1717612     1.87   0.062     .9876111    1.668646
              famlife |   .7792187   .0358418    -5.42   0.000     .7120436    .8527312
             duration |   1.386632   .3198151     1.42   0.156     .8823451    2.179133
                _cons |   1.399614   .6683045     0.70   0.481      .548992    3.568209
----------------------+----------------------------------------------------------------
Keep_All___Separate   |
                index |   1.029088   .0126506     2.33   0.020     1.004589    1.054183
                      |
               relinc |
Woman primary-earner  |   1.307725   .2972054     1.18   0.238     .8376539    2.041588
       Equal-earners  |    .947116   .1734534    -0.30   0.767      .661478    1.356098
                      |
       relinc#c.index |
Woman primary-earner  |    .993776   .0083268    -0.75   0.456      .977589    1.010231
       Equal-earners  |   .9947801   .0088622    -0.59   0.557     .9775612    1.012302
                      |
                marst |
               Cohab  |   4.309931   .8471314     7.43   0.000     2.931999     6.33544
                  sex |   1.097609   .1188395     0.86   0.390     .8877424    1.357089
                  age |    .995827   .0079005    -0.53   0.598      .980462    1.011433
               parent |   1.007595   .1367601     0.06   0.956     .7722416    1.314677
                      |
               employ |
            Parttime  |   .6239777   .1089734    -2.70   0.007      .443111    .8786696
          Unemployed  |   1.559391   .4975832     1.39   0.164     .8343467    2.914495
             Student  |   .9760717   .2953018    -0.08   0.936     .5394588    1.766059
  Not in labor force  |   1.278304   .1615715     1.94   0.052     .9978061    1.637653
                      |
            homemaker |   .7216666   .0905472    -2.60   0.009     .5643347    .9228614
                      |
               degree |
 No formal education  |    1.76867   .7536533     1.34   0.181     .7672531    4.077133
      Primary school  |   1.369656   .3808347     1.13   0.258     .7942073    2.362051
     Lower secondary  |   1.321553    .271765     1.36   0.175     .8831674    1.977544
      Post secondary  |   1.529038   .2350004     2.76   0.006     1.131346    2.066526
Lower level tertiary  |   1.728086   .2171794     4.35   0.000     1.350795    2.210757
Upper level tertiary  |   1.813447   .4000367     2.70   0.007     1.176886    2.794315
                      |
                hswrk |   1.025231   .0275726     0.93   0.354     .9725896    1.080722
              respmom |   .9321152   .1698721    -0.39   0.700      .652144    1.332281
              famlife |   .6546919   .0185498   -14.95   0.000     .6193261    .6920773
             duration |   1.716916   .2871519     3.23   0.001     1.237049    2.382931
                _cons |   .7361239     .42382    -0.53   0.595     .2381637    2.275235
---------------------------------------------------------------------------------------
Note: _cons estimates baseline relative risk for each outcome.

. estat           ic

Akaike's information criterion and Bayesian information criterion

-----------------------------------------------------------------------------
       Model |        Obs  ll(null)  ll(model)      df         AIC        BIC
-------------+---------------------------------------------------------------
           . |      6,153 -7314.124  -6704.097      17    13442.19   13556.51
-----------------------------------------------------------------------------
               Note: N=Obs used in calculating BIC; see [R] BIC note.

. mlogit          pool    c.index##i.marst        i.relinc        $ivars                                  , cluster(country) rrr

Iteration 0:   log pseudolikelihood = -7314.1239  
Iteration 1:   log pseudolikelihood = -6709.5022  
Iteration 2:   log pseudolikelihood = -6677.1954  
Iteration 3:   log pseudolikelihood =  -6676.657  
Iteration 4:   log pseudolikelihood = -6676.6563  
Iteration 5:   log pseudolikelihood = -6676.6563  

Multinomial logistic regression                 Number of obs     =      6,153
                                                Wald chi2(14)     =          .
                                                Prob > chi2       =          .
Log pseudolikelihood = -6676.6563               Pseudo R2         =     0.0872

                                        (Std. Err. adjusted for 18 clusters in country)
---------------------------------------------------------------------------------------
                      |               Robust
                 pool |        RRR   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
One___Manager         |
                index |   1.032913   .0070577     4.74   0.000     1.019172    1.046839
                      |
                marst |
               Cohab  |   1.097785   .2265451     0.45   0.651     .7325855    1.645038
                      |
        marst#c.index |
               Cohab  |   1.005624   .0062294     0.91   0.365     .9934882    1.017907
                      |
               relinc |
Woman primary-earner  |   .9125921   .1440508    -0.58   0.562     .6697555    1.243475
       Equal-earners  |    .763685   .1566617    -1.31   0.189     .5108572     1.14164
                      |
                  sex |   1.001545   .1851185     0.01   0.993     .6971725      1.4388
                  age |   .9792728   .0056541    -3.63   0.000     .9682535    .9904176
               parent |   .8539572   .1132535    -1.19   0.234     .6584883     1.10745
                      |
               employ |
            Parttime  |   1.137374   .1985556     0.74   0.461     .8078043    1.601404
          Unemployed  |   1.451821   .5582614     0.97   0.332     .6832898     3.08476
             Student  |   1.389628   .2529394     1.81   0.071     .9726649    1.985335
  Not in labor force  |   .7650834   .1331339    -1.54   0.124      .543988     1.07604
                      |
            homemaker |   1.164084   .1470384     1.20   0.229     .9087966    1.491082
                      |
               degree |
 No formal education  |   2.229092   .8017372     2.23   0.026      1.10148     4.51107
      Primary school  |   1.525258   .2772119     2.32   0.020     1.068168    2.177946
     Lower secondary  |   .8869193   .1822696    -0.58   0.559     .5928637    1.326824
      Post secondary  |   1.028183   .2534892     0.11   0.910     .6341831    1.666965
Lower level tertiary  |    .599966   .1483967    -2.07   0.039     .3694782    .9742366
Upper level tertiary  |   .5639743   .1243435    -2.60   0.009     .3660907    .8688202
                      |
                hswrk |   .9220626   .0312174    -2.40   0.017     .8628634    .9853232
              respmom |   1.072799    .135453     0.56   0.578     .8376156    1.374018
              famlife |   .7391578   .0579817    -3.85   0.000     .6338206    .8620013
             duration |   1.322936   .2448363     1.51   0.130     .9204633    1.901389
                _cons |   2.254421   1.753649     1.05   0.296     .4908059    10.35524
----------------------+----------------------------------------------------------------
Manage___Together     |  (base outcome)
----------------------+----------------------------------------------------------------
Keep_Some___Separate  |
                index |    1.02246   .0108131     2.10   0.036     1.001484    1.043874
                      |
                marst |
               Cohab  |   6.621817   1.123448    11.14   0.000     4.748577    9.234021
                      |
        marst#c.index |
               Cohab  |   .9465264   .0096799    -5.37   0.000     .9277429    .9656901
                      |
               relinc |
Woman primary-earner  |   1.103524   .1355782     0.80   0.423     .8673689    1.403976
       Equal-earners  |   .9114847   .1179875    -0.72   0.474     .7072375    1.174718
                      |
                  sex |   1.060993   .1085634     0.58   0.563     .8681913    1.296611
                  age |   .9860396   .0041743    -3.32   0.001      .977892     .994255
               parent |   .9310524   .0765206    -0.87   0.385      .792531    1.093785
                      |
               employ |
            Parttime  |    .690279   .0999295    -2.56   0.010     .5197553    .9167489
          Unemployed  |   .8406537   .2229766    -0.65   0.513     .4998536    1.413811
             Student  |   .6917608    .108689    -2.35   0.019     .5084119     .941231
  Not in labor force  |   .8024874    .123447    -1.43   0.153     .5936049    1.084873
                      |
            homemaker |   .7777114   .0829903    -2.36   0.018     .6309369    .9586299
                      |
               degree |
 No formal education  |    1.41247   .6823227     0.71   0.475     .5480102    3.640572
      Primary school  |   .7933288   .1696174    -1.08   0.279       .52175    1.206269
     Lower secondary  |   .8657248   .1209258    -1.03   0.302     .6583891    1.138353
      Post secondary  |   .9375735   .1523197    -0.40   0.692     .6818954    1.289119
Lower level tertiary  |   1.534569   .1533739     4.28   0.000     1.261572     1.86664
Upper level tertiary  |   2.020049   .2324659     6.11   0.000     1.612152    2.531148
                      |
                hswrk |   .9632387   .0200614    -1.80   0.072     .9247108    1.003372
              respmom |   1.282724   .1684197     1.90   0.058     .9916802    1.659184
              famlife |   .7873718   .0378789    -4.97   0.000     .7165231     .865226
             duration |   1.354009    .293771     1.40   0.162     .8849963    2.071579
                _cons |   1.176624   .5477138     0.35   0.727     .4725057    2.930007
----------------------+----------------------------------------------------------------
Keep_All___Separate   |
                index |   1.033265   .0099308     3.40   0.001     1.013984    1.052914
                      |
                marst |
               Cohab  |   7.198828   1.733902     8.20   0.000     4.489958    11.54201
                      |
        marst#c.index |
               Cohab  |   .9681879   .0170102    -1.84   0.066      .935416    1.002108
                      |
               relinc |
Woman primary-earner  |   1.180924   .1981695     0.99   0.322     .8499289     1.64082
       Equal-earners  |   .8958161   .1143293    -0.86   0.389     .6975632    1.150414
                      |
                  sex |   1.091044   .1164579     0.82   0.414     .8850853    1.344929
                  age |   .9960118   .0079467    -0.50   0.616     .9805577     1.01171
               parent |   1.024588   .1390989     0.18   0.858     .7852166    1.336931
                      |
               employ |
            Parttime  |   .6074269   .1055635    -2.87   0.004     .4320813    .8539306
          Unemployed  |   1.538886   .4920239     1.35   0.178     .8223448    2.879777
             Student  |   .9709532   .3174142    -0.09   0.928     .5116018    1.842742
  Not in labor force  |    1.26528   .1582103     1.88   0.060     .9902676    1.616667
                      |
            homemaker |    .730701   .0927975    -2.47   0.013     .5696904    .9372176
                      |
               degree |
 No formal education  |   1.957788   .7718557     1.70   0.088     .9040249    4.239854
      Primary school  |   1.453946   .4024159     1.35   0.176     .8451951    2.501149
     Lower secondary  |    1.31723   .2811256     1.29   0.197     .8669555    2.001366
      Post secondary  |   1.530244   .2365442     2.75   0.006      1.13027    2.071757
Lower level tertiary  |   1.745895   .2220061     4.38   0.000     1.360756    2.240041
Upper level tertiary  |   1.855413   .4255611     2.69   0.007     1.183606    2.908532
                      |
                hswrk |   1.023608   .0286096     0.83   0.404     .9690424    1.081246
              respmom |   .9257596   .1672648    -0.43   0.669     .6496874    1.319143
              famlife |   .6604553   .0192253   -14.25   0.000      .623829    .6992319
             duration |   1.615119   .3114471     2.49   0.013      1.10679    2.356913
                _cons |   .6713777   .3919478    -0.68   0.495     .2138152    2.108119
---------------------------------------------------------------------------------------
Note: _cons estimates baseline relative risk for each outcome.

. estat           ic

Akaike's information criterion and Bayesian information criterion

-----------------------------------------------------------------------------
       Model |        Obs  ll(null)  ll(model)      df         AIC        BIC
-------------+---------------------------------------------------------------
           . |      6,153 -7314.124  -6676.656      17    13387.31   13501.63
-----------------------------------------------------------------------------
               Note: N=Obs used in calculating BIC; see [R] BIC note.

. restore

. 
. log close
      name:  <unnamed>
       log:  C:\Users\Joanna\Dropbox\Repositories\ISSP_Income-Pooling\docs\ISSPdata_duration_2020.02.04.log
  log type:  text
 closed on:   4 Feb 2020, 15:26:59
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
