---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\Joanna\Dropbox\Repositories\ISSP_Income-Pooling\docs\ISSPdata_FLFP_2020.02.10.log
  log type:  text
 opened on:  10 Feb 2020, 10:45:08

. di "$S_DATE"
10 Feb 2020

. ************************************************************************************************************
. /// Import the data
> 
. // Data: ISSP2012 wrangled in R. 
. use     "C:\Users\Joanna\Dropbox\Repositories\ISSP_Income-Pooling\data\ISSPdata.dta", clear
(Written by R.              )

. 
. drop if country == 9 // drop India as an outlier
(344 observations deleted)

. 
. **********************************************************************************************************************
. *Table 3
. **********************************************************************************************************************
. // Model 1
. mlogit          pool    flfp                                                                    , cluster(country) rrr

Iteration 0:   log pseudolikelihood = -9464.1045  
Iteration 1:   log pseudolikelihood = -8992.6437  
Iteration 2:   log pseudolikelihood = -8970.8907  
Iteration 3:   log pseudolikelihood = -8970.8604  
Iteration 4:   log pseudolikelihood = -8970.8604  

Multinomial logistic regression                 Number of obs     =      7,894
                                                Wald chi2(3)      =      42.98
                                                Prob > chi2       =     0.0000
Log pseudolikelihood = -8970.8604               Pseudo R2         =     0.0521

                                       (Std. Err. adjusted for 19 clusters in country)
--------------------------------------------------------------------------------------
                     |               Robust
                pool |        RRR   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------------+----------------------------------------------------------------
One___Manager        |
                flfp |   .7869476   .0558552    -3.38   0.001     .6847468    .9044021
               _cons |   18076.49   56036.81     3.16   0.002     41.53397     7867282
---------------------+----------------------------------------------------------------
Manage___Together    |  (base outcome)
---------------------+----------------------------------------------------------------
Keep_Some___Separate |
                flfp |   1.133137   .0336504     4.21   0.000     1.069066    1.201047
               _cons |   .0010557   .0014534    -4.98   0.000     .0000711    .0156819
---------------------+----------------------------------------------------------------
Keep_All___Separate  |
                flfp |   1.083695   .0515292     1.69   0.091     .9872634    1.189547
               _cons |   .0046197   .0098829    -2.51   0.012     .0000698    .3059143
--------------------------------------------------------------------------------------
Note: _cons estimates baseline relative risk for each outcome.

. estat           ic

Akaike's information criterion and Bayesian information criterion

-----------------------------------------------------------------------------
       Model |        Obs  ll(null)  ll(model)      df         AIC        BIC
-------------+---------------------------------------------------------------
           . |      7,894 -9464.105   -8970.86       6    17953.72   17995.56
-----------------------------------------------------------------------------
               Note: N=Obs used in calculating BIC; see [R] BIC note.

. // Model 2
. mlogit          pool    flfp     i.relinc                                               , cluster(country) rrr

Iteration 0:   log pseudolikelihood = -9464.1045  
Iteration 1:   log pseudolikelihood = -8950.9411  
Iteration 2:   log pseudolikelihood = -8925.9394  
Iteration 3:   log pseudolikelihood = -8925.8777  
Iteration 4:   log pseudolikelihood = -8925.8777  

Multinomial logistic regression                 Number of obs     =      7,894
                                                Wald chi2(9)      =     121.58
                                                Prob > chi2       =     0.0000
Log pseudolikelihood = -8925.8777               Pseudo R2         =     0.0569

                                        (Std. Err. adjusted for 19 clusters in country)
---------------------------------------------------------------------------------------
                      |               Robust
                 pool |        RRR   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
One___Manager         |
                 flfp |    .788037   .0555471    -3.38   0.001     .6863524    .9047864
                      |
               relinc |
Woman primary-earner  |   .8118469   .1034196    -1.64   0.102     .6324719    1.042094
       Equal-earners  |   .5678307   .1300125    -2.47   0.013      .362514    .8894325
                      |
                _cons |   18935.13   58268.28     3.20   0.001     45.48856     7881966
----------------------+----------------------------------------------------------------
Manage___Together     |  (base outcome)
----------------------+----------------------------------------------------------------
Keep_Some___Separate  |
                 flfp |   1.132167   .0337723     4.16   0.000     1.067873    1.200333
                      |
               relinc |
Woman primary-earner  |   1.305544   .1335827     2.61   0.009     1.068309    1.595461
       Equal-earners  |   1.229232   .1491086     1.70   0.089      .969128    1.559145
                      |
                _cons |   .0010088   .0013829    -5.03   0.000     .0000687    .0148132
----------------------+----------------------------------------------------------------
Keep_All___Separate   |
                 flfp |   1.082983   .0509307     1.70   0.090     .9876235    1.187551
                      |
               relinc |
Woman primary-earner  |   1.644782   .2274711     3.60   0.000     1.254262    2.156891
       Equal-earners  |   1.157924   .1404993     1.21   0.227     .9128463    1.468799
                      |
                _cons |   .0042093   .0088602    -2.60   0.009      .000068    .2605701
---------------------------------------------------------------------------------------
Note: _cons estimates baseline relative risk for each outcome.

. estat           ic

Akaike's information criterion and Bayesian information criterion

-----------------------------------------------------------------------------
       Model |        Obs  ll(null)  ll(model)      df         AIC        BIC
-------------+---------------------------------------------------------------
           . |      7,894 -9464.105  -8925.878      12    17875.76   17959.44
-----------------------------------------------------------------------------
               Note: N=Obs used in calculating BIC; see [R] BIC note.

. // Model 3
. mlogit          pool    flfp     i.marst                                                , cluster(country) rrr

Iteration 0:   log pseudolikelihood = -9464.1045  
Iteration 1:   log pseudolikelihood = -8767.0551  
Iteration 2:   log pseudolikelihood = -8741.6059  
Iteration 3:   log pseudolikelihood = -8741.5661  
Iteration 4:   log pseudolikelihood = -8741.5661  

Multinomial logistic regression                 Number of obs     =      7,894
                                                Wald chi2(6)      =     146.98
                                                Prob > chi2       =     0.0000
Log pseudolikelihood = -8741.5661               Pseudo R2         =     0.0763

                                       (Std. Err. adjusted for 19 clusters in country)
--------------------------------------------------------------------------------------
                     |               Robust
                pool |        RRR   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------------+----------------------------------------------------------------
One___Manager        |
                flfp |   .7894199   .0566157    -3.30   0.001     .6859011    .9085622
                     |
               marst |
              Cohab  |   1.641623   .1745557     4.66   0.000     1.332797    2.022007
               _cons |   14757.78   46265.52     3.06   0.002     31.65995     6879098
---------------------+----------------------------------------------------------------
Manage___Together    |  (base outcome)
---------------------+----------------------------------------------------------------
Keep_Some___Separate |
                flfp |   1.146105   .0347018     4.50   0.000     1.080069    1.216178
                     |
               marst |
              Cohab  |   3.892281   .5972701     8.86   0.000     2.881293    5.258004
               _cons |   .0004919   .0007048    -5.32   0.000     .0000297    .0081568
---------------------+----------------------------------------------------------------
Keep_All___Separate  |
                flfp |   1.100756   .0469959     2.25   0.025     1.012395     1.19683
                     |
               marst |
              Cohab  |   5.436866   .9796055     9.40   0.000     3.819271    7.739568
               _cons |   .0015902   .0031049    -3.30   0.001     .0000346    .0730238
--------------------------------------------------------------------------------------
Note: _cons estimates baseline relative risk for each outcome.

. estat           ic

Akaike's information criterion and Bayesian information criterion

-----------------------------------------------------------------------------
       Model |        Obs  ll(null)  ll(model)      df         AIC        BIC
-------------+---------------------------------------------------------------
           . |      7,894 -9464.105  -8741.566       9    17501.13    17563.9
-----------------------------------------------------------------------------
               Note: N=Obs used in calculating BIC; see [R] BIC note.

. 
. 
. **********************************************************************************************************************
. *Table 4 - Model 4
. **********************************************************************************************************************
. global  ivars "sex age parent i.employ homemaker ib4.degree hswrk respmom famlife"

. 
. mlogit          pool    flfp i.relinc           i.marst         $ivars                                  , cluster(country) rrr

Iteration 0:   log pseudolikelihood = -9464.1045  
Iteration 1:   log pseudolikelihood = -8436.2798  
Iteration 2:   log pseudolikelihood = -8380.2174  
Iteration 3:   log pseudolikelihood = -8379.6267  
Iteration 4:   log pseudolikelihood = -8379.6265  

Multinomial logistic regression                 Number of obs     =      7,894
                                                Wald chi2(15)     =          .
                                                Prob > chi2       =          .
Log pseudolikelihood = -8379.6265               Pseudo R2         =     0.1146

                                        (Std. Err. adjusted for 19 clusters in country)
---------------------------------------------------------------------------------------
                      |               Robust
                 pool |        RRR   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
One___Manager         |
                 flfp |   .8177286   .0569132    -2.89   0.004     .7134545    .9372428
                      |
               relinc |
Woman primary-earner  |   .9544649   .1394853    -0.32   0.750     .7167465    1.271026
       Equal-earners  |   .6480016    .132835    -2.12   0.034     .4335974    .9684237
                      |
                marst |
               Cohab  |   1.426478   .1495412     3.39   0.001     1.161533    1.751857
                  sex |    .779892   .0698838    -2.77   0.006     .6542757    .9296257
                  age |   .9832294   .0057792    -2.88   0.004     .9719674    .9946218
               parent |   .9378899    .129114    -0.47   0.641     .7160968    1.228378
                      |
               employ |
            Parttime  |   1.370558   .1997771     2.16   0.031     1.029968    1.823776
          Unemployed  |   1.411458   .4352895     1.12   0.264     .7711874    2.583307
             Student  |   1.603036   .2339824     3.23   0.001     1.204204    2.133961
  Not in labor force  |    .814024   .1071767    -1.56   0.118     .6288769     1.05368
                      |
            homemaker |   1.095654   .1271181     0.79   0.431     .8728041    1.375403
                      |
               degree |
 No formal education  |   1.978666   .4097127     3.30   0.001     1.318616    2.969113
      Primary school  |   1.452252   .2563028     2.11   0.035     1.027582    2.052426
     Lower secondary  |   1.042088   .1554008     0.28   0.782     .7779818    1.395852
      Post secondary  |   .9841755   .2011549    -0.08   0.938     .6593198    1.469092
Lower level tertiary  |   .7581229   .1613887    -1.30   0.193      .499501    1.150649
Upper level tertiary  |   .4967103    .075361    -4.61   0.000     .3689426    .6687251
                      |
                hswrk |   .9233139   .0261505    -2.82   0.005     .8734564    .9760172
              respmom |   .9853499   .0956683    -0.15   0.879     .8146043    1.191885
              famlife |   .7531304   .0453021    -4.71   0.000     .6693742    .8473667
                _cons |   66870.03   192439.4     3.86   0.000     237.4834    1.88e+07
----------------------+----------------------------------------------------------------
Manage___Together     |  (base outcome)
----------------------+----------------------------------------------------------------
Keep_Some___Separate  |
                 flfp |   1.100518   .0352549     2.99   0.003     1.033545    1.171832
                      |
               relinc |
Woman primary-earner  |   1.121347   .1208572     1.06   0.288     .9078179    1.385101
       Equal-earners  |   1.035636    .125479     0.29   0.773     .8167228    1.313227
                      |
                marst |
               Cohab  |   3.482329   .4747093     9.15   0.000     2.665842    4.548887
                  sex |   1.129863   .1111694     1.24   0.215     .9316968    1.370179
                  age |   .9830375   .0041907    -4.01   0.000     .9748582    .9912854
               parent |   .9333112    .092148    -0.70   0.485     .7691045    1.132577
                      |
               employ |
            Parttime  |   .6403714   .1046683    -2.73   0.006       .46484    .8821864
          Unemployed  |   .6307591   .1265837    -2.30   0.022      .425638     .934731
             Student  |   .6139863   .0757057    -3.96   0.000     .4821742     .781832
  Not in labor force  |   .8801549   .1256149    -0.89   0.371     .6653902    1.164238
                      |
            homemaker |   .7409594   .0792058    -2.80   0.005     .6009026    .9136602
                      |
               degree |
 No formal education  |   .6276377   .2576712    -1.13   0.257     .2807085    1.403338
      Primary school  |   .7616622   .1377862    -1.50   0.132     .5342916    1.085792
     Lower secondary  |   .8532857   .1192825    -1.13   0.256     .6487888     1.12224
      Post secondary  |   .8460596   .1127318    -1.25   0.210     .6516044    1.098545
Lower level tertiary  |   1.353493   .1510552     2.71   0.007     1.087573    1.684432
Upper level tertiary  |   1.721002    .186133     5.02   0.000      1.39226    2.127365
                      |
                hswrk |   .9698727   .0196005    -1.51   0.130     .9322073     1.00906
              respmom |   1.211485   .1440796     1.61   0.107     .9595913    1.529501
              famlife |   .8378603   .0289423    -5.12   0.000     .7830121    .8965506
                _cons |   .0202554   .0294743    -2.68   0.007     .0011693    .3508728
----------------------+----------------------------------------------------------------
Keep_All___Separate   |
                 flfp |   1.055268   .0442718     1.28   0.200     .9719685    1.145706
                      |
               relinc |
Woman primary-earner  |   1.285125   .1939076     1.66   0.096     .9561164    1.727348
       Equal-earners  |   .9028927   .1063763    -0.87   0.386     .7167206    1.137424
                      |
                marst |
               Cohab  |   4.913419    .858692     9.11   0.000     3.488381      6.9206
                  sex |   1.285553   .1054493     3.06   0.002     1.094634     1.50977
                  age |   .9946787   .0084503    -0.63   0.530     .9782535     1.01138
               parent |   1.001068   .1231406     0.01   0.993     .7866068    1.273999
                      |
               employ |
            Parttime  |   .5146869   .1072942    -3.19   0.001     .3420562    .7744419
          Unemployed  |   1.248696   .3793428     0.73   0.465     .6884452    2.264875
             Student  |    .527477   .0901433    -3.74   0.000     .3773438    .7373433
  Not in labor force  |   1.197222   .1483677     1.45   0.146      .939049    1.526375
                      |
            homemaker |   .6715704   .0793896    -3.37   0.001     .5326806    .8466739
                      |
               degree |
 No formal education  |   .5884379   .2103145    -1.48   0.138     .2920595    1.185577
      Primary school  |   1.124426   .3993354     0.33   0.741     .5605699    2.255442
     Lower secondary  |   .9553025    .163771    -0.27   0.790     .6826786    1.336797
      Post secondary  |   1.118063   .1397289     0.89   0.372     .8751615    1.428382
Lower level tertiary  |   1.288749   .1472144     2.22   0.026     1.030232    1.612135
Upper level tertiary  |   1.273304   .2496111     1.23   0.218     .8670963    1.869806
                      |
                hswrk |   1.027004   .0258526     1.06   0.290     .9775631    1.078945
              respmom |   .9297566    .152659    -0.44   0.657     .6739201    1.282715
              famlife |   .7050258   .0268299    -9.18   0.000     .6543534    .7596222
                _cons |   .1152907   .2629359    -0.95   0.344     .0013198    10.07102
---------------------------------------------------------------------------------------
Note: _cons estimates baseline relative risk for each outcome.

. estat           ic

Akaike's information criterion and Bayesian information criterion

-----------------------------------------------------------------------------
       Model |        Obs  ll(null)  ll(model)      df         AIC        BIC
-------------+---------------------------------------------------------------
           . |      7,894 -9464.105  -8379.626      18    16795.25   16920.78
-----------------------------------------------------------------------------
               Note: N=Obs used in calculating BIC; see [R] BIC note.

. 
. **********************************************************************************************************************
. *Table 4 - Model 5
. **********************************************************************************************************************
. global  ivars " sex age parent i.employ homemaker ib4.degree hswrk respmom famlife"

. 
. mlogit          pool    c.flfp##i.relinc        i.marst         $ivars                                  , cluster(country) rrr

Iteration 0:   log pseudolikelihood = -9464.1045  
Iteration 1:   log pseudolikelihood = -8424.3537  
Iteration 2:   log pseudolikelihood =  -8364.919  
Iteration 3:   log pseudolikelihood = -8364.2563  
Iteration 4:   log pseudolikelihood =  -8364.256  

Multinomial logistic regression                 Number of obs     =      7,894
                                                Wald chi2(15)     =          .
                                                Prob > chi2       =          .
Log pseudolikelihood =  -8364.256               Pseudo R2         =     0.1162

                                        (Std. Err. adjusted for 19 clusters in country)
---------------------------------------------------------------------------------------
                      |               Robust
                 pool |        RRR   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
One___Manager         |
                 flfp |   .7967117   .0544466    -3.33   0.001     .6968363    .9109018
                      |
               relinc |
Woman primary-earner  |   .0215307   .0554081    -1.49   0.136     .0001388    3.338743
       Equal-earners  |   .0065529   .0107303    -3.07   0.002     .0002646    .1622771
                      |
        relinc#c.flfp |
Woman primary-earner  |   1.089622   .0616973     1.52   0.130     .9751661    1.217512
       Equal-earners  |   1.109563   .0390355     2.96   0.003     1.035632     1.18877
                      |
                marst |
               Cohab  |   1.406933   .1432385     3.35   0.001     1.152427    1.717645
                  sex |   .7791682   .0698409    -2.78   0.005     .6536325    .9288141
                  age |   .9836817   .0059143    -2.74   0.006     .9721578    .9953422
               parent |   .9428773   .1315826    -0.42   0.673      .717243    1.239493
                      |
               employ |
            Parttime  |   1.357117   .1974161     2.10   0.036     1.020459    1.804842
          Unemployed  |   1.402663   .4288383     1.11   0.268     .7703963    2.553833
             Student  |   1.581615   .2276798     3.18   0.001     1.192798    2.097175
  Not in labor force  |   .8130757   .1068289    -1.57   0.115     .6284819    1.051887
                      |
            homemaker |   1.104443   .1319238     0.83   0.406     .8739139    1.395783
                      |
               degree |
 No formal education  |   1.987722   .4061747     3.36   0.001     1.331741    2.966824
      Primary school  |   1.458582   .2618811     2.10   0.036     1.025893    2.073767
     Lower secondary  |   1.043969   .1580268     0.28   0.776     .7759613    1.404543
      Post secondary  |   .9827495   .1996663    -0.09   0.932     .6599382    1.463465
Lower level tertiary  |   .7610187   .1613233    -1.29   0.198     .5022903    1.153017
Upper level tertiary  |    .496766   .0752439    -4.62   0.000     .3691667    .6684689
                      |
                hswrk |   .9230097    .025638    -2.88   0.004     .8741036    .9746522
              respmom |   .9944415   .0951108    -0.06   0.954     .8244576    1.199472
              famlife |   .7551584   .0453696    -4.67   0.000     .6712716    .8495283
                _cons |     196909   552046.2     4.35   0.000     808.8566    4.79e+07
----------------------+----------------------------------------------------------------
Manage___Together     |  (base outcome)
----------------------+----------------------------------------------------------------
Keep_Some___Separate  |
                 flfp |   1.113943   .0465276     2.58   0.010     1.026384    1.208972
                      |
               relinc |
Woman primary-earner  |   1.136535   2.637138     0.06   0.956     .0120368    107.3131
       Equal-earners  |   11.28804   21.90708     1.25   0.212     .2515726    506.4934
                      |
        relinc#c.flfp |
Woman primary-earner  |    .999918   .0490733    -0.00   0.999     .9082171    1.100878
       Equal-earners  |   .9498952   .0400546    -1.22   0.223     .8745462    1.031736
                      |
                marst |
               Cohab  |    3.48475   .4725692     9.21   0.000     2.671404     4.54573
                  sex |   1.125491   .1109631     1.20   0.230     .9277295    1.365409
                  age |   .9829748   .0041839    -4.03   0.000     .9748086    .9912094
               parent |   .9340548   .0921007    -0.69   0.489     .7699123    1.133192
                      |
               employ |
            Parttime  |   .6482497   .1054262    -2.67   0.008     .4713133    .8916101
          Unemployed  |   .6334914   .1270636    -2.28   0.023     .4275722    .9385814
             Student  |   .6164284   .0751115    -3.97   0.000      .485472    .7827104
  Not in labor force  |   .8848646   .1261393    -0.86   0.391     .6691697    1.170085
                      |
            homemaker |       .742   .0791001    -2.80   0.005     .6020914    .9144193
                      |
               degree |
 No formal education  |    .640714    .262959    -1.08   0.278     .2866275    1.432223
      Primary school  |   .7684736   .1433742    -1.41   0.158     .5331142     1.10774
     Lower secondary  |   .8539231   .1200538    -1.12   0.261     .6482576    1.124838
      Post secondary  |   .8456306   .1121491    -1.26   0.206     .6520678    1.096651
Lower level tertiary  |   1.355833   .1503897     2.74   0.006     1.090914    1.685086
Upper level tertiary  |   1.720433   .1862543     5.01   0.000     1.391511    2.127106
                      |
                hswrk |   .9696304   .0194639    -1.54   0.124     .9322226    1.008539
              respmom |   1.207781   .1441191     1.58   0.114      .955913    1.526013
              famlife |   .8383113   .0286513    -5.16   0.000     .7839953    .8963903
                _cons |   .0115847   .0218029    -2.37   0.018     .0002897     .463323
----------------------+----------------------------------------------------------------
Keep_All___Separate   |
                 flfp |   1.088947   .0504664     1.84   0.066     .9943941    1.192491
                      |
               relinc |
Woman primary-earner  |   39.92522    72.7255     2.02   0.043     1.123951    1418.232
       Equal-earners  |   23.36818   43.15293     1.71   0.088     .6262535    871.9658
                      |
        relinc#c.flfp |
Woman primary-earner  |   .9283287      .0362    -1.91   0.056     .8600216    1.002061
       Equal-earners  |   .9320445   .0368175    -1.78   0.075     .8626062    1.007072
                      |
                marst |
               Cohab  |   4.925863   .8546544     9.19   0.000     3.505871    6.920999
                  sex |   1.283834   .1050972     3.05   0.002     1.093523    1.507266
                  age |    .994551   .0084217    -0.65   0.519      .978181    1.011195
               parent |   1.000388   .1231846     0.00   0.997     .7858767    1.273453
                      |
               employ |
            Parttime  |    .523175   .1063519    -3.19   0.001     .3512476     .779257
          Unemployed  |   1.261895   .3803715     0.77   0.440     .6989503    2.278242
             Student  |   .5332549   .0904098    -3.71   0.000     .3824893    .7434476
  Not in labor force  |   1.193329   .1468624     1.44   0.151     .9375693    1.518858
                      |
            homemaker |   .6733183    .078653    -3.39   0.001     .5355354    .8465501
                      |
               degree |
 No formal education  |   .5721043   .1961023    -1.63   0.103     .2922171    1.120069
      Primary school  |    1.13793   .4095888     0.36   0.720     .5619947    2.304086
     Lower secondary  |   .9562614   .1644078    -0.26   0.795     .6827025    1.339435
      Post secondary  |   1.115772   .1388531     0.88   0.379     .8742725    1.423979
Lower level tertiary  |   1.292831   .1463245     2.27   0.023     1.035623     1.61392
Upper level tertiary  |   1.277687   .2503713     1.25   0.211     .8702132    1.875958
                      |
                hswrk |   1.025658   .0258564     1.00   0.315     .9762123    1.077609
              respmom |   .9283348   .1524955    -0.45   0.651     .6727901    1.280943
              famlife |   .7046638   .0272238    -9.06   0.000     .6532762    .7600936
                _cons |   .0272634   .0673873    -1.46   0.145     .0002146    3.463419
---------------------------------------------------------------------------------------
Note: _cons estimates baseline relative risk for each outcome.

. estat           ic

Akaike's information criterion and Bayesian information criterion

-----------------------------------------------------------------------------
       Model |        Obs  ll(null)  ll(model)      df         AIC        BIC
-------------+---------------------------------------------------------------
           . |      7,894 -9464.105  -8364.256      18    16764.51   16890.04
-----------------------------------------------------------------------------
               Note: N=Obs used in calculating BIC; see [R] BIC note.

. 
. // Figure C
. mlogit          pool    c.flfp##i.relinc        i.marst         $ivars                                  , cluster(country)

Iteration 0:   log pseudolikelihood = -9464.1045  
Iteration 1:   log pseudolikelihood = -8424.3537  
Iteration 2:   log pseudolikelihood =  -8364.919  
Iteration 3:   log pseudolikelihood = -8364.2563  
Iteration 4:   log pseudolikelihood =  -8364.256  

Multinomial logistic regression                 Number of obs     =      7,894
                                                Wald chi2(15)     =          .
                                                Prob > chi2       =          .
Log pseudolikelihood =  -8364.256               Pseudo R2         =     0.1162

                                        (Std. Err. adjusted for 19 clusters in country)
---------------------------------------------------------------------------------------
                      |               Robust
                 pool |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
One___Manager         |
                 flfp |  -.2272624   .0683392    -3.33   0.001    -.3612047   -.0933202
                      |
               relinc |
Woman primary-earner  |  -3.838277   2.573451    -1.49   0.136    -8.882148    1.205595
       Equal-earners  |  -5.027841   1.637474    -3.07   0.002    -8.237232    -1.81845
                      |
        relinc#c.flfp |
Woman primary-earner  |    .085831   .0566227     1.52   0.130    -.0251474    .1968093
       Equal-earners  |   .1039658    .035181     2.96   0.003     .0350123    .1729193
                      |
                marst |
               Cohab  |   .3414119   .1018091     3.35   0.001     .1418697    .5409541
                  sex |  -.2495283   .0896351    -2.78   0.005      -.42521   -.0738467
                  age |  -.0164529   .0060125    -2.74   0.006    -.0282371   -.0046687
               parent |  -.0588192   .1395543    -0.42   0.673    -.3323406    .2147023
                      |
               employ |
            Parttime  |   .3053629   .1454672     2.10   0.036     .0202524    .5904733
          Unemployed  |   .3383725   .3057315     1.11   0.268    -.2608503    .9375954
             Student  |   .4584465    .143954     3.18   0.001     .1763019    .7405912
  Not in labor force  |  -.2069311   .1313886    -1.57   0.115     -.464448    .0505858
                      |
            homemaker |   .0993409   .1194483     0.83   0.406    -.1347734    .3334553
                      |
               degree |
 No formal education  |   .6869894   .2043418     3.36   0.001     .2864869    1.087492
      Primary school  |    .377465   .1795449     2.10   0.036     .0255634    .7293666
     Lower secondary  |   .0430295   .1513712     0.28   0.776    -.2536527    .3397116
      Post secondary  |  -.0174011   .2031711    -0.09   0.932    -.4156091    .3808069
Lower level tertiary  |  -.2730973   .2119834    -1.29   0.198    -.6885771    .1423824
Upper level tertiary  |  -.6996361   .1514674    -4.62   0.000    -.9965069   -.4027654
                      |
                hswrk |  -.0801155   .0277765    -2.88   0.004    -.1345564   -.0256746
              respmom |   -.005574   .0956424    -0.06   0.954    -.1930296    .1818817
              famlife |  -.2808278   .0600795    -4.67   0.000    -.3985815    -.163074
                _cons |    12.1905   2.803559     4.35   0.000     6.695622    17.68537
----------------------+----------------------------------------------------------------
Manage___Together     |  (base outcome)
----------------------+----------------------------------------------------------------
Keep_Some___Separate  |
                 flfp |   .1079061   .0417684     2.58   0.010     .0260415    .1897706
                      |
               relinc |
Woman primary-earner  |   .1279839   2.320332     0.06   0.956    -4.419783    4.675751
       Equal-earners  |   2.423744   1.940733     1.25   0.212    -1.380024    6.227511
                      |
        relinc#c.flfp |
Woman primary-earner  |   -.000082   .0490774    -0.00   0.999    -.0962719    .0961079
       Equal-earners  |  -.0514036   .0421674    -1.22   0.223    -.1340501    .0312429
                      |
                marst |
               Cohab  |   1.248396   .1356107     9.21   0.000     .9826042    1.514188
                  sex |   .1182193   .0985908     1.20   0.230    -.0750151    .3114538
                  age |  -.0171718   .0042564    -4.03   0.000    -.0255141   -.0088295
               parent |  -.0682201   .0986031    -0.69   0.489    -.2614787    .1250384
                      |
               employ |
            Parttime  |  -.4334793   .1626321    -2.67   0.008    -.7522323   -.1147263
          Unemployed  |  -.4565089   .2005768    -2.28   0.023    -.8496321   -.0633857
             Student  |  -.4838131   .1218494    -3.97   0.000    -.7226336   -.2449925
  Not in labor force  |  -.1223206   .1425521    -0.86   0.391    -.4017177    .1570764
                      |
            homemaker |   -.298406    .106604    -2.80   0.005     -.507346   -.0894661
                      |
               degree |
 No formal education  |   -.445172   .4104155    -1.08   0.278    -1.249572    .3592276
      Primary school  |  -.2633491   .1865701    -1.41   0.158    -.6290197    .1023215
     Lower secondary  |  -.1579141   .1405909    -1.12   0.261    -.4334672     .117639
      Post secondary  |  -.1676727   .1326218    -1.26   0.206    -.4276067    .0922614
Lower level tertiary  |   .3044161   .1109205     2.74   0.006     .0870158    .5218163
Upper level tertiary  |   .5425762   .1082601     5.01   0.000     .3303902    .7547622
                      |
                hswrk |  -.0308403   .0200735    -1.54   0.124    -.0701836    .0085031
              respmom |   .1887852   .1193255     1.58   0.114    -.0450884    .4226588
              famlife |  -.1763658   .0341774    -5.16   0.000    -.2433522   -.1093794
                _cons |  -4.458071   1.882045    -2.37   0.018    -8.146812   -.7693309
----------------------+----------------------------------------------------------------
Keep_All___Separate   |
                 flfp |   .0852112   .0463442     1.84   0.066    -.0056217    .1760442
                      |
               relinc |
Woman primary-earner  |   3.687008   1.821543     2.02   0.043     .1168504    7.257166
       Equal-earners  |   3.151375   1.846654     1.71   0.088    -.4680001     6.77075
                      |
        relinc#c.flfp |
Woman primary-earner  |  -.0743694   .0389948    -1.91   0.056    -.1507978    .0020589
       Equal-earners  |  -.0703747   .0395019    -1.78   0.075     -.147797    .0070475
                      |
                marst |
               Cohab  |     1.5945   .1735035     9.19   0.000     1.254439     1.93456
                  sex |   .2498508    .081862     3.05   0.002     .0894044    .4102973
                  age |  -.0054639   .0084678    -0.65   0.519    -.0220605    .0111327
               parent |   .0003883   .1231368     0.00   0.997    -.2409553     .241732
                      |
               employ |
            Parttime  |  -.6478392   .2032817    -3.19   0.001    -1.046264   -.2494143
          Unemployed  |   .2326142   .3014289     0.77   0.440    -.3581756     .823404
             Student  |  -.6287558   .1695433    -3.71   0.000    -.9610546   -.2964571
  Not in labor force  |   .1767472   .1230695     1.44   0.151    -.0644646    .4179589
                      |
            homemaker |  -.3955371    .116814    -3.39   0.001    -.6244883   -.1665859
                      |
               degree |
 No formal education  |   -.558434   .3427737    -1.63   0.103    -1.230258    .1133901
      Primary school  |   .1292106   .3599421     0.36   0.720    -.5762629    .8346842
     Lower secondary  |   -.044724   .1719277    -0.26   0.795    -.3816961     .292248
      Post secondary  |   .1095461   .1244458     0.88   0.379    -.1343631    .3534554
Lower level tertiary  |   .2568344   .1131815     2.27   0.023     .0350028     .478666
Upper level tertiary  |   .2450511   .1959567     1.25   0.211     -.139017    .6291192
                      |
                hswrk |   .0253347   .0252096     1.00   0.315    -.0240752    .0747445
              respmom |  -.0743628   .1642678    -0.45   0.651    -.3963218    .2475962
              famlife |  -.3500345   .0386338    -9.06   0.000    -.4257553   -.2743137
                _cons |   -3.60221   2.471712    -1.46   0.145    -8.446676    1.242256
---------------------------------------------------------------------------------------

. 
. margin  relinc, at(flfp=(39(1)51)) predict(outcome(1))  /* One Manages  */

Predictive margins                              Number of obs     =      7,894
Model VCE    : Robust

Expression   : Pr(pool==One___Manager), predict(outcome(1))

1._at        : flfp            =          39

2._at        : flfp            =          40

3._at        : flfp            =          41

4._at        : flfp            =          42

5._at        : flfp            =          43

6._at        : flfp            =          44

7._at        : flfp            =          45

8._at        : flfp            =          46

9._at        : flfp            =          47

10._at       : flfp            =          48

11._at       : flfp            =          49

12._at       : flfp            =          50

13._at       : flfp            =          51

------------------------------------------------------------------------------------------
                         |            Delta-method
                         |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------------------+----------------------------------------------------------------
              _at#relinc |
   1#Man primary-earner  |   .5241831   .0780588     6.72   0.000     .3711906    .6771755
 1#Woman primary-earner  |    .388505   .1257292     3.09   0.002     .1420803    .6349297
        1#Equal-earners  |   .2900907   .0875825     3.31   0.001     .1184321    .4617492
   2#Man primary-earner  |   .4668437   .0630746     7.40   0.000     .3432198    .5904676
 2#Woman primary-earner  |   .3547289   .1030746     3.44   0.001     .1527064    .5567515
        2#Equal-earners  |   .2650194   .0706775     3.75   0.000      .126494    .4035449
   3#Man primary-earner  |    .410063   .0479234     8.56   0.000     .3161348    .5039912
 3#Woman primary-earner  |   .3220598   .0816121     3.95   0.000     .1621031    .4820165
        3#Equal-earners  |   .2412563   .0556561     4.33   0.000     .1321723    .3503403
   4#Man primary-earner  |    .355205   .0346035    10.27   0.000     .2873834    .4230266
 4#Woman primary-earner  |   .2907463   .0621177     4.68   0.000     .1689978    .4124947
        4#Equal-earners  |   .2188687   .0430075     5.09   0.000     .1345756    .3031618
   5#Man primary-earner  |    .303478   .0257984    11.76   0.000     .2529142    .3540419
 5#Woman primary-earner  |   .2609994   .0455432     5.73   0.000     .1717363    .3502625
        5#Equal-earners  |   .1978994   .0333959     5.93   0.000     .1324445    .2633542
   6#Man primary-earner  |   .2558411   .0237091    10.79   0.000     .2093721    .3023102
 6#Woman primary-earner  |   .2329883   .0333008     7.00   0.000       .16772    .2982567
        6#Equal-earners  |    .178368   .0276134     6.46   0.000     .1242467    .2324892
   7#Man primary-earner  |   .2129485   .0263991     8.07   0.000     .1612072    .2646898
 7#Woman primary-earner  |   .2068377   .0272808     7.58   0.000     .1533684     .260307
        7#Equal-earners  |   .1602728   .0259299     6.18   0.000     .1094511    .2110945
   8#Man primary-earner  |    .175137   .0299546     5.85   0.000     .1164271    .2338469
 8#Woman primary-earner  |   .1826279   .0277497     6.58   0.000     .1282395    .2370164
        8#Equal-earners  |   .1435934   .0272887     5.26   0.000     .0901086    .1970782
   9#Man primary-earner  |   .1424522   .0323791     4.40   0.000     .0789902    .2059141
 9#Woman primary-earner  |   .1603966   .0317147     5.06   0.000     .0982371    .2225562
        9#Equal-earners  |   .1282931   .0300057     4.28   0.000     .0694829    .1871032
  10#Man primary-earner  |   .1147005   .0331767     3.46   0.001     .0496753    .1797257
10#Woman primary-earner  |   .1401422   .0362228     3.87   0.000     .0691469    .2111375
       10#Equal-earners  |   .1143217   .0328822     3.48   0.001     .0498738    .1787696
  11#Man primary-earner  |   .0915148   .0324735     2.82   0.005     .0278679    .1551617
11#Woman primary-earner  |   .1218282   .0399185     3.05   0.002     .0435894     .200067
       11#Equal-earners  |   .1016186   .0353297     2.88   0.004     .0323737    .1708635
  12#Man primary-earner  |   .0724204   .0306151     2.37   0.018      .012416    .1324248
12#Woman primary-earner  |    .105389   .0423692     2.49   0.013     .0223469    .1884312
       12#Equal-earners  |   .0901153   .0371206     2.43   0.015     .0173603    .1628703
  13#Man primary-earner  |   .0568938   .0279901     2.03   0.042     .0020342    .1117534
13#Woman primary-earner  |   .0907354   .0435322     2.08   0.037     .0054139    .1760569
       13#Equal-earners  |   .0797377   .0382054     2.09   0.037     .0048564     .154619
------------------------------------------------------------------------------------------

. margin  relinc, at(flfp=(39(1)51)) predict(outcome(2))  /* Manage Equal */

Predictive margins                              Number of obs     =      7,894
Model VCE    : Robust

Expression   : Pr(pool==Manage___Together), predict(outcome(2))

1._at        : flfp            =          39

2._at        : flfp            =          40

3._at        : flfp            =          41

4._at        : flfp            =          42

5._at        : flfp            =          43

6._at        : flfp            =          44

7._at        : flfp            =          45

8._at        : flfp            =          46

9._at        : flfp            =          47

10._at       : flfp            =          48

11._at       : flfp            =          49

12._at       : flfp            =          50

13._at       : flfp            =          51

------------------------------------------------------------------------------------------
                         |            Delta-method
                         |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------------------+----------------------------------------------------------------
              _at#relinc |
   1#Man primary-earner  |   .3743745   .0673286     5.56   0.000     .2424128    .5063362
 1#Woman primary-earner  |   .4371079   .1017436     4.30   0.000     .2376942    .6365216
        1#Equal-earners  |   .5122576   .0739124     6.93   0.000     .3673918    .6571233
   2#Man primary-earner  |   .4116138   .0556379     7.40   0.000     .3025656    .5206621
 2#Woman primary-earner  |   .4551673   .0851804     5.34   0.000     .2882167    .6221178
        2#Equal-earners  |   .5253715   .0632668     8.30   0.000     .4013707    .6493722
   3#Man primary-earner  |   .4464066   .0444196    10.05   0.000     .3593457    .5334675
 3#Woman primary-earner  |   .4714004   .0697396     6.76   0.000     .3347133    .6080875
        3#Equal-earners  |   .5370799   .0542185     9.91   0.000     .4308135    .6433462
   4#Man primary-earner  |    .477665   .0351692    13.58   0.000     .4087347    .5465954
 4#Woman primary-earner  |   .4855897    .055987     8.67   0.000     .3758572    .5953222
        4#Equal-earners  |   .5473459    .046907    11.67   0.000       .45541    .6392819
   5#Man primary-earner  |   .5045005   .0293111    17.21   0.000     .4470518    .5619491
 5#Woman primary-earner  |    .497557   .0445646    11.16   0.000      .410212     .584902
        5#Equal-earners  |   .5561535    .041384    13.44   0.000     .4750423    .6372647
   6#Man primary-earner  |   .5262861   .0273832    19.22   0.000      .472616    .5799562
 6#Woman primary-earner  |   .5071676   .0362414    13.99   0.000     .4361358    .5781995
        6#Equal-earners  |   .5635053   .0375828    14.99   0.000     .4898444    .6371663
   7#Man primary-earner  |   .5426837   .0283726    19.13   0.000     .4870744    .5982929
 7#Woman primary-earner  |    .514332   .0317583    16.20   0.000     .4520868    .5765771
        7#Equal-earners  |   .5694214   .0353089    16.13   0.000     .5002172    .6386257
   8#Man primary-earner  |   .5536342   .0307405    18.01   0.000     .4933839    .6138846
 8#Woman primary-earner  |   .5190057   .0312073    16.63   0.000     .4578405    .5801708
        8#Equal-earners  |   .5739366   .0342819    16.74   0.000     .5067454    .6411278
   9#Man primary-earner  |   .5593195   .0336336    16.63   0.000      .493399    .6252401
 9#Woman primary-earner  |   .5211879   .0336398    15.49   0.000     .4552551    .5871207
        9#Equal-earners  |   .5770979   .0342154    16.87   0.000     .5100371    .6441588
  10#Man primary-earner  |   .5601064   .0369208    15.17   0.000      .487743    .6324697
10#Woman primary-earner  |   .5209185   .0377856    13.79   0.000       .44686    .5949769
       10#Equal-earners  |   .5789627   .0348881    16.59   0.000     .5105832    .6473423
  11#Man primary-earner  |   .5564847   .0407931    13.64   0.000     .4765318    .6364376
11#Woman primary-earner  |   .5182734   .0427918    12.11   0.000     .4344029    .6021438
       11#Equal-earners  |   .5795958   .0361704    16.02   0.000     .5087031    .6504885
  12#Man primary-earner  |     .54901   .0454465    12.08   0.000     .4599364    .6380836
12#Woman primary-earner  |   .5133603   .0482686    10.64   0.000     .4187557    .6079649
       12#Equal-earners  |   .5790673   .0380098    15.23   0.000     .5045694    .6535652
  13#Man primary-earner  |   .5382557   .0509372    10.57   0.000     .4384205    .6380908
13#Woman primary-earner  |   .5063135   .0540892     9.36   0.000     .4003006    .6123263
       13#Equal-earners  |   .5774509   .0403991    14.29   0.000     .4982702    .6566316
------------------------------------------------------------------------------------------

. margin  relinc, at(flfp=(39(1)51)) predict(outcome(3))  /* Pool Some    */

Predictive margins                              Number of obs     =      7,894
Model VCE    : Robust

Expression   : Pr(pool==Keep_Some___Separate), predict(outcome(3))

1._at        : flfp            =          39

2._at        : flfp            =          40

3._at        : flfp            =          41

4._at        : flfp            =          42

5._at        : flfp            =          43

6._at        : flfp            =          44

7._at        : flfp            =          45

8._at        : flfp            =          46

9._at        : flfp            =          47

10._at       : flfp            =          48

11._at       : flfp            =          49

12._at       : flfp            =          50

13._at       : flfp            =          51

------------------------------------------------------------------------------------------
                         |            Delta-method
                         |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------------------+----------------------------------------------------------------
              _at#relinc |
   1#Man primary-earner  |   .0613272   .0143271     4.28   0.000     .0332467    .0894078
 1#Woman primary-earner  |   .0772193   .0196779     3.92   0.000     .0386512    .1157873
        1#Equal-earners  |   .1199571   .0239607     5.01   0.000     .0729951    .1669191
   2#Man primary-earner  |   .0740954   .0147909     5.01   0.000     .0451059     .103085
 2#Woman primary-earner  |   .0887216   .0198382     4.47   0.000     .0498394    .1276038
        2#Equal-earners  |   .1292702   .0225791     5.73   0.000      .085016    .1735244
   3#Man primary-earner  |   .0882387    .015056     5.86   0.000     .0587295     .117748
 3#Woman primary-earner  |   .1013632   .0198073     5.12   0.000     .0625417    .1401847
        3#Equal-earners  |   .1388619   .0210574     6.59   0.000     .0975901    .1801337
   4#Man primary-earner  |   .1036208   .0151043     6.86   0.000      .074017    .1332246
 4#Woman primary-earner  |   .1151636   .0195686     5.89   0.000     .0768098    .1535174
        4#Equal-earners  |   .1487109   .0194259     7.66   0.000     .1106367     .186785
   5#Man primary-earner  |   .1200722   .0149408     8.04   0.000     .0907887    .1493556
 5#Woman primary-earner  |   .1301306   .0191313     6.80   0.000      .092634    .1676272
        5#Equal-earners  |   .1587968   .0177528     8.94   0.000      .124002    .1935916
   6#Man primary-earner  |   .1374078   .0146589     9.37   0.000     .1086769    .1661386
 6#Woman primary-earner  |   .1462603   .0185607     7.88   0.000      .109882    .1826386
        6#Equal-earners  |   .1691007   .0161732    10.46   0.000     .1374017    .2007996
   7#Man primary-earner  |    .155444   .0145333    10.70   0.000     .1269592    .1839287
 7#Woman primary-earner  |   .1635368   .0180251     9.07   0.000     .1282082    .1988654
        7#Equal-earners  |   .1796051   .0149281    12.03   0.000     .1503465    .2088637
   8#Man primary-earner  |   .1740128   .0150813    11.54   0.000      .144454    .2035717
 8#Woman primary-earner  |   .1819327   .0178461    10.19   0.000      .146955    .2169105
        8#Equal-earners  |   .1902945     .01438    13.23   0.000     .1621102    .2184788
   9#Man primary-earner  |   .1929713   .0169277    11.40   0.000     .1597936     .226149
 9#Woman primary-earner  |   .2014095   .0184989    10.89   0.000     .1651524    .2376666
        9#Equal-earners  |   .2011549   .0149238    13.48   0.000     .1719048     .230405
  10#Man primary-earner  |   .2122049   .0204542    10.37   0.000     .1721153    .2522945
10#Woman primary-earner  |   .2219181   .0204734    10.84   0.000      .181791    .2620451
       10#Equal-earners  |   .2121742   .0167755    12.65   0.000     .1792949    .2450535
  11#Man primary-earner  |   .2316273   .0256417     9.03   0.000     .1813704    .2818842
11#Woman primary-earner  |   .2433991   .0240445    10.12   0.000     .1962728    .2905254
       11#Equal-earners  |   .2233421   .0198711    11.24   0.000     .1843955    .2622888
  12#Man primary-earner  |   .2511765   .0322547     7.79   0.000     .1879583    .3143946
12#Woman primary-earner  |   .2657842   .0291952     9.10   0.000     .2085627    .3230057
       12#Equal-earners  |   .2346498   .0239997     9.78   0.000     .1876112    .2816884
  13#Man primary-earner  |   .2708087   .0400314     6.76   0.000     .1923486    .3492688
13#Woman primary-earner  |   .2889959   .0357388     8.09   0.000     .2189492    .3590427
       13#Equal-earners  |   .2460896   .0289543     8.50   0.000     .1893403    .3028389
------------------------------------------------------------------------------------------

. margin  relinc, at(flfp=(39(1)51)) predict(outcome(4))  /* Keep Sep             */

Predictive margins                              Number of obs     =      7,894
Model VCE    : Robust

Expression   : Pr(pool==Keep_All___Separate), predict(outcome(4))

1._at        : flfp            =          39

2._at        : flfp            =          40

3._at        : flfp            =          41

4._at        : flfp            =          42

5._at        : flfp            =          43

6._at        : flfp            =          44

7._at        : flfp            =          45

8._at        : flfp            =          46

9._at        : flfp            =          47

10._at       : flfp            =          48

11._at       : flfp            =          49

12._at       : flfp            =          50

13._at       : flfp            =          51

------------------------------------------------------------------------------------------
                         |            Delta-method
                         |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------------------+----------------------------------------------------------------
              _at#relinc |
   1#Man primary-earner  |   .0401152    .014371     2.79   0.005     .0119486    .0682818
 1#Woman primary-earner  |   .0971678   .0316957     3.07   0.002     .0350454    .1592902
        1#Equal-earners  |   .0776947   .0311839     2.49   0.013     .0165754     .138814
   2#Man primary-earner  |   .0474471   .0138093     3.44   0.001     .0203813    .0745129
 2#Woman primary-earner  |   .1013822   .0275397     3.68   0.000     .0474053    .1553591
        2#Equal-earners  |   .0803389    .027408     2.93   0.003     .0266203    .1340576
   3#Man primary-earner  |   .0552917   .0128508     4.30   0.000     .0301046    .0804788
 3#Woman primary-earner  |   .1051766    .023487     4.48   0.000     .0591428    .1512104
        3#Equal-earners  |    .082802   .0236793     3.50   0.000     .0363914    .1292125
   4#Man primary-earner  |   .0635092   .0116273     5.46   0.000     .0407201    .0862983
 4#Woman primary-earner  |   .1085004   .0197029     5.51   0.000     .0698834    .1471175
        4#Equal-earners  |   .0850745   .0201506     4.22   0.000     .0455802    .1245689
   5#Man primary-earner  |   .0719493   .0103899     6.92   0.000     .0515855    .0923131
 5#Woman primary-earner  |   .1113129   .0164112     6.78   0.000     .0791476    .1434783
        5#Equal-earners  |   .0871504   .0170677     5.11   0.000     .0536983    .1206025
   6#Man primary-earner  |    .080465   .0095676     8.41   0.000     .0617128    .0992171
 6#Woman primary-earner  |   .1135837   .0139292     8.15   0.000      .086283    .1408844
        6#Equal-earners  |    .089026   .0148226     6.01   0.000     .0599743    .1180777
   7#Man primary-earner  |   .0889239   .0097271     9.14   0.000     .0698592    .1079886
 7#Woman primary-earner  |   .1152935   .0126397     9.12   0.000     .0905201     .140067
        7#Equal-earners  |   .0907006   .0139166     6.52   0.000     .0634245    .1179767
   8#Man primary-earner  |    .097216   .0112316     8.66   0.000     .0752024    .1192296
 8#Woman primary-earner  |   .1164337   .0127695     9.12   0.000      .091406    .1414614
        8#Equal-earners  |   .0921755   .0146605     6.29   0.000     .0634416    .1209095
   9#Man primary-earner  |    .105257    .013979     7.53   0.000     .0778586    .1326554
 9#Woman primary-earner  |   .1170059   .0141387     8.28   0.000     .0892945    .1447173
        9#Equal-earners  |   .0934541   .0168702     5.54   0.000     .0603891    .1265192
  10#Man primary-earner  |   .1129882   .0176646     6.40   0.000     .0783662    .1476103
10#Woman primary-earner  |   .1170213   .0163119     7.17   0.000     .0850505     .148992
       10#Equal-earners  |   .0945414   .0200824     4.71   0.000     .0551807    .1339021
  11#Man primary-earner  |   .1203732   .0220466     5.46   0.000     .0771627    .1635837
11#Woman primary-earner  |   .1164993   .0189032     6.16   0.000     .0794496    .1535489
       11#Equal-earners  |   .0954435   .0238989     3.99   0.000     .0486024    .1422845
  12#Man primary-earner  |   .1273931   .0269785     4.72   0.000     .0745163      .18027
12#Woman primary-earner  |   .1154664   .0216672     5.33   0.000     .0729996    .1579333
       12#Equal-earners  |   .0961676   .0280697     3.43   0.001     .0411521    .1511832
  13#Man primary-earner  |   .1340419   .0323742     4.14   0.000     .0705895    .1974942
13#Woman primary-earner  |   .1139552   .0244614     4.66   0.000     .0660117    .1618987
       13#Equal-earners  |   .0967218   .0324483     2.98   0.003     .0331243    .1603193
------------------------------------------------------------------------------------------

. 
. **********************************************************************************************************************
. *Table 4 - Model 6
. **********************************************************************************************************************
. global  ivars "i.marst sex age parent i.employ homemaker ib4.degree hswrk respmom famlife"

. 
. mlogit          pool    c.flfp##i.marst                 i.relinc $ivars                                         , cluster(country) rrr

Iteration 0:   log pseudolikelihood = -9464.1045  
Iteration 1:   log pseudolikelihood = -8433.3201  
Iteration 2:   log pseudolikelihood = -8367.2856  
Iteration 3:   log pseudolikelihood = -8366.6191  
Iteration 4:   log pseudolikelihood = -8366.6189  

Multinomial logistic regression                 Number of obs     =      7,894
                                                Wald chi2(15)     =          .
                                                Prob > chi2       =          .
Log pseudolikelihood = -8366.6189               Pseudo R2         =     0.1160

                                        (Std. Err. adjusted for 19 clusters in country)
---------------------------------------------------------------------------------------
                      |               Robust
                 pool |        RRR   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
One___Manager         |
                 flfp |    .818079   .0591528    -2.78   0.005     .7099821    .9426339
                      |
                marst |
               Cohab  |   .7428139   1.079295    -0.20   0.838     .0430625    12.81328
                      |
         marst#c.flfp |
               Cohab  |   1.013317   .0329584     0.41   0.684     .9507353    1.080018
                      |
               relinc |
Woman primary-earner  |   .9549447   .1388189    -0.32   0.751     .7181915    1.269744
       Equal-earners  |   .6491801   .1326394    -2.11   0.034     .4349598    .9689054
                      |
                  sex |   .7808505   .0701343    -2.75   0.006     .6548092     .931153
                  age |   .9831824   .0057581    -2.90   0.004     .9719612    .9945331
               parent |   .9376805   .1302543    -0.46   0.643     .7141895    1.231108
                      |
               employ |
            Parttime  |    1.37136   .2000759     2.16   0.030     1.030302    1.825317
          Unemployed  |   1.403689   .4326878     1.10   0.271     .7671632     2.56835
             Student  |   1.600832   .2335524     3.23   0.001     1.202709    2.130744
  Not in labor force  |   .8117852   .1049356    -1.61   0.107     .6301013    1.045856
                      |
            homemaker |   1.097369   .1264709     0.81   0.420     .8754928    1.375476
                      |
               degree |
 No formal education  |   1.994356    .415602     3.31   0.001     1.325628    3.000432
      Primary school  |   1.462859   .2540137     2.19   0.028     1.040874    2.055922
     Lower secondary  |   1.042957   .1561021     0.28   0.779     .7777945    1.398518
      Post secondary  |   .9846964   .2018609    -0.08   0.940      .658882    1.471625
Lower level tertiary  |   .7585556   .1628338    -1.29   0.198     .4980419    1.155338
Upper level tertiary  |   .4960178    .075901    -4.58   0.000     .3674902    .6694972
                      |
                hswrk |   .9236364   .0262404    -2.80   0.005     .8736118    .9765254
              respmom |   .9865814   .0962195    -0.14   0.890     .8149234    1.194398
              famlife |   .7529797   .0453138    -4.71   0.000     .6692041    .8472429
                _cons |   65851.05   197081.3     3.71   0.000     186.6627    2.32e+07
----------------------+----------------------------------------------------------------
Manage___Together     |  (base outcome)
----------------------+----------------------------------------------------------------
Keep_Some___Separate  |
                 flfp |   1.077544   .0452249     1.78   0.075     .9924523     1.16993
                      |
                marst |
               Cohab  |   .0181328   .0560131    -1.30   0.194     .0000426    7.724437
                      |
         marst#c.flfp |
               Cohab  |   1.121768   .0757862     1.70   0.089     .9826438    1.280589
                      |
               relinc |
Woman primary-earner  |   1.121811    .122127     1.06   0.291     .9062601     1.38863
       Equal-earners  |   1.033906   .1251682     0.28   0.783     .8155143    1.310782
                      |
                  sex |   1.130073   .1112819     1.24   0.214     .9317209    1.370651
                  age |   .9827758   .0043661    -3.91   0.000     .9742555    .9913706
               parent |    .939871   .0953793    -0.61   0.541     .7703485    1.146699
                      |
               employ |
            Parttime  |    .640635   .1076365    -2.65   0.008     .4608884    .8904828
          Unemployed  |   .6184554   .1277036    -2.33   0.020     .4126155     .926982
             Student  |   .6106555   .0733906    -4.10   0.000     .4824986    .7728522
  Not in labor force  |   .8704755   .1247609    -0.97   0.333     .6572916    1.152803
                      |
            homemaker |   .7457699   .0791315    -2.76   0.006     .6057401    .9181707
                      |
               degree |
 No formal education  |   .6497479   .2540176    -1.10   0.270     .3019739    1.398042
      Primary school  |   .7875626   .1520451    -1.24   0.216     .5394535    1.149784
     Lower secondary  |   .8483021   .1202537    -1.16   0.246     .6425188    1.119993
      Post secondary  |   .8488792   .1129084    -1.23   0.218     .6540766      1.1017
Lower level tertiary  |   1.356228   .1494961     2.76   0.006     1.092711    1.683294
Upper level tertiary  |   1.723631   .1888901     4.97   0.000     1.390473    2.136615
                      |
                hswrk |   .9687169   .0192642    -1.60   0.110     .9316861     1.00722
              respmom |   1.219753    .144056     1.68   0.093     .9677047     1.53745
              famlife |   .8341816   .0282505    -5.35   0.000     .7806093    .8914305
                _cons |   .0541891   .1004123    -1.57   0.116     .0014343    2.047321
----------------------+----------------------------------------------------------------
Keep_All___Separate   |
                 flfp |   1.012113   .0474463     0.26   0.797     .9232644    1.109512
                      |
                marst |
               Cohab  |   .0020015   .0051354    -2.42   0.015     .0000131    .3057373
                      |
         marst#c.flfp |
               Cohab  |    1.18568   .0653271     3.09   0.002     1.064312    1.320888
                      |
               relinc |
Woman primary-earner  |   1.285901   .1953762     1.66   0.098      .954725    1.731955
       Equal-earners  |   .9014774   .1065249    -0.88   0.380     .7151068     1.13642
                      |
                  sex |   1.285443    .104633     3.08   0.002     1.095888    1.507784
                  age |   .9942508   .0084287    -0.68   0.496     .9778673    1.010909
               parent |   1.010852   .1235882     0.09   0.930     .7954602    1.284567
                      |
               employ |
            Parttime  |   .5191484   .1103064    -3.09   0.002     .3423197    .7873196
          Unemployed  |   1.211457    .372421     0.62   0.533     .6631856    2.212997
             Student  |   .5226204   .0918412    -3.69   0.000     .3703419    .7375131
  Not in labor force  |   1.180073   .1490303     1.31   0.190     .9213223    1.511494
                      |
            homemaker |   .6779287   .0793845    -3.32   0.001     .5389017    .8528221
                      |
               degree |
 No formal education  |   .6307856   .2437933    -1.19   0.233     .2957329    1.345439
      Primary school  |   1.172394   .4496228     0.41   0.678     .5528802    2.486088
     Lower secondary  |   .9422306   .1598457    -0.35   0.726     .6757005    1.313893
      Post secondary  |    1.12084   .1447378     0.88   0.377     .8702121     1.44365
Lower level tertiary  |    1.29102   .1539076     2.14   0.032     1.022016    1.630827
Upper level tertiary  |   1.274982   .2485696     1.25   0.213     .8700706    1.868331
                      |
                hswrk |   1.024707   .0259739     0.96   0.336      .975043    1.076901
              respmom |   .9401272   .1547453    -0.38   0.708     .6808924     1.29806
              famlife |    .700414   .0268509    -9.29   0.000     .6497157    .7550682
                _cons |   .8041718   1.974787    -0.09   0.929     .0065324    98.99789
---------------------------------------------------------------------------------------
Note: _cons estimates baseline relative risk for each outcome.

. estat           ic

Akaike's information criterion and Bayesian information criterion

-----------------------------------------------------------------------------
       Model |        Obs  ll(null)  ll(model)      df         AIC        BIC
-------------+---------------------------------------------------------------
           . |      7,894 -9464.105  -8366.619      18    16769.24   16894.77
-----------------------------------------------------------------------------
               Note: N=Obs used in calculating BIC; see [R] BIC note.

. 
. 
. // Figure D
. mlogit          pool    c.flfp##i.marst                 i.relinc $ivars                                         , cluster(country)

Iteration 0:   log pseudolikelihood = -9464.1045  
Iteration 1:   log pseudolikelihood = -8433.3201  
Iteration 2:   log pseudolikelihood = -8367.2856  
Iteration 3:   log pseudolikelihood = -8366.6191  
Iteration 4:   log pseudolikelihood = -8366.6189  

Multinomial logistic regression                 Number of obs     =      7,894
                                                Wald chi2(15)     =          .
                                                Prob > chi2       =          .
Log pseudolikelihood = -8366.6189               Pseudo R2         =     0.1160

                                        (Std. Err. adjusted for 19 clusters in country)
---------------------------------------------------------------------------------------
                      |               Robust
                 pool |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
One___Manager         |
                 flfp |  -.2007964    .072307    -2.78   0.005    -.3425155   -.0590773
                      |
                marst |
               Cohab  |  -.2973098   1.452982    -0.20   0.838    -3.145102    2.550482
                      |
         marst#c.flfp |
               Cohab  |   .0132288   .0325253     0.41   0.684    -.0505196    .0769773
                      |
               relinc |
Woman primary-earner  |  -.0461019   .1453686    -0.32   0.751     -.331019    .2388153
       Equal-earners  |  -.4320451   .2043184    -2.11   0.034    -.8325018   -.0315883
                      |
                  sex |  -.2473715   .0898179    -2.75   0.006    -.4234114   -.0713317
                  age |  -.0169607   .0058566    -2.90   0.004    -.0284394   -.0054819
               parent |   -.064346   .1389112    -0.46   0.643     -.336607    .2079149
                      |
               employ |
            Parttime  |   .3158028    .145896     2.16   0.030     .0298519    .6017537
          Unemployed  |    .339104   .3082504     1.10   0.271    -.2650557    .9432636
             Student  |   .4705237   .1458943     3.23   0.001     .1845761    .7564714
  Not in labor force  |  -.2085195   .1292652    -1.61   0.107    -.4618746    .0448357
                      |
            homemaker |   .0929159   .1152491     0.81   0.420    -.1329683       .3188
                      |
               degree |
 No formal education  |    .690321   .2083891     3.31   0.001     .2818859    1.098756
      Primary school  |   .3803927    .173642     2.19   0.028     .0400607    .7207247
     Lower secondary  |   .0420599   .1496726     0.28   0.779    -.2512929    .3354128
      Post secondary  |  -.0154219   .2049981    -0.08   0.940    -.4172108    .3863671
Lower level tertiary  |  -.2763392    .214663    -1.29   0.198     -.697071    .1443926
Upper level tertiary  |  -.7011435   .1530208    -4.58   0.000    -1.001059   -.4012283
                      |
                hswrk |  -.0794368   .0284099    -2.80   0.005    -.1351191   -.0237546
              respmom |  -.0135094   .0975282    -0.14   0.890    -.2046612    .1776424
              famlife |   -.283717   .0601792    -4.71   0.000    -.4016661   -.1657678
                _cons |   11.09515   2.992834     3.71   0.000     5.229303      16.961
----------------------+----------------------------------------------------------------
Manage___Together     |  (base outcome)
----------------------+----------------------------------------------------------------
Keep_Some___Separate  |
                 flfp |    .074684   .0419703     1.78   0.075    -.0075764    .1569443
                      |
                marst |
               Cohab  |  -4.010032   3.089047    -1.30   0.194    -10.06445    2.044389
                      |
         marst#c.flfp |
               Cohab  |   .1149058   .0675596     1.70   0.089    -.0175086    .2473201
                      |
               relinc |
Woman primary-earner  |   .1149444    .108866     1.06   0.291     -.098429    .3283177
       Equal-earners  |   .0333436   .1210634     0.28   0.783    -.2039363    .2706236
                      |
                  sex |   .1222819   .0984732     1.24   0.214    -.0707219    .3152858
                  age |  -.0173743   .0044427    -3.91   0.000    -.0260817   -.0086668
               parent |  -.0620127   .1014813    -0.61   0.541    -.2609123     .136887
                      |
               employ |
            Parttime  |  -.4452954   .1680153    -2.65   0.008    -.7745993   -.1159915
          Unemployed  |  -.4805302    .206488    -2.33   0.020    -.8852392   -.0758211
             Student  |  -.4932224   .1201833    -4.10   0.000    -.7287772   -.2576675
  Not in labor force  |  -.1387157    .143325    -0.97   0.333    -.4196275    .1421961
                      |
            homemaker |  -.2933382   .1061071    -2.76   0.006    -.5013043    -.085372
                      |
               degree |
 No formal education  |  -.4311709   .3909479    -1.10   0.270    -1.197415     .335073
      Primary school  |  -.2388125   .1930578    -1.24   0.216    -.6171987    .1395738
     Lower secondary  |  -.1645184   .1417581    -1.16   0.246    -.4423591    .1133223
      Post secondary  |  -.1638384   .1330088    -1.23   0.218    -.4245308    .0968541
Lower level tertiary  |   .3047071   .1102294     2.76   0.006     .0886615    .5207527
Upper level tertiary  |   .5444332   .1095885     4.97   0.000     .3296437    .7592227
                      |
                hswrk |  -.0317828   .0198863    -1.60   0.110    -.0707593    .0071936
              respmom |   .1986485   .1181026     1.68   0.093    -.0328283    .4301253
              famlife |  -.1813042   .0338661    -5.35   0.000    -.2476805   -.1149278
                _cons |  -2.915275   1.852997    -1.57   0.116    -6.547082    .7165321
----------------------+----------------------------------------------------------------
Keep_All___Separate   |
                 flfp |   .0120405   .0468784     0.26   0.797    -.0798396    .1039205
                      |
                marst |
               Cohab  |  -6.213848   2.565771    -2.42   0.015    -11.24267   -1.185029
                      |
         marst#c.flfp |
               Cohab  |   .1703166   .0550967     3.09   0.002     .0623289    .2783042
                      |
               relinc |
Woman primary-earner  |   .2514595   .1519372     1.66   0.098     -.046332    .5492509
       Equal-earners  |  -.1037203    .118167    -0.88   0.380    -.3353234    .1278827
                      |
                  sex |   .2511033   .0813984     3.08   0.002     .0915654    .4106412
                  age |  -.0057658   .0084774    -0.68   0.496    -.0223813    .0108497
               parent |   .0107935   .1222614     0.09   0.930    -.2288344    .2504215
                      |
               employ |
            Parttime  |  -.6555655   .2124756    -3.09   0.002     -1.07201    -.239121
          Unemployed  |   .1918236   .3074158     0.62   0.533    -.4107003    .7943476
             Student  |     -.6489   .1757321    -3.69   0.000    -.9933285   -.3044714
  Not in labor force  |   .1655766    .126289     1.31   0.190    -.0819453    .4130986
                      |
            homemaker |  -.3887132   .1170985    -3.32   0.001    -.6182221   -.1592043
                      |
               degree |
 No formal education  |  -.4607892   .3864916    -1.19   0.233    -1.218299    .2967203
      Primary school  |   .1590482   .3835081     0.41   0.678    -.5926139    .9107103
     Lower secondary  |  -.0595053    .169646    -0.35   0.726    -.3920054    .2729949
      Post secondary  |   .1140783   .1291333     0.88   0.377    -.1390184    .3671749
Lower level tertiary  |   .2554324    .119214     2.14   0.032     .0217774    .4890875
Upper level tertiary  |   .2429322   .1949592     1.25   0.213    -.1391809    .6250453
                      |
                hswrk |   .0244068   .0253477     0.96   0.336    -.0252737    .0740873
              respmom |  -.0617401   .1646004    -0.38   0.708     -.384351    .2608708
              famlife |  -.3560837   .0383357    -9.29   0.000    -.4312203   -.2809471
                _cons |  -.2179423   2.455678    -0.09   0.929    -5.030983    4.595099
---------------------------------------------------------------------------------------

. margin          i.marst, at(flfp=(39(1)51)) predict(outcome(1))         /* One Manages  */

Predictive margins                              Number of obs     =      7,894
Model VCE    : Robust

Expression   : Pr(pool==One___Manager), predict(outcome(1))

1._at        : flfp            =          39

2._at        : flfp            =          40

3._at        : flfp            =          41

4._at        : flfp            =          42

5._at        : flfp            =          43

6._at        : flfp            =          44

7._at        : flfp            =          45

8._at        : flfp            =          46

9._at        : flfp            =          47

10._at       : flfp            =          48

11._at       : flfp            =          49

12._at       : flfp            =          50

13._at       : flfp            =          51

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   _at#marst |
  1#Married  |   .4641362    .088187     5.26   0.000     .2912928    .6369795
    1#Cohab  |   .4878579   .0777273     6.28   0.000     .3355152    .6402006
  2#Married  |   .4164271   .0711245     5.85   0.000     .2770257    .5558285
    2#Cohab  |   .4321885   .0644348     6.71   0.000     .3058987    .5584784
  3#Married  |   .3700425   .0546153     6.78   0.000     .2629985    .4770865
    3#Cohab  |   .3767554   .0508871     7.40   0.000     .2770185    .4764922
  4#Married  |   .3257059   .0400512     8.13   0.000      .247207    .4042047
    4#Cohab  |   .3229024    .038627     8.36   0.000      .247195    .3986099
  5#Married  |   .2840242   .0292612     9.71   0.000     .2266734     .341375
    5#Cohab  |   .2719176   .0295505     9.20   0.000     .2139997    .3298356
  6#Married  |    .245461   .0243449    10.08   0.000     .1977458    .2931762
    6#Cohab  |   .2249123   .0252664     8.90   0.000      .175391    .2744336
  7#Married  |   .2103243    .025232     8.34   0.000     .1608705    .2597781
    7#Cohab  |   .1827223   .0252048     7.25   0.000     .1333218    .2321228
  8#Married  |   .1787686   .0287097     6.23   0.000     .1224986    .2350385
    8#Cohab  |   .1458493   .0267249     5.46   0.000     .0934694    .1982292
  9#Married  |   .1508086   .0321163     4.70   0.000     .0878618    .2137555
    9#Cohab  |   .1144501   .0277661     4.12   0.000     .0600296    .1688707
 10#Married  |   .1263419   .0343975     3.67   0.000     .0589241    .1937598
   10#Cohab  |   .0883711   .0275649     3.21   0.001      .034345    .1423973
 11#Married  |   .1051752   .0353312     2.98   0.003     .0359274    .1744231
   11#Cohab  |   .0672151   .0261153     2.57   0.010       .01603    .1184001
 12#Married  |   .0870523   .0350322     2.48   0.013     .0183905    .1557141
   12#Cohab  |   .0504236   .0237278     2.13   0.034     .0039179    .0969293
 13#Married  |   .0716795   .0337398     2.12   0.034     .0055507    .1378082
   13#Cohab  |   .0373596   .0207943     1.80   0.072    -.0033964    .0781156
------------------------------------------------------------------------------

. margin          i.marst, at(flfp=(39(1)51)) predict(outcome(2))         /* Manage Equal */

Predictive margins                              Number of obs     =      7,894
Model VCE    : Robust

Expression   : Pr(pool==Manage___Together), predict(outcome(2))

1._at        : flfp            =          39

2._at        : flfp            =          40

3._at        : flfp            =          41

4._at        : flfp            =          42

5._at        : flfp            =          43

6._at        : flfp            =          44

7._at        : flfp            =          45

8._at        : flfp            =          46

9._at        : flfp            =          47

10._at       : flfp            =          48

11._at       : flfp            =          49

12._at       : flfp            =          50

13._at       : flfp            =          51

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   _at#marst |
  1#Married  |   .4152134   .0760257     5.46   0.000     .2662057    .5642212
    1#Cohab  |   .3523563    .040347     8.73   0.000     .2732776    .4314351
  2#Married  |   .4479803   .0631073     7.10   0.000     .3242922    .5716685
    2#Cohab  |   .3689035   .0315661    11.69   0.000     .3070352    .4307718
  3#Married  |   .4788485   .0509017     9.41   0.000      .379083    .5786139
    3#Cohab  |   .3799232   .0256599    14.81   0.000     .3296308    .4302157
  4#Married  |   .5072424   .0405115    12.52   0.000     .4278413    .5866435
    4#Cohab  |   .3846848   .0228344    16.85   0.000     .3399302    .4294394
  5#Married  |   .5326967   .0331481    16.07   0.000     .4677276    .5976659
    5#Cohab  |   .3828504   .0217111    17.63   0.000     .3402975    .4254033
  6#Married  |   .5548748   .0297542    18.65   0.000     .4965577     .613192
    6#Cohab  |    .374525    .020684    18.11   0.000     .3339851    .4150649
  7#Married  |   .5735752   .0301336    19.03   0.000     .5145143     .632636
    7#Cohab  |   .3602438   .0192819    18.68   0.000     .3224519    .3980357
  8#Married  |   .5887258   .0329353    17.88   0.000     .5241738    .6532779
    8#Cohab  |    .340902   .0183251    18.60   0.000     .3049854    .3768186
  9#Married  |   .6003699   .0368512    16.29   0.000     .5281429    .6725969
    9#Cohab  |   .3176401   .0192019    16.54   0.000     .2800049    .3552752
 10#Married  |   .6086445   .0412204    14.77   0.000     .5278539    .6894351
   10#Cohab  |   .2917106   .0223544    13.05   0.000     .2478967    .3355244
 11#Married  |   .6137567    .045872    13.38   0.000     .5238492    .7036643
   11#Cohab  |   .2643497   .0268512     9.85   0.000     .2117224     .316977
 12#Married  |   .6159604   .0508626    12.11   0.000     .5162715    .7156493
   12#Cohab  |   .2366736   .0315042     7.51   0.000     .1749264    .2984207
 13#Married  |   .6155342   .0563089    10.93   0.000     .5051708    .7258976
   13#Cohab  |   .2096104   .0355048     5.90   0.000     .1400223    .2791985
------------------------------------------------------------------------------

. margin          i.marst, at(flfp=(39(1)51)) predict(outcome(3))         /* Pool Some    */

Predictive margins                              Number of obs     =      7,894
Model VCE    : Robust

Expression   : Pr(pool==Keep_Some___Separate), predict(outcome(3))

1._at        : flfp            =          39

2._at        : flfp            =          40

3._at        : flfp            =          41

4._at        : flfp            =          42

5._at        : flfp            =          43

6._at        : flfp            =          44

7._at        : flfp            =          45

8._at        : flfp            =          46

9._at        : flfp            =          47

10._at       : flfp            =          48

11._at       : flfp            =          49

12._at       : flfp            =          50

13._at       : flfp            =          51

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   _at#marst |
  1#Married  |   .0682008   .0156285     4.36   0.000     .0375696    .0988321
    1#Cohab  |   .0920395   .0299263     3.08   0.002     .0333851    .1506939
  2#Married  |   .0786381   .0157678     4.99   0.000     .0477339    .1095424
    2#Cohab  |   .1147987   .0297817     3.85   0.000     .0564277    .1731697
  3#Married  |   .0898389   .0156764     5.73   0.000     .0591136    .1205641
    3#Cohab  |   .1407225   .0284875     4.94   0.000     .0848881     .196557
  4#Married  |   .1017295   .0153224     6.64   0.000      .071698    .1317609
    4#Cohab  |   .1694884   .0262912     6.45   0.000     .1179586    .2210182
  5#Married  |     .11423   .0147166     7.76   0.000     .0853859    .1430741
    5#Cohab  |   .2005777   .0237946     8.43   0.000     .1539412    .2472142
  6#Married  |     .12726   .0139708     9.11   0.000     .0998777    .1546424
    6#Cohab  |   .2333131   .0220141    10.60   0.000     .1901663    .2764598
  7#Married  |   .1407433   .0133839    10.52   0.000     .1145114    .1669752
    7#Cohab  |   .2669179   .0221407    12.06   0.000     .2235229    .3103129
  8#Married  |    .154612   .0135058    11.45   0.000     .1281412    .1810829
    8#Cohab  |   .3005891    .024763    12.14   0.000     .2520545    .3491237
  9#Married  |   .1688094   .0149917    11.26   0.000     .1394262    .1981926
    9#Cohab  |   .3335684   .0294768    11.32   0.000     .2757949    .3913418
 10#Married  |   .1832906   .0181982    10.07   0.000     .1476228    .2189583
   10#Cohab  |   .3652011    .035533    10.28   0.000     .2955577    .4348445
 11#Married  |   .1980226   .0230406     8.59   0.000     .1528639    .2431813
   11#Cohab  |   .3949751   .0423973     9.32   0.000      .311878    .4780723
 12#Married  |   .2129833   .0292527     7.28   0.000     .1556491    .2703175
   12#Cohab  |   .4225362   .0498081     8.48   0.000     .3249142    .5201583
 13#Married  |   .2281591   .0365876     6.24   0.000     .1564488    .2998694
   13#Cohab  |   .4476838    .057671     7.76   0.000     .3346506     .560717
------------------------------------------------------------------------------

. margin          i.marst, at(flfp=(39(1)51)) predict(outcome(4))         /* Keep Sep             */

Predictive margins                              Number of obs     =      7,894
Model VCE    : Robust

Expression   : Pr(pool==Keep_All___Separate), predict(outcome(4))

1._at        : flfp            =          39

2._at        : flfp            =          40

3._at        : flfp            =          41

4._at        : flfp            =          42

5._at        : flfp            =          43

6._at        : flfp            =          44

7._at        : flfp            =          45

8._at        : flfp            =          46

9._at        : flfp            =          47

10._at       : flfp            =          48

11._at       : flfp            =          49

12._at       : flfp            =          50

13._at       : flfp            =          51

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   _at#marst |
  1#Married  |   .0524496   .0208653     2.51   0.012     .0115544    .0933447
    1#Cohab  |   .0677463   .0231649     2.92   0.003      .022344    .1131486
  2#Married  |   .0569545   .0189941     3.00   0.003     .0197267    .0941822
    2#Cohab  |   .0841093   .0227562     3.70   0.000      .039508    .1287106
  3#Married  |   .0612702   .0169289     3.62   0.000     .0280901    .0944503
    3#Cohab  |   .1025988   .0212975     4.82   0.000     .0608565    .1443412
  4#Married  |   .0653223    .014817     4.41   0.000     .0362814    .0943631
    4#Cohab  |   .1229244   .0189618     6.48   0.000     .0857599    .1600889
  5#Married  |   .0690491   .0128653     5.37   0.000     .0438336    .0942646
    5#Cohab  |   .1446542    .016294     8.88   0.000     .1127187    .1765898
  6#Married  |   .0724042   .0113677     6.37   0.000      .050124    .0946844
    6#Cohab  |   .1672497   .0144667    11.56   0.000     .1388954     .195604
  7#Married  |   .0753573    .010686     7.05   0.000     .0544131    .0963015
    7#Cohab  |    .190116   .0151363    12.56   0.000     .1604494    .2197826
  8#Married  |   .0778936   .0110831     7.03   0.000     .0561711    .0996161
    8#Cohab  |   .2126596   .0189023    11.25   0.000     .1756118    .2497074
  9#Married  |    .080012   .0125151     6.39   0.000     .0554828    .1045412
    9#Cohab  |   .2343414   .0248614     9.43   0.000     .1856139     .283069
 10#Married  |    .081723   .0147056     5.56   0.000     .0529006    .1105453
   10#Cohab  |   .2547172   .0320773     7.94   0.000     .1918468    .3175875
 11#Married  |   .0830454   .0173708     4.78   0.000     .0489993    .1170915
   11#Cohab  |   .2734601   .0400437     6.83   0.000      .194976    .3519443
 12#Married  |    .084004   .0203126     4.14   0.000     .0441921    .1238159
   12#Cohab  |   .2903666   .0485177     5.98   0.000     .1952736    .3854596
 13#Married  |   .0846272   .0234068     3.62   0.000     .0387507    .1305037
   13#Cohab  |   .3053462   .0573783     5.32   0.000     .1928868    .4178056
------------------------------------------------------------------------------

. 
. 
. **********************************************************************************************************************
. * Figure data
. **********************************************************************************************************************
. // Figure C
. global  ivars " sex age parent i.employ homemaker ib4.degree hswrk respmom famlife"

. 
. mlogit  pool    c.flfp##i.relinc        i.marst         $ivars                                          , cluster(country)

Iteration 0:   log pseudolikelihood = -9464.1045  
Iteration 1:   log pseudolikelihood = -8424.3537  
Iteration 2:   log pseudolikelihood =  -8364.919  
Iteration 3:   log pseudolikelihood = -8364.2563  
Iteration 4:   log pseudolikelihood =  -8364.256  

Multinomial logistic regression                 Number of obs     =      7,894
                                                Wald chi2(15)     =          .
                                                Prob > chi2       =          .
Log pseudolikelihood =  -8364.256               Pseudo R2         =     0.1162

                                        (Std. Err. adjusted for 19 clusters in country)
---------------------------------------------------------------------------------------
                      |               Robust
                 pool |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
One___Manager         |
                 flfp |  -.2272624   .0683392    -3.33   0.001    -.3612047   -.0933202
                      |
               relinc |
Woman primary-earner  |  -3.838277   2.573451    -1.49   0.136    -8.882148    1.205595
       Equal-earners  |  -5.027841   1.637474    -3.07   0.002    -8.237232    -1.81845
                      |
        relinc#c.flfp |
Woman primary-earner  |    .085831   .0566227     1.52   0.130    -.0251474    .1968093
       Equal-earners  |   .1039658    .035181     2.96   0.003     .0350123    .1729193
                      |
                marst |
               Cohab  |   .3414119   .1018091     3.35   0.001     .1418697    .5409541
                  sex |  -.2495283   .0896351    -2.78   0.005      -.42521   -.0738467
                  age |  -.0164529   .0060125    -2.74   0.006    -.0282371   -.0046687
               parent |  -.0588192   .1395543    -0.42   0.673    -.3323406    .2147023
                      |
               employ |
            Parttime  |   .3053629   .1454672     2.10   0.036     .0202524    .5904733
          Unemployed  |   .3383725   .3057315     1.11   0.268    -.2608503    .9375954
             Student  |   .4584465    .143954     3.18   0.001     .1763019    .7405912
  Not in labor force  |  -.2069311   .1313886    -1.57   0.115     -.464448    .0505858
                      |
            homemaker |   .0993409   .1194483     0.83   0.406    -.1347734    .3334553
                      |
               degree |
 No formal education  |   .6869894   .2043418     3.36   0.001     .2864869    1.087492
      Primary school  |    .377465   .1795449     2.10   0.036     .0255634    .7293666
     Lower secondary  |   .0430295   .1513712     0.28   0.776    -.2536527    .3397116
      Post secondary  |  -.0174011   .2031711    -0.09   0.932    -.4156091    .3808069
Lower level tertiary  |  -.2730973   .2119834    -1.29   0.198    -.6885771    .1423824
Upper level tertiary  |  -.6996361   .1514674    -4.62   0.000    -.9965069   -.4027654
                      |
                hswrk |  -.0801155   .0277765    -2.88   0.004    -.1345564   -.0256746
              respmom |   -.005574   .0956424    -0.06   0.954    -.1930296    .1818817
              famlife |  -.2808278   .0600795    -4.67   0.000    -.3985815    -.163074
                _cons |    12.1905   2.803559     4.35   0.000     6.695622    17.68537
----------------------+----------------------------------------------------------------
Manage___Together     |  (base outcome)
----------------------+----------------------------------------------------------------
Keep_Some___Separate  |
                 flfp |   .1079061   .0417684     2.58   0.010     .0260415    .1897706
                      |
               relinc |
Woman primary-earner  |   .1279839   2.320332     0.06   0.956    -4.419783    4.675751
       Equal-earners  |   2.423744   1.940733     1.25   0.212    -1.380024    6.227511
                      |
        relinc#c.flfp |
Woman primary-earner  |   -.000082   .0490774    -0.00   0.999    -.0962719    .0961079
       Equal-earners  |  -.0514036   .0421674    -1.22   0.223    -.1340501    .0312429
                      |
                marst |
               Cohab  |   1.248396   .1356107     9.21   0.000     .9826042    1.514188
                  sex |   .1182193   .0985908     1.20   0.230    -.0750151    .3114538
                  age |  -.0171718   .0042564    -4.03   0.000    -.0255141   -.0088295
               parent |  -.0682201   .0986031    -0.69   0.489    -.2614787    .1250384
                      |
               employ |
            Parttime  |  -.4334793   .1626321    -2.67   0.008    -.7522323   -.1147263
          Unemployed  |  -.4565089   .2005768    -2.28   0.023    -.8496321   -.0633857
             Student  |  -.4838131   .1218494    -3.97   0.000    -.7226336   -.2449925
  Not in labor force  |  -.1223206   .1425521    -0.86   0.391    -.4017177    .1570764
                      |
            homemaker |   -.298406    .106604    -2.80   0.005     -.507346   -.0894661
                      |
               degree |
 No formal education  |   -.445172   .4104155    -1.08   0.278    -1.249572    .3592276
      Primary school  |  -.2633491   .1865701    -1.41   0.158    -.6290197    .1023215
     Lower secondary  |  -.1579141   .1405909    -1.12   0.261    -.4334672     .117639
      Post secondary  |  -.1676727   .1326218    -1.26   0.206    -.4276067    .0922614
Lower level tertiary  |   .3044161   .1109205     2.74   0.006     .0870158    .5218163
Upper level tertiary  |   .5425762   .1082601     5.01   0.000     .3303902    .7547622
                      |
                hswrk |  -.0308403   .0200735    -1.54   0.124    -.0701836    .0085031
              respmom |   .1887852   .1193255     1.58   0.114    -.0450884    .4226588
              famlife |  -.1763658   .0341774    -5.16   0.000    -.2433522   -.1093794
                _cons |  -4.458071   1.882045    -2.37   0.018    -8.146812   -.7693309
----------------------+----------------------------------------------------------------
Keep_All___Separate   |
                 flfp |   .0852112   .0463442     1.84   0.066    -.0056217    .1760442
                      |
               relinc |
Woman primary-earner  |   3.687008   1.821543     2.02   0.043     .1168504    7.257166
       Equal-earners  |   3.151375   1.846654     1.71   0.088    -.4680001     6.77075
                      |
        relinc#c.flfp |
Woman primary-earner  |  -.0743694   .0389948    -1.91   0.056    -.1507978    .0020589
       Equal-earners  |  -.0703747   .0395019    -1.78   0.075     -.147797    .0070475
                      |
                marst |
               Cohab  |     1.5945   .1735035     9.19   0.000     1.254439     1.93456
                  sex |   .2498508    .081862     3.05   0.002     .0894044    .4102973
                  age |  -.0054639   .0084678    -0.65   0.519    -.0220605    .0111327
               parent |   .0003883   .1231368     0.00   0.997    -.2409553     .241732
                      |
               employ |
            Parttime  |  -.6478392   .2032817    -3.19   0.001    -1.046264   -.2494143
          Unemployed  |   .2326142   .3014289     0.77   0.440    -.3581756     .823404
             Student  |  -.6287558   .1695433    -3.71   0.000    -.9610546   -.2964571
  Not in labor force  |   .1767472   .1230695     1.44   0.151    -.0644646    .4179589
                      |
            homemaker |  -.3955371    .116814    -3.39   0.001    -.6244883   -.1665859
                      |
               degree |
 No formal education  |   -.558434   .3427737    -1.63   0.103    -1.230258    .1133901
      Primary school  |   .1292106   .3599421     0.36   0.720    -.5762629    .8346842
     Lower secondary  |   -.044724   .1719277    -0.26   0.795    -.3816961     .292248
      Post secondary  |   .1095461   .1244458     0.88   0.379    -.1343631    .3534554
Lower level tertiary  |   .2568344   .1131815     2.27   0.023     .0350028     .478666
Upper level tertiary  |   .2450511   .1959567     1.25   0.211     -.139017    .6291192
                      |
                hswrk |   .0253347   .0252096     1.00   0.315    -.0240752    .0747445
              respmom |  -.0743628   .1642678    -0.45   0.651    -.3963218    .2475962
              famlife |  -.3500345   .0386338    -9.06   0.000    -.4257553   -.2743137
                _cons |   -3.60221   2.471712    -1.46   0.145    -8.446676    1.242256
---------------------------------------------------------------------------------------

. margin          relinc, at(flfp=(39(1)51)) predict(outcome(1)) post             /* One Manages  */

Predictive margins                              Number of obs     =      7,894
Model VCE    : Robust

Expression   : Pr(pool==One___Manager), predict(outcome(1))

1._at        : flfp            =          39

2._at        : flfp            =          40

3._at        : flfp            =          41

4._at        : flfp            =          42

5._at        : flfp            =          43

6._at        : flfp            =          44

7._at        : flfp            =          45

8._at        : flfp            =          46

9._at        : flfp            =          47

10._at       : flfp            =          48

11._at       : flfp            =          49

12._at       : flfp            =          50

13._at       : flfp            =          51

------------------------------------------------------------------------------------------
                         |            Delta-method
                         |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------------------+----------------------------------------------------------------
              _at#relinc |
   1#Man primary-earner  |   .5241831   .0780588     6.72   0.000     .3711906    .6771755
 1#Woman primary-earner  |    .388505   .1257292     3.09   0.002     .1420803    .6349297
        1#Equal-earners  |   .2900907   .0875825     3.31   0.001     .1184321    .4617492
   2#Man primary-earner  |   .4668437   .0630746     7.40   0.000     .3432198    .5904676
 2#Woman primary-earner  |   .3547289   .1030746     3.44   0.001     .1527064    .5567515
        2#Equal-earners  |   .2650194   .0706775     3.75   0.000      .126494    .4035449
   3#Man primary-earner  |    .410063   .0479234     8.56   0.000     .3161348    .5039912
 3#Woman primary-earner  |   .3220598   .0816121     3.95   0.000     .1621031    .4820165
        3#Equal-earners  |   .2412563   .0556561     4.33   0.000     .1321723    .3503403
   4#Man primary-earner  |    .355205   .0346035    10.27   0.000     .2873834    .4230266
 4#Woman primary-earner  |   .2907463   .0621177     4.68   0.000     .1689978    .4124947
        4#Equal-earners  |   .2188687   .0430075     5.09   0.000     .1345756    .3031618
   5#Man primary-earner  |    .303478   .0257984    11.76   0.000     .2529142    .3540419
 5#Woman primary-earner  |   .2609994   .0455432     5.73   0.000     .1717363    .3502625
        5#Equal-earners  |   .1978994   .0333959     5.93   0.000     .1324445    .2633542
   6#Man primary-earner  |   .2558411   .0237091    10.79   0.000     .2093721    .3023102
 6#Woman primary-earner  |   .2329883   .0333008     7.00   0.000       .16772    .2982567
        6#Equal-earners  |    .178368   .0276134     6.46   0.000     .1242467    .2324892
   7#Man primary-earner  |   .2129485   .0263991     8.07   0.000     .1612072    .2646898
 7#Woman primary-earner  |   .2068377   .0272808     7.58   0.000     .1533684     .260307
        7#Equal-earners  |   .1602728   .0259299     6.18   0.000     .1094511    .2110945
   8#Man primary-earner  |    .175137   .0299546     5.85   0.000     .1164271    .2338469
 8#Woman primary-earner  |   .1826279   .0277497     6.58   0.000     .1282395    .2370164
        8#Equal-earners  |   .1435934   .0272887     5.26   0.000     .0901086    .1970782
   9#Man primary-earner  |   .1424522   .0323791     4.40   0.000     .0789902    .2059141
 9#Woman primary-earner  |   .1603966   .0317147     5.06   0.000     .0982371    .2225562
        9#Equal-earners  |   .1282931   .0300057     4.28   0.000     .0694829    .1871032
  10#Man primary-earner  |   .1147005   .0331767     3.46   0.001     .0496753    .1797257
10#Woman primary-earner  |   .1401422   .0362228     3.87   0.000     .0691469    .2111375
       10#Equal-earners  |   .1143217   .0328822     3.48   0.001     .0498738    .1787696
  11#Man primary-earner  |   .0915148   .0324735     2.82   0.005     .0278679    .1551617
11#Woman primary-earner  |   .1218282   .0399185     3.05   0.002     .0435894     .200067
       11#Equal-earners  |   .1016186   .0353297     2.88   0.004     .0323737    .1708635
  12#Man primary-earner  |   .0724204   .0306151     2.37   0.018      .012416    .1324248
12#Woman primary-earner  |    .105389   .0423692     2.49   0.013     .0223469    .1884312
       12#Equal-earners  |   .0901153   .0371206     2.43   0.015     .0173603    .1628703
  13#Man primary-earner  |   .0568938   .0279901     2.03   0.042     .0020342    .1117534
13#Woman primary-earner  |   .0907354   .0435322     2.08   0.037     .0054139    .1760569
       13#Equal-earners  |   .0797377   .0382054     2.09   0.037     .0048564     .154619
------------------------------------------------------------------------------------------

. est store       oneman

. 
. mlogit          pool    c.flfp##i.relinc        i.marst         $ivars                                  , cluster(country)

Iteration 0:   log pseudolikelihood = -9464.1045  
Iteration 1:   log pseudolikelihood = -8424.3537  
Iteration 2:   log pseudolikelihood =  -8364.919  
Iteration 3:   log pseudolikelihood = -8364.2563  
Iteration 4:   log pseudolikelihood =  -8364.256  

Multinomial logistic regression                 Number of obs     =      7,894
                                                Wald chi2(15)     =          .
                                                Prob > chi2       =          .
Log pseudolikelihood =  -8364.256               Pseudo R2         =     0.1162

                                        (Std. Err. adjusted for 19 clusters in country)
---------------------------------------------------------------------------------------
                      |               Robust
                 pool |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
One___Manager         |
                 flfp |  -.2272624   .0683392    -3.33   0.001    -.3612047   -.0933202
                      |
               relinc |
Woman primary-earner  |  -3.838277   2.573451    -1.49   0.136    -8.882148    1.205595
       Equal-earners  |  -5.027841   1.637474    -3.07   0.002    -8.237232    -1.81845
                      |
        relinc#c.flfp |
Woman primary-earner  |    .085831   .0566227     1.52   0.130    -.0251474    .1968093
       Equal-earners  |   .1039658    .035181     2.96   0.003     .0350123    .1729193
                      |
                marst |
               Cohab  |   .3414119   .1018091     3.35   0.001     .1418697    .5409541
                  sex |  -.2495283   .0896351    -2.78   0.005      -.42521   -.0738467
                  age |  -.0164529   .0060125    -2.74   0.006    -.0282371   -.0046687
               parent |  -.0588192   .1395543    -0.42   0.673    -.3323406    .2147023
                      |
               employ |
            Parttime  |   .3053629   .1454672     2.10   0.036     .0202524    .5904733
          Unemployed  |   .3383725   .3057315     1.11   0.268    -.2608503    .9375954
             Student  |   .4584465    .143954     3.18   0.001     .1763019    .7405912
  Not in labor force  |  -.2069311   .1313886    -1.57   0.115     -.464448    .0505858
                      |
            homemaker |   .0993409   .1194483     0.83   0.406    -.1347734    .3334553
                      |
               degree |
 No formal education  |   .6869894   .2043418     3.36   0.001     .2864869    1.087492
      Primary school  |    .377465   .1795449     2.10   0.036     .0255634    .7293666
     Lower secondary  |   .0430295   .1513712     0.28   0.776    -.2536527    .3397116
      Post secondary  |  -.0174011   .2031711    -0.09   0.932    -.4156091    .3808069
Lower level tertiary  |  -.2730973   .2119834    -1.29   0.198    -.6885771    .1423824
Upper level tertiary  |  -.6996361   .1514674    -4.62   0.000    -.9965069   -.4027654
                      |
                hswrk |  -.0801155   .0277765    -2.88   0.004    -.1345564   -.0256746
              respmom |   -.005574   .0956424    -0.06   0.954    -.1930296    .1818817
              famlife |  -.2808278   .0600795    -4.67   0.000    -.3985815    -.163074
                _cons |    12.1905   2.803559     4.35   0.000     6.695622    17.68537
----------------------+----------------------------------------------------------------
Manage___Together     |  (base outcome)
----------------------+----------------------------------------------------------------
Keep_Some___Separate  |
                 flfp |   .1079061   .0417684     2.58   0.010     .0260415    .1897706
                      |
               relinc |
Woman primary-earner  |   .1279839   2.320332     0.06   0.956    -4.419783    4.675751
       Equal-earners  |   2.423744   1.940733     1.25   0.212    -1.380024    6.227511
                      |
        relinc#c.flfp |
Woman primary-earner  |   -.000082   .0490774    -0.00   0.999    -.0962719    .0961079
       Equal-earners  |  -.0514036   .0421674    -1.22   0.223    -.1340501    .0312429
                      |
                marst |
               Cohab  |   1.248396   .1356107     9.21   0.000     .9826042    1.514188
                  sex |   .1182193   .0985908     1.20   0.230    -.0750151    .3114538
                  age |  -.0171718   .0042564    -4.03   0.000    -.0255141   -.0088295
               parent |  -.0682201   .0986031    -0.69   0.489    -.2614787    .1250384
                      |
               employ |
            Parttime  |  -.4334793   .1626321    -2.67   0.008    -.7522323   -.1147263
          Unemployed  |  -.4565089   .2005768    -2.28   0.023    -.8496321   -.0633857
             Student  |  -.4838131   .1218494    -3.97   0.000    -.7226336   -.2449925
  Not in labor force  |  -.1223206   .1425521    -0.86   0.391    -.4017177    .1570764
                      |
            homemaker |   -.298406    .106604    -2.80   0.005     -.507346   -.0894661
                      |
               degree |
 No formal education  |   -.445172   .4104155    -1.08   0.278    -1.249572    .3592276
      Primary school  |  -.2633491   .1865701    -1.41   0.158    -.6290197    .1023215
     Lower secondary  |  -.1579141   .1405909    -1.12   0.261    -.4334672     .117639
      Post secondary  |  -.1676727   .1326218    -1.26   0.206    -.4276067    .0922614
Lower level tertiary  |   .3044161   .1109205     2.74   0.006     .0870158    .5218163
Upper level tertiary  |   .5425762   .1082601     5.01   0.000     .3303902    .7547622
                      |
                hswrk |  -.0308403   .0200735    -1.54   0.124    -.0701836    .0085031
              respmom |   .1887852   .1193255     1.58   0.114    -.0450884    .4226588
              famlife |  -.1763658   .0341774    -5.16   0.000    -.2433522   -.1093794
                _cons |  -4.458071   1.882045    -2.37   0.018    -8.146812   -.7693309
----------------------+----------------------------------------------------------------
Keep_All___Separate   |
                 flfp |   .0852112   .0463442     1.84   0.066    -.0056217    .1760442
                      |
               relinc |
Woman primary-earner  |   3.687008   1.821543     2.02   0.043     .1168504    7.257166
       Equal-earners  |   3.151375   1.846654     1.71   0.088    -.4680001     6.77075
                      |
        relinc#c.flfp |
Woman primary-earner  |  -.0743694   .0389948    -1.91   0.056    -.1507978    .0020589
       Equal-earners  |  -.0703747   .0395019    -1.78   0.075     -.147797    .0070475
                      |
                marst |
               Cohab  |     1.5945   .1735035     9.19   0.000     1.254439     1.93456
                  sex |   .2498508    .081862     3.05   0.002     .0894044    .4102973
                  age |  -.0054639   .0084678    -0.65   0.519    -.0220605    .0111327
               parent |   .0003883   .1231368     0.00   0.997    -.2409553     .241732
                      |
               employ |
            Parttime  |  -.6478392   .2032817    -3.19   0.001    -1.046264   -.2494143
          Unemployed  |   .2326142   .3014289     0.77   0.440    -.3581756     .823404
             Student  |  -.6287558   .1695433    -3.71   0.000    -.9610546   -.2964571
  Not in labor force  |   .1767472   .1230695     1.44   0.151    -.0644646    .4179589
                      |
            homemaker |  -.3955371    .116814    -3.39   0.001    -.6244883   -.1665859
                      |
               degree |
 No formal education  |   -.558434   .3427737    -1.63   0.103    -1.230258    .1133901
      Primary school  |   .1292106   .3599421     0.36   0.720    -.5762629    .8346842
     Lower secondary  |   -.044724   .1719277    -0.26   0.795    -.3816961     .292248
      Post secondary  |   .1095461   .1244458     0.88   0.379    -.1343631    .3534554
Lower level tertiary  |   .2568344   .1131815     2.27   0.023     .0350028     .478666
Upper level tertiary  |   .2450511   .1959567     1.25   0.211     -.139017    .6291192
                      |
                hswrk |   .0253347   .0252096     1.00   0.315    -.0240752    .0747445
              respmom |  -.0743628   .1642678    -0.45   0.651    -.3963218    .2475962
              famlife |  -.3500345   .0386338    -9.06   0.000    -.4257553   -.2743137
                _cons |   -3.60221   2.471712    -1.46   0.145    -8.446676    1.242256
---------------------------------------------------------------------------------------

. margin          relinc, at(flfp=(39(1)51)) predict(outcome(2))  post            /* Manage Equal */

Predictive margins                              Number of obs     =      7,894
Model VCE    : Robust

Expression   : Pr(pool==Manage___Together), predict(outcome(2))

1._at        : flfp            =          39

2._at        : flfp            =          40

3._at        : flfp            =          41

4._at        : flfp            =          42

5._at        : flfp            =          43

6._at        : flfp            =          44

7._at        : flfp            =          45

8._at        : flfp            =          46

9._at        : flfp            =          47

10._at       : flfp            =          48

11._at       : flfp            =          49

12._at       : flfp            =          50

13._at       : flfp            =          51

------------------------------------------------------------------------------------------
                         |            Delta-method
                         |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------------------+----------------------------------------------------------------
              _at#relinc |
   1#Man primary-earner  |   .3743745   .0673286     5.56   0.000     .2424128    .5063362
 1#Woman primary-earner  |   .4371079   .1017436     4.30   0.000     .2376942    .6365216
        1#Equal-earners  |   .5122576   .0739124     6.93   0.000     .3673918    .6571233
   2#Man primary-earner  |   .4116138   .0556379     7.40   0.000     .3025656    .5206621
 2#Woman primary-earner  |   .4551673   .0851804     5.34   0.000     .2882167    .6221178
        2#Equal-earners  |   .5253715   .0632668     8.30   0.000     .4013707    .6493722
   3#Man primary-earner  |   .4464066   .0444196    10.05   0.000     .3593457    .5334675
 3#Woman primary-earner  |   .4714004   .0697396     6.76   0.000     .3347133    .6080875
        3#Equal-earners  |   .5370799   .0542185     9.91   0.000     .4308135    .6433462
   4#Man primary-earner  |    .477665   .0351692    13.58   0.000     .4087347    .5465954
 4#Woman primary-earner  |   .4855897    .055987     8.67   0.000     .3758572    .5953222
        4#Equal-earners  |   .5473459    .046907    11.67   0.000       .45541    .6392819
   5#Man primary-earner  |   .5045005   .0293111    17.21   0.000     .4470518    .5619491
 5#Woman primary-earner  |    .497557   .0445646    11.16   0.000      .410212     .584902
        5#Equal-earners  |   .5561535    .041384    13.44   0.000     .4750423    .6372647
   6#Man primary-earner  |   .5262861   .0273832    19.22   0.000      .472616    .5799562
 6#Woman primary-earner  |   .5071676   .0362414    13.99   0.000     .4361358    .5781995
        6#Equal-earners  |   .5635053   .0375828    14.99   0.000     .4898444    .6371663
   7#Man primary-earner  |   .5426837   .0283726    19.13   0.000     .4870744    .5982929
 7#Woman primary-earner  |    .514332   .0317583    16.20   0.000     .4520868    .5765771
        7#Equal-earners  |   .5694214   .0353089    16.13   0.000     .5002172    .6386257
   8#Man primary-earner  |   .5536342   .0307405    18.01   0.000     .4933839    .6138846
 8#Woman primary-earner  |   .5190057   .0312073    16.63   0.000     .4578405    .5801708
        8#Equal-earners  |   .5739366   .0342819    16.74   0.000     .5067454    .6411278
   9#Man primary-earner  |   .5593195   .0336336    16.63   0.000      .493399    .6252401
 9#Woman primary-earner  |   .5211879   .0336398    15.49   0.000     .4552551    .5871207
        9#Equal-earners  |   .5770979   .0342154    16.87   0.000     .5100371    .6441588
  10#Man primary-earner  |   .5601064   .0369208    15.17   0.000      .487743    .6324697
10#Woman primary-earner  |   .5209185   .0377856    13.79   0.000       .44686    .5949769
       10#Equal-earners  |   .5789627   .0348881    16.59   0.000     .5105832    .6473423
  11#Man primary-earner  |   .5564847   .0407931    13.64   0.000     .4765318    .6364376
11#Woman primary-earner  |   .5182734   .0427918    12.11   0.000     .4344029    .6021438
       11#Equal-earners  |   .5795958   .0361704    16.02   0.000     .5087031    .6504885
  12#Man primary-earner  |     .54901   .0454465    12.08   0.000     .4599364    .6380836
12#Woman primary-earner  |   .5133603   .0482686    10.64   0.000     .4187557    .6079649
       12#Equal-earners  |   .5790673   .0380098    15.23   0.000     .5045694    .6535652
  13#Man primary-earner  |   .5382557   .0509372    10.57   0.000     .4384205    .6380908
13#Woman primary-earner  |   .5063135   .0540892     9.36   0.000     .4003006    .6123263
       13#Equal-earners  |   .5774509   .0403991    14.29   0.000     .4982702    .6566316
------------------------------------------------------------------------------------------

. est store       equal

. 
. mlogit          pool    c.flfp##i.relinc        i.marst         $ivars                                  , cluster(country)

Iteration 0:   log pseudolikelihood = -9464.1045  
Iteration 1:   log pseudolikelihood = -8424.3537  
Iteration 2:   log pseudolikelihood =  -8364.919  
Iteration 3:   log pseudolikelihood = -8364.2563  
Iteration 4:   log pseudolikelihood =  -8364.256  

Multinomial logistic regression                 Number of obs     =      7,894
                                                Wald chi2(15)     =          .
                                                Prob > chi2       =          .
Log pseudolikelihood =  -8364.256               Pseudo R2         =     0.1162

                                        (Std. Err. adjusted for 19 clusters in country)
---------------------------------------------------------------------------------------
                      |               Robust
                 pool |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
One___Manager         |
                 flfp |  -.2272624   .0683392    -3.33   0.001    -.3612047   -.0933202
                      |
               relinc |
Woman primary-earner  |  -3.838277   2.573451    -1.49   0.136    -8.882148    1.205595
       Equal-earners  |  -5.027841   1.637474    -3.07   0.002    -8.237232    -1.81845
                      |
        relinc#c.flfp |
Woman primary-earner  |    .085831   .0566227     1.52   0.130    -.0251474    .1968093
       Equal-earners  |   .1039658    .035181     2.96   0.003     .0350123    .1729193
                      |
                marst |
               Cohab  |   .3414119   .1018091     3.35   0.001     .1418697    .5409541
                  sex |  -.2495283   .0896351    -2.78   0.005      -.42521   -.0738467
                  age |  -.0164529   .0060125    -2.74   0.006    -.0282371   -.0046687
               parent |  -.0588192   .1395543    -0.42   0.673    -.3323406    .2147023
                      |
               employ |
            Parttime  |   .3053629   .1454672     2.10   0.036     .0202524    .5904733
          Unemployed  |   .3383725   .3057315     1.11   0.268    -.2608503    .9375954
             Student  |   .4584465    .143954     3.18   0.001     .1763019    .7405912
  Not in labor force  |  -.2069311   .1313886    -1.57   0.115     -.464448    .0505858
                      |
            homemaker |   .0993409   .1194483     0.83   0.406    -.1347734    .3334553
                      |
               degree |
 No formal education  |   .6869894   .2043418     3.36   0.001     .2864869    1.087492
      Primary school  |    .377465   .1795449     2.10   0.036     .0255634    .7293666
     Lower secondary  |   .0430295   .1513712     0.28   0.776    -.2536527    .3397116
      Post secondary  |  -.0174011   .2031711    -0.09   0.932    -.4156091    .3808069
Lower level tertiary  |  -.2730973   .2119834    -1.29   0.198    -.6885771    .1423824
Upper level tertiary  |  -.6996361   .1514674    -4.62   0.000    -.9965069   -.4027654
                      |
                hswrk |  -.0801155   .0277765    -2.88   0.004    -.1345564   -.0256746
              respmom |   -.005574   .0956424    -0.06   0.954    -.1930296    .1818817
              famlife |  -.2808278   .0600795    -4.67   0.000    -.3985815    -.163074
                _cons |    12.1905   2.803559     4.35   0.000     6.695622    17.68537
----------------------+----------------------------------------------------------------
Manage___Together     |  (base outcome)
----------------------+----------------------------------------------------------------
Keep_Some___Separate  |
                 flfp |   .1079061   .0417684     2.58   0.010     .0260415    .1897706
                      |
               relinc |
Woman primary-earner  |   .1279839   2.320332     0.06   0.956    -4.419783    4.675751
       Equal-earners  |   2.423744   1.940733     1.25   0.212    -1.380024    6.227511
                      |
        relinc#c.flfp |
Woman primary-earner  |   -.000082   .0490774    -0.00   0.999    -.0962719    .0961079
       Equal-earners  |  -.0514036   .0421674    -1.22   0.223    -.1340501    .0312429
                      |
                marst |
               Cohab  |   1.248396   .1356107     9.21   0.000     .9826042    1.514188
                  sex |   .1182193   .0985908     1.20   0.230    -.0750151    .3114538
                  age |  -.0171718   .0042564    -4.03   0.000    -.0255141   -.0088295
               parent |  -.0682201   .0986031    -0.69   0.489    -.2614787    .1250384
                      |
               employ |
            Parttime  |  -.4334793   .1626321    -2.67   0.008    -.7522323   -.1147263
          Unemployed  |  -.4565089   .2005768    -2.28   0.023    -.8496321   -.0633857
             Student  |  -.4838131   .1218494    -3.97   0.000    -.7226336   -.2449925
  Not in labor force  |  -.1223206   .1425521    -0.86   0.391    -.4017177    .1570764
                      |
            homemaker |   -.298406    .106604    -2.80   0.005     -.507346   -.0894661
                      |
               degree |
 No formal education  |   -.445172   .4104155    -1.08   0.278    -1.249572    .3592276
      Primary school  |  -.2633491   .1865701    -1.41   0.158    -.6290197    .1023215
     Lower secondary  |  -.1579141   .1405909    -1.12   0.261    -.4334672     .117639
      Post secondary  |  -.1676727   .1326218    -1.26   0.206    -.4276067    .0922614
Lower level tertiary  |   .3044161   .1109205     2.74   0.006     .0870158    .5218163
Upper level tertiary  |   .5425762   .1082601     5.01   0.000     .3303902    .7547622
                      |
                hswrk |  -.0308403   .0200735    -1.54   0.124    -.0701836    .0085031
              respmom |   .1887852   .1193255     1.58   0.114    -.0450884    .4226588
              famlife |  -.1763658   .0341774    -5.16   0.000    -.2433522   -.1093794
                _cons |  -4.458071   1.882045    -2.37   0.018    -8.146812   -.7693309
----------------------+----------------------------------------------------------------
Keep_All___Separate   |
                 flfp |   .0852112   .0463442     1.84   0.066    -.0056217    .1760442
                      |
               relinc |
Woman primary-earner  |   3.687008   1.821543     2.02   0.043     .1168504    7.257166
       Equal-earners  |   3.151375   1.846654     1.71   0.088    -.4680001     6.77075
                      |
        relinc#c.flfp |
Woman primary-earner  |  -.0743694   .0389948    -1.91   0.056    -.1507978    .0020589
       Equal-earners  |  -.0703747   .0395019    -1.78   0.075     -.147797    .0070475
                      |
                marst |
               Cohab  |     1.5945   .1735035     9.19   0.000     1.254439     1.93456
                  sex |   .2498508    .081862     3.05   0.002     .0894044    .4102973
                  age |  -.0054639   .0084678    -0.65   0.519    -.0220605    .0111327
               parent |   .0003883   .1231368     0.00   0.997    -.2409553     .241732
                      |
               employ |
            Parttime  |  -.6478392   .2032817    -3.19   0.001    -1.046264   -.2494143
          Unemployed  |   .2326142   .3014289     0.77   0.440    -.3581756     .823404
             Student  |  -.6287558   .1695433    -3.71   0.000    -.9610546   -.2964571
  Not in labor force  |   .1767472   .1230695     1.44   0.151    -.0644646    .4179589
                      |
            homemaker |  -.3955371    .116814    -3.39   0.001    -.6244883   -.1665859
                      |
               degree |
 No formal education  |   -.558434   .3427737    -1.63   0.103    -1.230258    .1133901
      Primary school  |   .1292106   .3599421     0.36   0.720    -.5762629    .8346842
     Lower secondary  |   -.044724   .1719277    -0.26   0.795    -.3816961     .292248
      Post secondary  |   .1095461   .1244458     0.88   0.379    -.1343631    .3534554
Lower level tertiary  |   .2568344   .1131815     2.27   0.023     .0350028     .478666
Upper level tertiary  |   .2450511   .1959567     1.25   0.211     -.139017    .6291192
                      |
                hswrk |   .0253347   .0252096     1.00   0.315    -.0240752    .0747445
              respmom |  -.0743628   .1642678    -0.45   0.651    -.3963218    .2475962
              famlife |  -.3500345   .0386338    -9.06   0.000    -.4257553   -.2743137
                _cons |   -3.60221   2.471712    -1.46   0.145    -8.446676    1.242256
---------------------------------------------------------------------------------------

. margin          relinc, at(flfp=(39(1)51)) predict(outcome(3))  post            /* Pool Some    */

Predictive margins                              Number of obs     =      7,894
Model VCE    : Robust

Expression   : Pr(pool==Keep_Some___Separate), predict(outcome(3))

1._at        : flfp            =          39

2._at        : flfp            =          40

3._at        : flfp            =          41

4._at        : flfp            =          42

5._at        : flfp            =          43

6._at        : flfp            =          44

7._at        : flfp            =          45

8._at        : flfp            =          46

9._at        : flfp            =          47

10._at       : flfp            =          48

11._at       : flfp            =          49

12._at       : flfp            =          50

13._at       : flfp            =          51

------------------------------------------------------------------------------------------
                         |            Delta-method
                         |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------------------+----------------------------------------------------------------
              _at#relinc |
   1#Man primary-earner  |   .0613272   .0143271     4.28   0.000     .0332467    .0894078
 1#Woman primary-earner  |   .0772193   .0196779     3.92   0.000     .0386512    .1157873
        1#Equal-earners  |   .1199571   .0239607     5.01   0.000     .0729951    .1669191
   2#Man primary-earner  |   .0740954   .0147909     5.01   0.000     .0451059     .103085
 2#Woman primary-earner  |   .0887216   .0198382     4.47   0.000     .0498394    .1276038
        2#Equal-earners  |   .1292702   .0225791     5.73   0.000      .085016    .1735244
   3#Man primary-earner  |   .0882387    .015056     5.86   0.000     .0587295     .117748
 3#Woman primary-earner  |   .1013632   .0198073     5.12   0.000     .0625417    .1401847
        3#Equal-earners  |   .1388619   .0210574     6.59   0.000     .0975901    .1801337
   4#Man primary-earner  |   .1036208   .0151043     6.86   0.000      .074017    .1332246
 4#Woman primary-earner  |   .1151636   .0195686     5.89   0.000     .0768098    .1535174
        4#Equal-earners  |   .1487109   .0194259     7.66   0.000     .1106367     .186785
   5#Man primary-earner  |   .1200722   .0149408     8.04   0.000     .0907887    .1493556
 5#Woman primary-earner  |   .1301306   .0191313     6.80   0.000      .092634    .1676272
        5#Equal-earners  |   .1587968   .0177528     8.94   0.000      .124002    .1935916
   6#Man primary-earner  |   .1374078   .0146589     9.37   0.000     .1086769    .1661386
 6#Woman primary-earner  |   .1462603   .0185607     7.88   0.000      .109882    .1826386
        6#Equal-earners  |   .1691007   .0161732    10.46   0.000     .1374017    .2007996
   7#Man primary-earner  |    .155444   .0145333    10.70   0.000     .1269592    .1839287
 7#Woman primary-earner  |   .1635368   .0180251     9.07   0.000     .1282082    .1988654
        7#Equal-earners  |   .1796051   .0149281    12.03   0.000     .1503465    .2088637
   8#Man primary-earner  |   .1740128   .0150813    11.54   0.000      .144454    .2035717
 8#Woman primary-earner  |   .1819327   .0178461    10.19   0.000      .146955    .2169105
        8#Equal-earners  |   .1902945     .01438    13.23   0.000     .1621102    .2184788
   9#Man primary-earner  |   .1929713   .0169277    11.40   0.000     .1597936     .226149
 9#Woman primary-earner  |   .2014095   .0184989    10.89   0.000     .1651524    .2376666
        9#Equal-earners  |   .2011549   .0149238    13.48   0.000     .1719048     .230405
  10#Man primary-earner  |   .2122049   .0204542    10.37   0.000     .1721153    .2522945
10#Woman primary-earner  |   .2219181   .0204734    10.84   0.000      .181791    .2620451
       10#Equal-earners  |   .2121742   .0167755    12.65   0.000     .1792949    .2450535
  11#Man primary-earner  |   .2316273   .0256417     9.03   0.000     .1813704    .2818842
11#Woman primary-earner  |   .2433991   .0240445    10.12   0.000     .1962728    .2905254
       11#Equal-earners  |   .2233421   .0198711    11.24   0.000     .1843955    .2622888
  12#Man primary-earner  |   .2511765   .0322547     7.79   0.000     .1879583    .3143946
12#Woman primary-earner  |   .2657842   .0291952     9.10   0.000     .2085627    .3230057
       12#Equal-earners  |   .2346498   .0239997     9.78   0.000     .1876112    .2816884
  13#Man primary-earner  |   .2708087   .0400314     6.76   0.000     .1923486    .3492688
13#Woman primary-earner  |   .2889959   .0357388     8.09   0.000     .2189492    .3590427
       13#Equal-earners  |   .2460896   .0289543     8.50   0.000     .1893403    .3028389
------------------------------------------------------------------------------------------

. est store       some

. 
. mlogit          pool    c.flfp##i.relinc        i.marst         $ivars                                  , cluster(country)

Iteration 0:   log pseudolikelihood = -9464.1045  
Iteration 1:   log pseudolikelihood = -8424.3537  
Iteration 2:   log pseudolikelihood =  -8364.919  
Iteration 3:   log pseudolikelihood = -8364.2563  
Iteration 4:   log pseudolikelihood =  -8364.256  

Multinomial logistic regression                 Number of obs     =      7,894
                                                Wald chi2(15)     =          .
                                                Prob > chi2       =          .
Log pseudolikelihood =  -8364.256               Pseudo R2         =     0.1162

                                        (Std. Err. adjusted for 19 clusters in country)
---------------------------------------------------------------------------------------
                      |               Robust
                 pool |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
One___Manager         |
                 flfp |  -.2272624   .0683392    -3.33   0.001    -.3612047   -.0933202
                      |
               relinc |
Woman primary-earner  |  -3.838277   2.573451    -1.49   0.136    -8.882148    1.205595
       Equal-earners  |  -5.027841   1.637474    -3.07   0.002    -8.237232    -1.81845
                      |
        relinc#c.flfp |
Woman primary-earner  |    .085831   .0566227     1.52   0.130    -.0251474    .1968093
       Equal-earners  |   .1039658    .035181     2.96   0.003     .0350123    .1729193
                      |
                marst |
               Cohab  |   .3414119   .1018091     3.35   0.001     .1418697    .5409541
                  sex |  -.2495283   .0896351    -2.78   0.005      -.42521   -.0738467
                  age |  -.0164529   .0060125    -2.74   0.006    -.0282371   -.0046687
               parent |  -.0588192   .1395543    -0.42   0.673    -.3323406    .2147023
                      |
               employ |
            Parttime  |   .3053629   .1454672     2.10   0.036     .0202524    .5904733
          Unemployed  |   .3383725   .3057315     1.11   0.268    -.2608503    .9375954
             Student  |   .4584465    .143954     3.18   0.001     .1763019    .7405912
  Not in labor force  |  -.2069311   .1313886    -1.57   0.115     -.464448    .0505858
                      |
            homemaker |   .0993409   .1194483     0.83   0.406    -.1347734    .3334553
                      |
               degree |
 No formal education  |   .6869894   .2043418     3.36   0.001     .2864869    1.087492
      Primary school  |    .377465   .1795449     2.10   0.036     .0255634    .7293666
     Lower secondary  |   .0430295   .1513712     0.28   0.776    -.2536527    .3397116
      Post secondary  |  -.0174011   .2031711    -0.09   0.932    -.4156091    .3808069
Lower level tertiary  |  -.2730973   .2119834    -1.29   0.198    -.6885771    .1423824
Upper level tertiary  |  -.6996361   .1514674    -4.62   0.000    -.9965069   -.4027654
                      |
                hswrk |  -.0801155   .0277765    -2.88   0.004    -.1345564   -.0256746
              respmom |   -.005574   .0956424    -0.06   0.954    -.1930296    .1818817
              famlife |  -.2808278   .0600795    -4.67   0.000    -.3985815    -.163074
                _cons |    12.1905   2.803559     4.35   0.000     6.695622    17.68537
----------------------+----------------------------------------------------------------
Manage___Together     |  (base outcome)
----------------------+----------------------------------------------------------------
Keep_Some___Separate  |
                 flfp |   .1079061   .0417684     2.58   0.010     .0260415    .1897706
                      |
               relinc |
Woman primary-earner  |   .1279839   2.320332     0.06   0.956    -4.419783    4.675751
       Equal-earners  |   2.423744   1.940733     1.25   0.212    -1.380024    6.227511
                      |
        relinc#c.flfp |
Woman primary-earner  |   -.000082   .0490774    -0.00   0.999    -.0962719    .0961079
       Equal-earners  |  -.0514036   .0421674    -1.22   0.223    -.1340501    .0312429
                      |
                marst |
               Cohab  |   1.248396   .1356107     9.21   0.000     .9826042    1.514188
                  sex |   .1182193   .0985908     1.20   0.230    -.0750151    .3114538
                  age |  -.0171718   .0042564    -4.03   0.000    -.0255141   -.0088295
               parent |  -.0682201   .0986031    -0.69   0.489    -.2614787    .1250384
                      |
               employ |
            Parttime  |  -.4334793   .1626321    -2.67   0.008    -.7522323   -.1147263
          Unemployed  |  -.4565089   .2005768    -2.28   0.023    -.8496321   -.0633857
             Student  |  -.4838131   .1218494    -3.97   0.000    -.7226336   -.2449925
  Not in labor force  |  -.1223206   .1425521    -0.86   0.391    -.4017177    .1570764
                      |
            homemaker |   -.298406    .106604    -2.80   0.005     -.507346   -.0894661
                      |
               degree |
 No formal education  |   -.445172   .4104155    -1.08   0.278    -1.249572    .3592276
      Primary school  |  -.2633491   .1865701    -1.41   0.158    -.6290197    .1023215
     Lower secondary  |  -.1579141   .1405909    -1.12   0.261    -.4334672     .117639
      Post secondary  |  -.1676727   .1326218    -1.26   0.206    -.4276067    .0922614
Lower level tertiary  |   .3044161   .1109205     2.74   0.006     .0870158    .5218163
Upper level tertiary  |   .5425762   .1082601     5.01   0.000     .3303902    .7547622
                      |
                hswrk |  -.0308403   .0200735    -1.54   0.124    -.0701836    .0085031
              respmom |   .1887852   .1193255     1.58   0.114    -.0450884    .4226588
              famlife |  -.1763658   .0341774    -5.16   0.000    -.2433522   -.1093794
                _cons |  -4.458071   1.882045    -2.37   0.018    -8.146812   -.7693309
----------------------+----------------------------------------------------------------
Keep_All___Separate   |
                 flfp |   .0852112   .0463442     1.84   0.066    -.0056217    .1760442
                      |
               relinc |
Woman primary-earner  |   3.687008   1.821543     2.02   0.043     .1168504    7.257166
       Equal-earners  |   3.151375   1.846654     1.71   0.088    -.4680001     6.77075
                      |
        relinc#c.flfp |
Woman primary-earner  |  -.0743694   .0389948    -1.91   0.056    -.1507978    .0020589
       Equal-earners  |  -.0703747   .0395019    -1.78   0.075     -.147797    .0070475
                      |
                marst |
               Cohab  |     1.5945   .1735035     9.19   0.000     1.254439     1.93456
                  sex |   .2498508    .081862     3.05   0.002     .0894044    .4102973
                  age |  -.0054639   .0084678    -0.65   0.519    -.0220605    .0111327
               parent |   .0003883   .1231368     0.00   0.997    -.2409553     .241732
                      |
               employ |
            Parttime  |  -.6478392   .2032817    -3.19   0.001    -1.046264   -.2494143
          Unemployed  |   .2326142   .3014289     0.77   0.440    -.3581756     .823404
             Student  |  -.6287558   .1695433    -3.71   0.000    -.9610546   -.2964571
  Not in labor force  |   .1767472   .1230695     1.44   0.151    -.0644646    .4179589
                      |
            homemaker |  -.3955371    .116814    -3.39   0.001    -.6244883   -.1665859
                      |
               degree |
 No formal education  |   -.558434   .3427737    -1.63   0.103    -1.230258    .1133901
      Primary school  |   .1292106   .3599421     0.36   0.720    -.5762629    .8346842
     Lower secondary  |   -.044724   .1719277    -0.26   0.795    -.3816961     .292248
      Post secondary  |   .1095461   .1244458     0.88   0.379    -.1343631    .3534554
Lower level tertiary  |   .2568344   .1131815     2.27   0.023     .0350028     .478666
Upper level tertiary  |   .2450511   .1959567     1.25   0.211     -.139017    .6291192
                      |
                hswrk |   .0253347   .0252096     1.00   0.315    -.0240752    .0747445
              respmom |  -.0743628   .1642678    -0.45   0.651    -.3963218    .2475962
              famlife |  -.3500345   .0386338    -9.06   0.000    -.4257553   -.2743137
                _cons |   -3.60221   2.471712    -1.46   0.145    -8.446676    1.242256
---------------------------------------------------------------------------------------

. margin          relinc, at(flfp=(39(1)51)) predict(outcome(4))  post            /* Keep Sep             */

Predictive margins                              Number of obs     =      7,894
Model VCE    : Robust

Expression   : Pr(pool==Keep_All___Separate), predict(outcome(4))

1._at        : flfp            =          39

2._at        : flfp            =          40

3._at        : flfp            =          41

4._at        : flfp            =          42

5._at        : flfp            =          43

6._at        : flfp            =          44

7._at        : flfp            =          45

8._at        : flfp            =          46

9._at        : flfp            =          47

10._at       : flfp            =          48

11._at       : flfp            =          49

12._at       : flfp            =          50

13._at       : flfp            =          51

------------------------------------------------------------------------------------------
                         |            Delta-method
                         |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------------------+----------------------------------------------------------------
              _at#relinc |
   1#Man primary-earner  |   .0401152    .014371     2.79   0.005     .0119486    .0682818
 1#Woman primary-earner  |   .0971678   .0316957     3.07   0.002     .0350454    .1592902
        1#Equal-earners  |   .0776947   .0311839     2.49   0.013     .0165754     .138814
   2#Man primary-earner  |   .0474471   .0138093     3.44   0.001     .0203813    .0745129
 2#Woman primary-earner  |   .1013822   .0275397     3.68   0.000     .0474053    .1553591
        2#Equal-earners  |   .0803389    .027408     2.93   0.003     .0266203    .1340576
   3#Man primary-earner  |   .0552917   .0128508     4.30   0.000     .0301046    .0804788
 3#Woman primary-earner  |   .1051766    .023487     4.48   0.000     .0591428    .1512104
        3#Equal-earners  |    .082802   .0236793     3.50   0.000     .0363914    .1292125
   4#Man primary-earner  |   .0635092   .0116273     5.46   0.000     .0407201    .0862983
 4#Woman primary-earner  |   .1085004   .0197029     5.51   0.000     .0698834    .1471175
        4#Equal-earners  |   .0850745   .0201506     4.22   0.000     .0455802    .1245689
   5#Man primary-earner  |   .0719493   .0103899     6.92   0.000     .0515855    .0923131
 5#Woman primary-earner  |   .1113129   .0164112     6.78   0.000     .0791476    .1434783
        5#Equal-earners  |   .0871504   .0170677     5.11   0.000     .0536983    .1206025
   6#Man primary-earner  |    .080465   .0095676     8.41   0.000     .0617128    .0992171
 6#Woman primary-earner  |   .1135837   .0139292     8.15   0.000      .086283    .1408844
        6#Equal-earners  |    .089026   .0148226     6.01   0.000     .0599743    .1180777
   7#Man primary-earner  |   .0889239   .0097271     9.14   0.000     .0698592    .1079886
 7#Woman primary-earner  |   .1152935   .0126397     9.12   0.000     .0905201     .140067
        7#Equal-earners  |   .0907006   .0139166     6.52   0.000     .0634245    .1179767
   8#Man primary-earner  |    .097216   .0112316     8.66   0.000     .0752024    .1192296
 8#Woman primary-earner  |   .1164337   .0127695     9.12   0.000      .091406    .1414614
        8#Equal-earners  |   .0921755   .0146605     6.29   0.000     .0634416    .1209095
   9#Man primary-earner  |    .105257    .013979     7.53   0.000     .0778586    .1326554
 9#Woman primary-earner  |   .1170059   .0141387     8.28   0.000     .0892945    .1447173
        9#Equal-earners  |   .0934541   .0168702     5.54   0.000     .0603891    .1265192
  10#Man primary-earner  |   .1129882   .0176646     6.40   0.000     .0783662    .1476103
10#Woman primary-earner  |   .1170213   .0163119     7.17   0.000     .0850505     .148992
       10#Equal-earners  |   .0945414   .0200824     4.71   0.000     .0551807    .1339021
  11#Man primary-earner  |   .1203732   .0220466     5.46   0.000     .0771627    .1635837
11#Woman primary-earner  |   .1164993   .0189032     6.16   0.000     .0794496    .1535489
       11#Equal-earners  |   .0954435   .0238989     3.99   0.000     .0486024    .1422845
  12#Man primary-earner  |   .1273931   .0269785     4.72   0.000     .0745163      .18027
12#Woman primary-earner  |   .1154664   .0216672     5.33   0.000     .0729996    .1579333
       12#Equal-earners  |   .0961676   .0280697     3.43   0.001     .0411521    .1511832
  13#Man primary-earner  |   .1340419   .0323742     4.14   0.000     .0705895    .1974942
13#Woman primary-earner  |   .1139552   .0244614     4.66   0.000     .0660117    .1618987
       13#Equal-earners  |   .0967218   .0324483     2.98   0.003     .0331243    .1603193
------------------------------------------------------------------------------------------

. est store       sep

. 
. est table oneman equal some sep 

------------------------------------------------------------------
    Variable |   oneman       equal         some         sep      
-------------+----------------------------------------------------
  _at#relinc |
          1 #|
Man prima..  |  .52418307    .37437449    .06132724     .0401152  
          1 #|
Woman pri..  |  .38850499    .43710795    .07721927     .0971678  
          1 #|
Equal-ear~s  |  .29009066    .51225756    .11995709    .07769469  
          2 #|
Man prima..  |  .46684367    .41161382    .07409544    .04744708  
          2 #|
Woman pri..  |  .35472894    .45516726    .08872161    .10138219  
          2 #|
Equal-ear~s  |  .26501942    .52537147    .12927018    .08033893  
          3 #|
Man prima..  |  .41006301    .44640658    .08823873    .05529168  
          3 #|
Woman pri..  |   .3220598    .47140038    .10136322     .1051766  
          3 #|
Equal-ear~s  |  .24125632    .53707985    .13886187    .08280196  
          4 #|
Man prima..  |  .35520498    .47766505    .10362081    .06350916  
          4 #|
Woman pri..  |  .29074628    .48558967     .1151636    .10850045  
          4 #|
Equal-ear~s  |   .2188687    .54734593    .14871085    .08507452  
          5 #|
Man prima..  |  .30347804    .50450049    .12007219    .07194928  
          5 #|
Woman pri..  |  .26099944    .49755701    .13013063    .11131292  
          5 #|
Equal-ear~s  |  .19789937    .55615348    .15879679    .08715036  
          6 #|
Man prima..  |  .25584115    .52628611    .13740776    .08046499  
          6 #|
Woman pri..  |  .23298834    .50716763     .1462603    .11358374  
          6 #|
Equal-ear~s  |  .17836795    .56350534    .16910069    .08902602  
          7 #|
Man prima..  |  .21294847    .54268369    .15544395    .08892389  
          7 #|
Woman pri..  |  .20683773    .51433197    .16353679    .11529352  
          7 #|
Equal-ear~s  |   .1602728    .56942144    .17960513    .09070062  
          8 #|
Man prima..  |  .17513698    .55363422    .17401284    .09721596  
          8 #|
Woman pri..  |  .18262795    .51900567    .18193271    .11643368  
          8 #|
Equal-ear~s  |   .1435934    .57393657    .19029448    .09217555  
          9 #|
Man prima..  |  .14245218    .55931954    .19297129    .10525699  
          9 #|
Woman pri..  |  .16039665    .52118794    .20140951     .1170059  
          9 #|
Equal-ear~s  |  .12829306    .57709793    .20115486    .09345415  
         10 #|
Man prima..  |  .11470052    .56010637    .21220489    .11298822  
         10 #|
Woman pri..  |  .14014219    .52091848    .22191805    .11702128  
         10 #|
Equal-ear~s  |  .11432168    .57896274    .21217421    .09454137  
         11 #|
Man prima..  |  .09151479    .55648468    .23162732     .1203732  
         11 #|
Woman pri..  |  .12182822    .51827338    .24339914    .11649927  
         11 #|
Equal-ear~s  |   .1016186     .5795958    .22334214    .09544346  
         12 #|
Man prima..  |  .07242044    .54900996    .25117646    .12739314  
         12 #|
Woman pri..  |  .10538905    .51336032     .2657842    .11546643  
         12 #|
Equal-ear~s  |  .09011527    .57906732    .23464977    .09616764  
         13 #|
Man prima..  |  .05689378    .53825568    .27080869    .13404185  
         13 #|
Woman pri..  |  .09073542    .50631347    .28899593    .11395518  
         13 #|
Equal-ear~s  |   .0797377    .57745087    .24608959    .09672183  
------------------------------------------------------------------

. 
. // Figure D
. global  ivars "i.marst sex age parent i.employ homemaker ib4.degree hswrk respmom famlife"

. 
. mlogit          pool    c.flfp##i.marst                 i.relinc $ivars                                 , cluster(country)

Iteration 0:   log pseudolikelihood = -9464.1045  
Iteration 1:   log pseudolikelihood = -8433.3201  
Iteration 2:   log pseudolikelihood = -8367.2856  
Iteration 3:   log pseudolikelihood = -8366.6191  
Iteration 4:   log pseudolikelihood = -8366.6189  

Multinomial logistic regression                 Number of obs     =      7,894
                                                Wald chi2(15)     =          .
                                                Prob > chi2       =          .
Log pseudolikelihood = -8366.6189               Pseudo R2         =     0.1160

                                        (Std. Err. adjusted for 19 clusters in country)
---------------------------------------------------------------------------------------
                      |               Robust
                 pool |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
One___Manager         |
                 flfp |  -.2007964    .072307    -2.78   0.005    -.3425155   -.0590773
                      |
                marst |
               Cohab  |  -.2973098   1.452982    -0.20   0.838    -3.145102    2.550482
                      |
         marst#c.flfp |
               Cohab  |   .0132288   .0325253     0.41   0.684    -.0505196    .0769773
                      |
               relinc |
Woman primary-earner  |  -.0461019   .1453686    -0.32   0.751     -.331019    .2388153
       Equal-earners  |  -.4320451   .2043184    -2.11   0.034    -.8325018   -.0315883
                      |
                  sex |  -.2473715   .0898179    -2.75   0.006    -.4234114   -.0713317
                  age |  -.0169607   .0058566    -2.90   0.004    -.0284394   -.0054819
               parent |   -.064346   .1389112    -0.46   0.643     -.336607    .2079149
                      |
               employ |
            Parttime  |   .3158028    .145896     2.16   0.030     .0298519    .6017537
          Unemployed  |    .339104   .3082504     1.10   0.271    -.2650557    .9432636
             Student  |   .4705237   .1458943     3.23   0.001     .1845761    .7564714
  Not in labor force  |  -.2085195   .1292652    -1.61   0.107    -.4618746    .0448357
                      |
            homemaker |   .0929159   .1152491     0.81   0.420    -.1329683       .3188
                      |
               degree |
 No formal education  |    .690321   .2083891     3.31   0.001     .2818859    1.098756
      Primary school  |   .3803927    .173642     2.19   0.028     .0400607    .7207247
     Lower secondary  |   .0420599   .1496726     0.28   0.779    -.2512929    .3354128
      Post secondary  |  -.0154219   .2049981    -0.08   0.940    -.4172108    .3863671
Lower level tertiary  |  -.2763392    .214663    -1.29   0.198     -.697071    .1443926
Upper level tertiary  |  -.7011435   .1530208    -4.58   0.000    -1.001059   -.4012283
                      |
                hswrk |  -.0794368   .0284099    -2.80   0.005    -.1351191   -.0237546
              respmom |  -.0135094   .0975282    -0.14   0.890    -.2046612    .1776424
              famlife |   -.283717   .0601792    -4.71   0.000    -.4016661   -.1657678
                _cons |   11.09515   2.992834     3.71   0.000     5.229303      16.961
----------------------+----------------------------------------------------------------
Manage___Together     |  (base outcome)
----------------------+----------------------------------------------------------------
Keep_Some___Separate  |
                 flfp |    .074684   .0419703     1.78   0.075    -.0075764    .1569443
                      |
                marst |
               Cohab  |  -4.010032   3.089047    -1.30   0.194    -10.06445    2.044389
                      |
         marst#c.flfp |
               Cohab  |   .1149058   .0675596     1.70   0.089    -.0175086    .2473201
                      |
               relinc |
Woman primary-earner  |   .1149444    .108866     1.06   0.291     -.098429    .3283177
       Equal-earners  |   .0333436   .1210634     0.28   0.783    -.2039363    .2706236
                      |
                  sex |   .1222819   .0984732     1.24   0.214    -.0707219    .3152858
                  age |  -.0173743   .0044427    -3.91   0.000    -.0260817   -.0086668
               parent |  -.0620127   .1014813    -0.61   0.541    -.2609123     .136887
                      |
               employ |
            Parttime  |  -.4452954   .1680153    -2.65   0.008    -.7745993   -.1159915
          Unemployed  |  -.4805302    .206488    -2.33   0.020    -.8852392   -.0758211
             Student  |  -.4932224   .1201833    -4.10   0.000    -.7287772   -.2576675
  Not in labor force  |  -.1387157    .143325    -0.97   0.333    -.4196275    .1421961
                      |
            homemaker |  -.2933382   .1061071    -2.76   0.006    -.5013043    -.085372
                      |
               degree |
 No formal education  |  -.4311709   .3909479    -1.10   0.270    -1.197415     .335073
      Primary school  |  -.2388125   .1930578    -1.24   0.216    -.6171987    .1395738
     Lower secondary  |  -.1645184   .1417581    -1.16   0.246    -.4423591    .1133223
      Post secondary  |  -.1638384   .1330088    -1.23   0.218    -.4245308    .0968541
Lower level tertiary  |   .3047071   .1102294     2.76   0.006     .0886615    .5207527
Upper level tertiary  |   .5444332   .1095885     4.97   0.000     .3296437    .7592227
                      |
                hswrk |  -.0317828   .0198863    -1.60   0.110    -.0707593    .0071936
              respmom |   .1986485   .1181026     1.68   0.093    -.0328283    .4301253
              famlife |  -.1813042   .0338661    -5.35   0.000    -.2476805   -.1149278
                _cons |  -2.915275   1.852997    -1.57   0.116    -6.547082    .7165321
----------------------+----------------------------------------------------------------
Keep_All___Separate   |
                 flfp |   .0120405   .0468784     0.26   0.797    -.0798396    .1039205
                      |
                marst |
               Cohab  |  -6.213848   2.565771    -2.42   0.015    -11.24267   -1.185029
                      |
         marst#c.flfp |
               Cohab  |   .1703166   .0550967     3.09   0.002     .0623289    .2783042
                      |
               relinc |
Woman primary-earner  |   .2514595   .1519372     1.66   0.098     -.046332    .5492509
       Equal-earners  |  -.1037203    .118167    -0.88   0.380    -.3353234    .1278827
                      |
                  sex |   .2511033   .0813984     3.08   0.002     .0915654    .4106412
                  age |  -.0057658   .0084774    -0.68   0.496    -.0223813    .0108497
               parent |   .0107935   .1222614     0.09   0.930    -.2288344    .2504215
                      |
               employ |
            Parttime  |  -.6555655   .2124756    -3.09   0.002     -1.07201    -.239121
          Unemployed  |   .1918236   .3074158     0.62   0.533    -.4107003    .7943476
             Student  |     -.6489   .1757321    -3.69   0.000    -.9933285   -.3044714
  Not in labor force  |   .1655766    .126289     1.31   0.190    -.0819453    .4130986
                      |
            homemaker |  -.3887132   .1170985    -3.32   0.001    -.6182221   -.1592043
                      |
               degree |
 No formal education  |  -.4607892   .3864916    -1.19   0.233    -1.218299    .2967203
      Primary school  |   .1590482   .3835081     0.41   0.678    -.5926139    .9107103
     Lower secondary  |  -.0595053    .169646    -0.35   0.726    -.3920054    .2729949
      Post secondary  |   .1140783   .1291333     0.88   0.377    -.1390184    .3671749
Lower level tertiary  |   .2554324    .119214     2.14   0.032     .0217774    .4890875
Upper level tertiary  |   .2429322   .1949592     1.25   0.213    -.1391809    .6250453
                      |
                hswrk |   .0244068   .0253477     0.96   0.336    -.0252737    .0740873
              respmom |  -.0617401   .1646004    -0.38   0.708     -.384351    .2608708
              famlife |  -.3560837   .0383357    -9.29   0.000    -.4312203   -.2809471
                _cons |  -.2179423   2.455678    -0.09   0.929    -5.030983    4.595099
---------------------------------------------------------------------------------------

. margin          i.marst, at(flfp=(39(1)51)) predict(outcome(1)) post            /* One Manages  */

Predictive margins                              Number of obs     =      7,894
Model VCE    : Robust

Expression   : Pr(pool==One___Manager), predict(outcome(1))

1._at        : flfp            =          39

2._at        : flfp            =          40

3._at        : flfp            =          41

4._at        : flfp            =          42

5._at        : flfp            =          43

6._at        : flfp            =          44

7._at        : flfp            =          45

8._at        : flfp            =          46

9._at        : flfp            =          47

10._at       : flfp            =          48

11._at       : flfp            =          49

12._at       : flfp            =          50

13._at       : flfp            =          51

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   _at#marst |
  1#Married  |   .4641362    .088187     5.26   0.000     .2912928    .6369795
    1#Cohab  |   .4878579   .0777273     6.28   0.000     .3355152    .6402006
  2#Married  |   .4164271   .0711245     5.85   0.000     .2770257    .5558285
    2#Cohab  |   .4321885   .0644348     6.71   0.000     .3058987    .5584784
  3#Married  |   .3700425   .0546153     6.78   0.000     .2629985    .4770865
    3#Cohab  |   .3767554   .0508871     7.40   0.000     .2770185    .4764922
  4#Married  |   .3257059   .0400512     8.13   0.000      .247207    .4042047
    4#Cohab  |   .3229024    .038627     8.36   0.000      .247195    .3986099
  5#Married  |   .2840242   .0292612     9.71   0.000     .2266734     .341375
    5#Cohab  |   .2719176   .0295505     9.20   0.000     .2139997    .3298356
  6#Married  |    .245461   .0243449    10.08   0.000     .1977458    .2931762
    6#Cohab  |   .2249123   .0252664     8.90   0.000      .175391    .2744336
  7#Married  |   .2103243    .025232     8.34   0.000     .1608705    .2597781
    7#Cohab  |   .1827223   .0252048     7.25   0.000     .1333218    .2321228
  8#Married  |   .1787686   .0287097     6.23   0.000     .1224986    .2350385
    8#Cohab  |   .1458493   .0267249     5.46   0.000     .0934694    .1982292
  9#Married  |   .1508086   .0321163     4.70   0.000     .0878618    .2137555
    9#Cohab  |   .1144501   .0277661     4.12   0.000     .0600296    .1688707
 10#Married  |   .1263419   .0343975     3.67   0.000     .0589241    .1937598
   10#Cohab  |   .0883711   .0275649     3.21   0.001      .034345    .1423973
 11#Married  |   .1051752   .0353312     2.98   0.003     .0359274    .1744231
   11#Cohab  |   .0672151   .0261153     2.57   0.010       .01603    .1184001
 12#Married  |   .0870523   .0350322     2.48   0.013     .0183905    .1557141
   12#Cohab  |   .0504236   .0237278     2.13   0.034     .0039179    .0969293
 13#Married  |   .0716795   .0337398     2.12   0.034     .0055507    .1378082
   13#Cohab  |   .0373596   .0207943     1.80   0.072    -.0033964    .0781156
------------------------------------------------------------------------------

. est store       oneman

. 
. mlogit          pool    c.flfp##i.marst                 i.relinc $ivars                                 , cluster(country)

Iteration 0:   log pseudolikelihood = -9464.1045  
Iteration 1:   log pseudolikelihood = -8433.3201  
Iteration 2:   log pseudolikelihood = -8367.2856  
Iteration 3:   log pseudolikelihood = -8366.6191  
Iteration 4:   log pseudolikelihood = -8366.6189  

Multinomial logistic regression                 Number of obs     =      7,894
                                                Wald chi2(15)     =          .
                                                Prob > chi2       =          .
Log pseudolikelihood = -8366.6189               Pseudo R2         =     0.1160

                                        (Std. Err. adjusted for 19 clusters in country)
---------------------------------------------------------------------------------------
                      |               Robust
                 pool |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
One___Manager         |
                 flfp |  -.2007964    .072307    -2.78   0.005    -.3425155   -.0590773
                      |
                marst |
               Cohab  |  -.2973098   1.452982    -0.20   0.838    -3.145102    2.550482
                      |
         marst#c.flfp |
               Cohab  |   .0132288   .0325253     0.41   0.684    -.0505196    .0769773
                      |
               relinc |
Woman primary-earner  |  -.0461019   .1453686    -0.32   0.751     -.331019    .2388153
       Equal-earners  |  -.4320451   .2043184    -2.11   0.034    -.8325018   -.0315883
                      |
                  sex |  -.2473715   .0898179    -2.75   0.006    -.4234114   -.0713317
                  age |  -.0169607   .0058566    -2.90   0.004    -.0284394   -.0054819
               parent |   -.064346   .1389112    -0.46   0.643     -.336607    .2079149
                      |
               employ |
            Parttime  |   .3158028    .145896     2.16   0.030     .0298519    .6017537
          Unemployed  |    .339104   .3082504     1.10   0.271    -.2650557    .9432636
             Student  |   .4705237   .1458943     3.23   0.001     .1845761    .7564714
  Not in labor force  |  -.2085195   .1292652    -1.61   0.107    -.4618746    .0448357
                      |
            homemaker |   .0929159   .1152491     0.81   0.420    -.1329683       .3188
                      |
               degree |
 No formal education  |    .690321   .2083891     3.31   0.001     .2818859    1.098756
      Primary school  |   .3803927    .173642     2.19   0.028     .0400607    .7207247
     Lower secondary  |   .0420599   .1496726     0.28   0.779    -.2512929    .3354128
      Post secondary  |  -.0154219   .2049981    -0.08   0.940    -.4172108    .3863671
Lower level tertiary  |  -.2763392    .214663    -1.29   0.198     -.697071    .1443926
Upper level tertiary  |  -.7011435   .1530208    -4.58   0.000    -1.001059   -.4012283
                      |
                hswrk |  -.0794368   .0284099    -2.80   0.005    -.1351191   -.0237546
              respmom |  -.0135094   .0975282    -0.14   0.890    -.2046612    .1776424
              famlife |   -.283717   .0601792    -4.71   0.000    -.4016661   -.1657678
                _cons |   11.09515   2.992834     3.71   0.000     5.229303      16.961
----------------------+----------------------------------------------------------------
Manage___Together     |  (base outcome)
----------------------+----------------------------------------------------------------
Keep_Some___Separate  |
                 flfp |    .074684   .0419703     1.78   0.075    -.0075764    .1569443
                      |
                marst |
               Cohab  |  -4.010032   3.089047    -1.30   0.194    -10.06445    2.044389
                      |
         marst#c.flfp |
               Cohab  |   .1149058   .0675596     1.70   0.089    -.0175086    .2473201
                      |
               relinc |
Woman primary-earner  |   .1149444    .108866     1.06   0.291     -.098429    .3283177
       Equal-earners  |   .0333436   .1210634     0.28   0.783    -.2039363    .2706236
                      |
                  sex |   .1222819   .0984732     1.24   0.214    -.0707219    .3152858
                  age |  -.0173743   .0044427    -3.91   0.000    -.0260817   -.0086668
               parent |  -.0620127   .1014813    -0.61   0.541    -.2609123     .136887
                      |
               employ |
            Parttime  |  -.4452954   .1680153    -2.65   0.008    -.7745993   -.1159915
          Unemployed  |  -.4805302    .206488    -2.33   0.020    -.8852392   -.0758211
             Student  |  -.4932224   .1201833    -4.10   0.000    -.7287772   -.2576675
  Not in labor force  |  -.1387157    .143325    -0.97   0.333    -.4196275    .1421961
                      |
            homemaker |  -.2933382   .1061071    -2.76   0.006    -.5013043    -.085372
                      |
               degree |
 No formal education  |  -.4311709   .3909479    -1.10   0.270    -1.197415     .335073
      Primary school  |  -.2388125   .1930578    -1.24   0.216    -.6171987    .1395738
     Lower secondary  |  -.1645184   .1417581    -1.16   0.246    -.4423591    .1133223
      Post secondary  |  -.1638384   .1330088    -1.23   0.218    -.4245308    .0968541
Lower level tertiary  |   .3047071   .1102294     2.76   0.006     .0886615    .5207527
Upper level tertiary  |   .5444332   .1095885     4.97   0.000     .3296437    .7592227
                      |
                hswrk |  -.0317828   .0198863    -1.60   0.110    -.0707593    .0071936
              respmom |   .1986485   .1181026     1.68   0.093    -.0328283    .4301253
              famlife |  -.1813042   .0338661    -5.35   0.000    -.2476805   -.1149278
                _cons |  -2.915275   1.852997    -1.57   0.116    -6.547082    .7165321
----------------------+----------------------------------------------------------------
Keep_All___Separate   |
                 flfp |   .0120405   .0468784     0.26   0.797    -.0798396    .1039205
                      |
                marst |
               Cohab  |  -6.213848   2.565771    -2.42   0.015    -11.24267   -1.185029
                      |
         marst#c.flfp |
               Cohab  |   .1703166   .0550967     3.09   0.002     .0623289    .2783042
                      |
               relinc |
Woman primary-earner  |   .2514595   .1519372     1.66   0.098     -.046332    .5492509
       Equal-earners  |  -.1037203    .118167    -0.88   0.380    -.3353234    .1278827
                      |
                  sex |   .2511033   .0813984     3.08   0.002     .0915654    .4106412
                  age |  -.0057658   .0084774    -0.68   0.496    -.0223813    .0108497
               parent |   .0107935   .1222614     0.09   0.930    -.2288344    .2504215
                      |
               employ |
            Parttime  |  -.6555655   .2124756    -3.09   0.002     -1.07201    -.239121
          Unemployed  |   .1918236   .3074158     0.62   0.533    -.4107003    .7943476
             Student  |     -.6489   .1757321    -3.69   0.000    -.9933285   -.3044714
  Not in labor force  |   .1655766    .126289     1.31   0.190    -.0819453    .4130986
                      |
            homemaker |  -.3887132   .1170985    -3.32   0.001    -.6182221   -.1592043
                      |
               degree |
 No formal education  |  -.4607892   .3864916    -1.19   0.233    -1.218299    .2967203
      Primary school  |   .1590482   .3835081     0.41   0.678    -.5926139    .9107103
     Lower secondary  |  -.0595053    .169646    -0.35   0.726    -.3920054    .2729949
      Post secondary  |   .1140783   .1291333     0.88   0.377    -.1390184    .3671749
Lower level tertiary  |   .2554324    .119214     2.14   0.032     .0217774    .4890875
Upper level tertiary  |   .2429322   .1949592     1.25   0.213    -.1391809    .6250453
                      |
                hswrk |   .0244068   .0253477     0.96   0.336    -.0252737    .0740873
              respmom |  -.0617401   .1646004    -0.38   0.708     -.384351    .2608708
              famlife |  -.3560837   .0383357    -9.29   0.000    -.4312203   -.2809471
                _cons |  -.2179423   2.455678    -0.09   0.929    -5.030983    4.595099
---------------------------------------------------------------------------------------

. margin          i.marst, at(flfp=(39(1)51)) predict(outcome(2)) post            /* Manage Equal */

Predictive margins                              Number of obs     =      7,894
Model VCE    : Robust

Expression   : Pr(pool==Manage___Together), predict(outcome(2))

1._at        : flfp            =          39

2._at        : flfp            =          40

3._at        : flfp            =          41

4._at        : flfp            =          42

5._at        : flfp            =          43

6._at        : flfp            =          44

7._at        : flfp            =          45

8._at        : flfp            =          46

9._at        : flfp            =          47

10._at       : flfp            =          48

11._at       : flfp            =          49

12._at       : flfp            =          50

13._at       : flfp            =          51

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   _at#marst |
  1#Married  |   .4152134   .0760257     5.46   0.000     .2662057    .5642212
    1#Cohab  |   .3523563    .040347     8.73   0.000     .2732776    .4314351
  2#Married  |   .4479803   .0631073     7.10   0.000     .3242922    .5716685
    2#Cohab  |   .3689035   .0315661    11.69   0.000     .3070352    .4307718
  3#Married  |   .4788485   .0509017     9.41   0.000      .379083    .5786139
    3#Cohab  |   .3799232   .0256599    14.81   0.000     .3296308    .4302157
  4#Married  |   .5072424   .0405115    12.52   0.000     .4278413    .5866435
    4#Cohab  |   .3846848   .0228344    16.85   0.000     .3399302    .4294394
  5#Married  |   .5326967   .0331481    16.07   0.000     .4677276    .5976659
    5#Cohab  |   .3828504   .0217111    17.63   0.000     .3402975    .4254033
  6#Married  |   .5548748   .0297542    18.65   0.000     .4965577     .613192
    6#Cohab  |    .374525    .020684    18.11   0.000     .3339851    .4150649
  7#Married  |   .5735752   .0301336    19.03   0.000     .5145143     .632636
    7#Cohab  |   .3602438   .0192819    18.68   0.000     .3224519    .3980357
  8#Married  |   .5887258   .0329353    17.88   0.000     .5241738    .6532779
    8#Cohab  |    .340902   .0183251    18.60   0.000     .3049854    .3768186
  9#Married  |   .6003699   .0368512    16.29   0.000     .5281429    .6725969
    9#Cohab  |   .3176401   .0192019    16.54   0.000     .2800049    .3552752
 10#Married  |   .6086445   .0412204    14.77   0.000     .5278539    .6894351
   10#Cohab  |   .2917106   .0223544    13.05   0.000     .2478967    .3355244
 11#Married  |   .6137567    .045872    13.38   0.000     .5238492    .7036643
   11#Cohab  |   .2643497   .0268512     9.85   0.000     .2117224     .316977
 12#Married  |   .6159604   .0508626    12.11   0.000     .5162715    .7156493
   12#Cohab  |   .2366736   .0315042     7.51   0.000     .1749264    .2984207
 13#Married  |   .6155342   .0563089    10.93   0.000     .5051708    .7258976
   13#Cohab  |   .2096104   .0355048     5.90   0.000     .1400223    .2791985
------------------------------------------------------------------------------

. est store       equal

. 
. mlogit          pool    c.flfp##i.marst                 i.relinc $ivars                                 , cluster(country)

Iteration 0:   log pseudolikelihood = -9464.1045  
Iteration 1:   log pseudolikelihood = -8433.3201  
Iteration 2:   log pseudolikelihood = -8367.2856  
Iteration 3:   log pseudolikelihood = -8366.6191  
Iteration 4:   log pseudolikelihood = -8366.6189  

Multinomial logistic regression                 Number of obs     =      7,894
                                                Wald chi2(15)     =          .
                                                Prob > chi2       =          .
Log pseudolikelihood = -8366.6189               Pseudo R2         =     0.1160

                                        (Std. Err. adjusted for 19 clusters in country)
---------------------------------------------------------------------------------------
                      |               Robust
                 pool |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
One___Manager         |
                 flfp |  -.2007964    .072307    -2.78   0.005    -.3425155   -.0590773
                      |
                marst |
               Cohab  |  -.2973098   1.452982    -0.20   0.838    -3.145102    2.550482
                      |
         marst#c.flfp |
               Cohab  |   .0132288   .0325253     0.41   0.684    -.0505196    .0769773
                      |
               relinc |
Woman primary-earner  |  -.0461019   .1453686    -0.32   0.751     -.331019    .2388153
       Equal-earners  |  -.4320451   .2043184    -2.11   0.034    -.8325018   -.0315883
                      |
                  sex |  -.2473715   .0898179    -2.75   0.006    -.4234114   -.0713317
                  age |  -.0169607   .0058566    -2.90   0.004    -.0284394   -.0054819
               parent |   -.064346   .1389112    -0.46   0.643     -.336607    .2079149
                      |
               employ |
            Parttime  |   .3158028    .145896     2.16   0.030     .0298519    .6017537
          Unemployed  |    .339104   .3082504     1.10   0.271    -.2650557    .9432636
             Student  |   .4705237   .1458943     3.23   0.001     .1845761    .7564714
  Not in labor force  |  -.2085195   .1292652    -1.61   0.107    -.4618746    .0448357
                      |
            homemaker |   .0929159   .1152491     0.81   0.420    -.1329683       .3188
                      |
               degree |
 No formal education  |    .690321   .2083891     3.31   0.001     .2818859    1.098756
      Primary school  |   .3803927    .173642     2.19   0.028     .0400607    .7207247
     Lower secondary  |   .0420599   .1496726     0.28   0.779    -.2512929    .3354128
      Post secondary  |  -.0154219   .2049981    -0.08   0.940    -.4172108    .3863671
Lower level tertiary  |  -.2763392    .214663    -1.29   0.198     -.697071    .1443926
Upper level tertiary  |  -.7011435   .1530208    -4.58   0.000    -1.001059   -.4012283
                      |
                hswrk |  -.0794368   .0284099    -2.80   0.005    -.1351191   -.0237546
              respmom |  -.0135094   .0975282    -0.14   0.890    -.2046612    .1776424
              famlife |   -.283717   .0601792    -4.71   0.000    -.4016661   -.1657678
                _cons |   11.09515   2.992834     3.71   0.000     5.229303      16.961
----------------------+----------------------------------------------------------------
Manage___Together     |  (base outcome)
----------------------+----------------------------------------------------------------
Keep_Some___Separate  |
                 flfp |    .074684   .0419703     1.78   0.075    -.0075764    .1569443
                      |
                marst |
               Cohab  |  -4.010032   3.089047    -1.30   0.194    -10.06445    2.044389
                      |
         marst#c.flfp |
               Cohab  |   .1149058   .0675596     1.70   0.089    -.0175086    .2473201
                      |
               relinc |
Woman primary-earner  |   .1149444    .108866     1.06   0.291     -.098429    .3283177
       Equal-earners  |   .0333436   .1210634     0.28   0.783    -.2039363    .2706236
                      |
                  sex |   .1222819   .0984732     1.24   0.214    -.0707219    .3152858
                  age |  -.0173743   .0044427    -3.91   0.000    -.0260817   -.0086668
               parent |  -.0620127   .1014813    -0.61   0.541    -.2609123     .136887
                      |
               employ |
            Parttime  |  -.4452954   .1680153    -2.65   0.008    -.7745993   -.1159915
          Unemployed  |  -.4805302    .206488    -2.33   0.020    -.8852392   -.0758211
             Student  |  -.4932224   .1201833    -4.10   0.000    -.7287772   -.2576675
  Not in labor force  |  -.1387157    .143325    -0.97   0.333    -.4196275    .1421961
                      |
            homemaker |  -.2933382   .1061071    -2.76   0.006    -.5013043    -.085372
                      |
               degree |
 No formal education  |  -.4311709   .3909479    -1.10   0.270    -1.197415     .335073
      Primary school  |  -.2388125   .1930578    -1.24   0.216    -.6171987    .1395738
     Lower secondary  |  -.1645184   .1417581    -1.16   0.246    -.4423591    .1133223
      Post secondary  |  -.1638384   .1330088    -1.23   0.218    -.4245308    .0968541
Lower level tertiary  |   .3047071   .1102294     2.76   0.006     .0886615    .5207527
Upper level tertiary  |   .5444332   .1095885     4.97   0.000     .3296437    .7592227
                      |
                hswrk |  -.0317828   .0198863    -1.60   0.110    -.0707593    .0071936
              respmom |   .1986485   .1181026     1.68   0.093    -.0328283    .4301253
              famlife |  -.1813042   .0338661    -5.35   0.000    -.2476805   -.1149278
                _cons |  -2.915275   1.852997    -1.57   0.116    -6.547082    .7165321
----------------------+----------------------------------------------------------------
Keep_All___Separate   |
                 flfp |   .0120405   .0468784     0.26   0.797    -.0798396    .1039205
                      |
                marst |
               Cohab  |  -6.213848   2.565771    -2.42   0.015    -11.24267   -1.185029
                      |
         marst#c.flfp |
               Cohab  |   .1703166   .0550967     3.09   0.002     .0623289    .2783042
                      |
               relinc |
Woman primary-earner  |   .2514595   .1519372     1.66   0.098     -.046332    .5492509
       Equal-earners  |  -.1037203    .118167    -0.88   0.380    -.3353234    .1278827
                      |
                  sex |   .2511033   .0813984     3.08   0.002     .0915654    .4106412
                  age |  -.0057658   .0084774    -0.68   0.496    -.0223813    .0108497
               parent |   .0107935   .1222614     0.09   0.930    -.2288344    .2504215
                      |
               employ |
            Parttime  |  -.6555655   .2124756    -3.09   0.002     -1.07201    -.239121
          Unemployed  |   .1918236   .3074158     0.62   0.533    -.4107003    .7943476
             Student  |     -.6489   .1757321    -3.69   0.000    -.9933285   -.3044714
  Not in labor force  |   .1655766    .126289     1.31   0.190    -.0819453    .4130986
                      |
            homemaker |  -.3887132   .1170985    -3.32   0.001    -.6182221   -.1592043
                      |
               degree |
 No formal education  |  -.4607892   .3864916    -1.19   0.233    -1.218299    .2967203
      Primary school  |   .1590482   .3835081     0.41   0.678    -.5926139    .9107103
     Lower secondary  |  -.0595053    .169646    -0.35   0.726    -.3920054    .2729949
      Post secondary  |   .1140783   .1291333     0.88   0.377    -.1390184    .3671749
Lower level tertiary  |   .2554324    .119214     2.14   0.032     .0217774    .4890875
Upper level tertiary  |   .2429322   .1949592     1.25   0.213    -.1391809    .6250453
                      |
                hswrk |   .0244068   .0253477     0.96   0.336    -.0252737    .0740873
              respmom |  -.0617401   .1646004    -0.38   0.708     -.384351    .2608708
              famlife |  -.3560837   .0383357    -9.29   0.000    -.4312203   -.2809471
                _cons |  -.2179423   2.455678    -0.09   0.929    -5.030983    4.595099
---------------------------------------------------------------------------------------

. margin          i.marst, at(flfp=(39(1)51)) predict(outcome(3)) post            /* Pool Some    */

Predictive margins                              Number of obs     =      7,894
Model VCE    : Robust

Expression   : Pr(pool==Keep_Some___Separate), predict(outcome(3))

1._at        : flfp            =          39

2._at        : flfp            =          40

3._at        : flfp            =          41

4._at        : flfp            =          42

5._at        : flfp            =          43

6._at        : flfp            =          44

7._at        : flfp            =          45

8._at        : flfp            =          46

9._at        : flfp            =          47

10._at       : flfp            =          48

11._at       : flfp            =          49

12._at       : flfp            =          50

13._at       : flfp            =          51

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   _at#marst |
  1#Married  |   .0682008   .0156285     4.36   0.000     .0375696    .0988321
    1#Cohab  |   .0920395   .0299263     3.08   0.002     .0333851    .1506939
  2#Married  |   .0786381   .0157678     4.99   0.000     .0477339    .1095424
    2#Cohab  |   .1147987   .0297817     3.85   0.000     .0564277    .1731697
  3#Married  |   .0898389   .0156764     5.73   0.000     .0591136    .1205641
    3#Cohab  |   .1407225   .0284875     4.94   0.000     .0848881     .196557
  4#Married  |   .1017295   .0153224     6.64   0.000      .071698    .1317609
    4#Cohab  |   .1694884   .0262912     6.45   0.000     .1179586    .2210182
  5#Married  |     .11423   .0147166     7.76   0.000     .0853859    .1430741
    5#Cohab  |   .2005777   .0237946     8.43   0.000     .1539412    .2472142
  6#Married  |     .12726   .0139708     9.11   0.000     .0998777    .1546424
    6#Cohab  |   .2333131   .0220141    10.60   0.000     .1901663    .2764598
  7#Married  |   .1407433   .0133839    10.52   0.000     .1145114    .1669752
    7#Cohab  |   .2669179   .0221407    12.06   0.000     .2235229    .3103129
  8#Married  |    .154612   .0135058    11.45   0.000     .1281412    .1810829
    8#Cohab  |   .3005891    .024763    12.14   0.000     .2520545    .3491237
  9#Married  |   .1688094   .0149917    11.26   0.000     .1394262    .1981926
    9#Cohab  |   .3335684   .0294768    11.32   0.000     .2757949    .3913418
 10#Married  |   .1832906   .0181982    10.07   0.000     .1476228    .2189583
   10#Cohab  |   .3652011    .035533    10.28   0.000     .2955577    .4348445
 11#Married  |   .1980226   .0230406     8.59   0.000     .1528639    .2431813
   11#Cohab  |   .3949751   .0423973     9.32   0.000      .311878    .4780723
 12#Married  |   .2129833   .0292527     7.28   0.000     .1556491    .2703175
   12#Cohab  |   .4225362   .0498081     8.48   0.000     .3249142    .5201583
 13#Married  |   .2281591   .0365876     6.24   0.000     .1564488    .2998694
   13#Cohab  |   .4476838    .057671     7.76   0.000     .3346506     .560717
------------------------------------------------------------------------------

. est store       some

. 
. mlogit          pool    c.flfp##i.marst                 i.relinc $ivars                                 , cluster(country)

Iteration 0:   log pseudolikelihood = -9464.1045  
Iteration 1:   log pseudolikelihood = -8433.3201  
Iteration 2:   log pseudolikelihood = -8367.2856  
Iteration 3:   log pseudolikelihood = -8366.6191  
Iteration 4:   log pseudolikelihood = -8366.6189  

Multinomial logistic regression                 Number of obs     =      7,894
                                                Wald chi2(15)     =          .
                                                Prob > chi2       =          .
Log pseudolikelihood = -8366.6189               Pseudo R2         =     0.1160

                                        (Std. Err. adjusted for 19 clusters in country)
---------------------------------------------------------------------------------------
                      |               Robust
                 pool |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
One___Manager         |
                 flfp |  -.2007964    .072307    -2.78   0.005    -.3425155   -.0590773
                      |
                marst |
               Cohab  |  -.2973098   1.452982    -0.20   0.838    -3.145102    2.550482
                      |
         marst#c.flfp |
               Cohab  |   .0132288   .0325253     0.41   0.684    -.0505196    .0769773
                      |
               relinc |
Woman primary-earner  |  -.0461019   .1453686    -0.32   0.751     -.331019    .2388153
       Equal-earners  |  -.4320451   .2043184    -2.11   0.034    -.8325018   -.0315883
                      |
                  sex |  -.2473715   .0898179    -2.75   0.006    -.4234114   -.0713317
                  age |  -.0169607   .0058566    -2.90   0.004    -.0284394   -.0054819
               parent |   -.064346   .1389112    -0.46   0.643     -.336607    .2079149
                      |
               employ |
            Parttime  |   .3158028    .145896     2.16   0.030     .0298519    .6017537
          Unemployed  |    .339104   .3082504     1.10   0.271    -.2650557    .9432636
             Student  |   .4705237   .1458943     3.23   0.001     .1845761    .7564714
  Not in labor force  |  -.2085195   .1292652    -1.61   0.107    -.4618746    .0448357
                      |
            homemaker |   .0929159   .1152491     0.81   0.420    -.1329683       .3188
                      |
               degree |
 No formal education  |    .690321   .2083891     3.31   0.001     .2818859    1.098756
      Primary school  |   .3803927    .173642     2.19   0.028     .0400607    .7207247
     Lower secondary  |   .0420599   .1496726     0.28   0.779    -.2512929    .3354128
      Post secondary  |  -.0154219   .2049981    -0.08   0.940    -.4172108    .3863671
Lower level tertiary  |  -.2763392    .214663    -1.29   0.198     -.697071    .1443926
Upper level tertiary  |  -.7011435   .1530208    -4.58   0.000    -1.001059   -.4012283
                      |
                hswrk |  -.0794368   .0284099    -2.80   0.005    -.1351191   -.0237546
              respmom |  -.0135094   .0975282    -0.14   0.890    -.2046612    .1776424
              famlife |   -.283717   .0601792    -4.71   0.000    -.4016661   -.1657678
                _cons |   11.09515   2.992834     3.71   0.000     5.229303      16.961
----------------------+----------------------------------------------------------------
Manage___Together     |  (base outcome)
----------------------+----------------------------------------------------------------
Keep_Some___Separate  |
                 flfp |    .074684   .0419703     1.78   0.075    -.0075764    .1569443
                      |
                marst |
               Cohab  |  -4.010032   3.089047    -1.30   0.194    -10.06445    2.044389
                      |
         marst#c.flfp |
               Cohab  |   .1149058   .0675596     1.70   0.089    -.0175086    .2473201
                      |
               relinc |
Woman primary-earner  |   .1149444    .108866     1.06   0.291     -.098429    .3283177
       Equal-earners  |   .0333436   .1210634     0.28   0.783    -.2039363    .2706236
                      |
                  sex |   .1222819   .0984732     1.24   0.214    -.0707219    .3152858
                  age |  -.0173743   .0044427    -3.91   0.000    -.0260817   -.0086668
               parent |  -.0620127   .1014813    -0.61   0.541    -.2609123     .136887
                      |
               employ |
            Parttime  |  -.4452954   .1680153    -2.65   0.008    -.7745993   -.1159915
          Unemployed  |  -.4805302    .206488    -2.33   0.020    -.8852392   -.0758211
             Student  |  -.4932224   .1201833    -4.10   0.000    -.7287772   -.2576675
  Not in labor force  |  -.1387157    .143325    -0.97   0.333    -.4196275    .1421961
                      |
            homemaker |  -.2933382   .1061071    -2.76   0.006    -.5013043    -.085372
                      |
               degree |
 No formal education  |  -.4311709   .3909479    -1.10   0.270    -1.197415     .335073
      Primary school  |  -.2388125   .1930578    -1.24   0.216    -.6171987    .1395738
     Lower secondary  |  -.1645184   .1417581    -1.16   0.246    -.4423591    .1133223
      Post secondary  |  -.1638384   .1330088    -1.23   0.218    -.4245308    .0968541
Lower level tertiary  |   .3047071   .1102294     2.76   0.006     .0886615    .5207527
Upper level tertiary  |   .5444332   .1095885     4.97   0.000     .3296437    .7592227
                      |
                hswrk |  -.0317828   .0198863    -1.60   0.110    -.0707593    .0071936
              respmom |   .1986485   .1181026     1.68   0.093    -.0328283    .4301253
              famlife |  -.1813042   .0338661    -5.35   0.000    -.2476805   -.1149278
                _cons |  -2.915275   1.852997    -1.57   0.116    -6.547082    .7165321
----------------------+----------------------------------------------------------------
Keep_All___Separate   |
                 flfp |   .0120405   .0468784     0.26   0.797    -.0798396    .1039205
                      |
                marst |
               Cohab  |  -6.213848   2.565771    -2.42   0.015    -11.24267   -1.185029
                      |
         marst#c.flfp |
               Cohab  |   .1703166   .0550967     3.09   0.002     .0623289    .2783042
                      |
               relinc |
Woman primary-earner  |   .2514595   .1519372     1.66   0.098     -.046332    .5492509
       Equal-earners  |  -.1037203    .118167    -0.88   0.380    -.3353234    .1278827
                      |
                  sex |   .2511033   .0813984     3.08   0.002     .0915654    .4106412
                  age |  -.0057658   .0084774    -0.68   0.496    -.0223813    .0108497
               parent |   .0107935   .1222614     0.09   0.930    -.2288344    .2504215
                      |
               employ |
            Parttime  |  -.6555655   .2124756    -3.09   0.002     -1.07201    -.239121
          Unemployed  |   .1918236   .3074158     0.62   0.533    -.4107003    .7943476
             Student  |     -.6489   .1757321    -3.69   0.000    -.9933285   -.3044714
  Not in labor force  |   .1655766    .126289     1.31   0.190    -.0819453    .4130986
                      |
            homemaker |  -.3887132   .1170985    -3.32   0.001    -.6182221   -.1592043
                      |
               degree |
 No formal education  |  -.4607892   .3864916    -1.19   0.233    -1.218299    .2967203
      Primary school  |   .1590482   .3835081     0.41   0.678    -.5926139    .9107103
     Lower secondary  |  -.0595053    .169646    -0.35   0.726    -.3920054    .2729949
      Post secondary  |   .1140783   .1291333     0.88   0.377    -.1390184    .3671749
Lower level tertiary  |   .2554324    .119214     2.14   0.032     .0217774    .4890875
Upper level tertiary  |   .2429322   .1949592     1.25   0.213    -.1391809    .6250453
                      |
                hswrk |   .0244068   .0253477     0.96   0.336    -.0252737    .0740873
              respmom |  -.0617401   .1646004    -0.38   0.708     -.384351    .2608708
              famlife |  -.3560837   .0383357    -9.29   0.000    -.4312203   -.2809471
                _cons |  -.2179423   2.455678    -0.09   0.929    -5.030983    4.595099
---------------------------------------------------------------------------------------

. margin          i.marst, at(flfp=(39(1)51)) predict(outcome(4)) post            /* Keep Sep             */

Predictive margins                              Number of obs     =      7,894
Model VCE    : Robust

Expression   : Pr(pool==Keep_All___Separate), predict(outcome(4))

1._at        : flfp            =          39

2._at        : flfp            =          40

3._at        : flfp            =          41

4._at        : flfp            =          42

5._at        : flfp            =          43

6._at        : flfp            =          44

7._at        : flfp            =          45

8._at        : flfp            =          46

9._at        : flfp            =          47

10._at       : flfp            =          48

11._at       : flfp            =          49

12._at       : flfp            =          50

13._at       : flfp            =          51

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   _at#marst |
  1#Married  |   .0524496   .0208653     2.51   0.012     .0115544    .0933447
    1#Cohab  |   .0677463   .0231649     2.92   0.003      .022344    .1131486
  2#Married  |   .0569545   .0189941     3.00   0.003     .0197267    .0941822
    2#Cohab  |   .0841093   .0227562     3.70   0.000      .039508    .1287106
  3#Married  |   .0612702   .0169289     3.62   0.000     .0280901    .0944503
    3#Cohab  |   .1025988   .0212975     4.82   0.000     .0608565    .1443412
  4#Married  |   .0653223    .014817     4.41   0.000     .0362814    .0943631
    4#Cohab  |   .1229244   .0189618     6.48   0.000     .0857599    .1600889
  5#Married  |   .0690491   .0128653     5.37   0.000     .0438336    .0942646
    5#Cohab  |   .1446542    .016294     8.88   0.000     .1127187    .1765898
  6#Married  |   .0724042   .0113677     6.37   0.000      .050124    .0946844
    6#Cohab  |   .1672497   .0144667    11.56   0.000     .1388954     .195604
  7#Married  |   .0753573    .010686     7.05   0.000     .0544131    .0963015
    7#Cohab  |    .190116   .0151363    12.56   0.000     .1604494    .2197826
  8#Married  |   .0778936   .0110831     7.03   0.000     .0561711    .0996161
    8#Cohab  |   .2126596   .0189023    11.25   0.000     .1756118    .2497074
  9#Married  |    .080012   .0125151     6.39   0.000     .0554828    .1045412
    9#Cohab  |   .2343414   .0248614     9.43   0.000     .1856139     .283069
 10#Married  |    .081723   .0147056     5.56   0.000     .0529006    .1105453
   10#Cohab  |   .2547172   .0320773     7.94   0.000     .1918468    .3175875
 11#Married  |   .0830454   .0173708     4.78   0.000     .0489993    .1170915
   11#Cohab  |   .2734601   .0400437     6.83   0.000      .194976    .3519443
 12#Married  |    .084004   .0203126     4.14   0.000     .0441921    .1238159
   12#Cohab  |   .2903666   .0485177     5.98   0.000     .1952736    .3854596
 13#Married  |   .0846272   .0234068     3.62   0.000     .0387507    .1305037
   13#Cohab  |   .3053462   .0573783     5.32   0.000     .1928868    .4178056
------------------------------------------------------------------------------

. est store       sep

. 
. est table oneman equal some sep 

------------------------------------------------------------------
    Variable |   oneman       equal         some         sep      
-------------+----------------------------------------------------
   _at#marst |
  1#Married  |  .46413617    .41521345    .06820083    .05244955  
    1#Cohab  |   .4878579    .35235632    .09203948     .0677463  
  2#Married  |  .41642708    .44798033    .07863813    .05695446  
    2#Cohab  |  .43218853    .36890349    .11479871    .08410927  
  3#Married  |  .37004248    .47884846    .08983886    .06127021  
    3#Cohab  |  .37675539    .37992325    .14072254    .10259882  
  4#Married  |  .32570585    .50724239    .10172946    .06532229  
    4#Cohab  |  .32290244    .38468476     .1694884    .12292441  
  5#Married  |  .28402416    .53269674    .11423004    .06904907  
    5#Cohab  |  .27191763    .38285039    .20057774    .14465424  
  6#Married  |  .24546096    .55487485    .12726002    .07240417  
    6#Cohab  |  .22491229    .37452496    .23331306    .16724968  
  7#Married  |  .21032428    .57357517    .14074327    .07535728  
    7#Cohab  |   .1827223    .36024382    .26691791    .19011598  
  8#Married  |  .17876857    .58872583    .15461201    .07789358  
    8#Cohab  |   .1458493    .34090199    .30058911     .2126596  
  9#Married  |  .15080865    .60036992    .16880939    .08001204  
    9#Cohab  |  .11445014    .31764006    .33356837    .23434143  
 10#Married  |  .12634193    .60864449    .18329059    .08172299  
   10#Cohab  |  .08837115    .29171057    .36520113    .25471716  
 11#Married  |  .10517524    .61375674    .19802264    .08304538  
   11#Cohab  |  .06721506    .26434967    .39497513    .27346014  
 12#Married  |  .08705231    .61596037    .21298329    .08400403  
   12#Cohab  |  .05042361    .23667357    .42253622    .29036661  
 13#Married  |  .07167949    .61553418    .22815912    .08462721  
   13#Cohab  |   .0373596    .20961039    .44768382     .3053462  
------------------------------------------------------------------

. 
. log close
      name:  <unnamed>
       log:  C:\Users\Joanna\Dropbox\Repositories\ISSP_Income-Pooling\docs\ISSPdata_FLFP_2020.02.10.log
  log type:  text
 closed on:  10 Feb 2020, 10:46:39
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
