---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\Joanna\Dropbox\Repositories\ISSP_Income-Pooling\docs\ISSPdata_2020.02.04.log
  log type:  text
 opened on:   4 Feb 2020, 15:48:38

. di "$S_DATE"
 4 Feb 2020

. ************************************************************************************************************
. /// Import the data
> 
. // Data: ISSP2012 wrangled in R. 
. use     "C:\Users\Joanna\Dropbox\Repositories\ISSP_Income-Pooling\data\ISSPdata.dta", clear
(Written by R.              )

. 
end of do-file

. count
  8,238

. do "C:\Users\Joanna\AppData\Local\Temp\STD28a4_000000.tmp"

. **********************************************************************************************************************
. *Table 3
. **********************************************************************************************************************
. // Model 1
. mlogit          pool    index                                                                   , cluster(country) rrr

Iteration 0:   log pseudolikelihood = -10037.195  
Iteration 1:   log pseudolikelihood =  -9600.197  
Iteration 2:   log pseudolikelihood = -9577.8395  
Iteration 3:   log pseudolikelihood = -9577.7508  
Iteration 4:   log pseudolikelihood = -9577.7507  

Multinomial logistic regression                 Number of obs     =      8,238
                                                Wald chi2(3)      =      51.93
                                                Prob > chi2       =     0.0000
Log pseudolikelihood = -9577.7507               Pseudo R2         =     0.0458

                                       (Std. Err. adjusted for 20 clusters in country)
--------------------------------------------------------------------------------------
                     |               Robust
                pool |        RRR   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------------+----------------------------------------------------------------
One___Manager        |
               index |   1.053781   .0110692     4.99   0.000     1.032308    1.075701
               _cons |   .1488415   .0327008    -8.67   0.000     .0967638     .228947
---------------------+----------------------------------------------------------------
Manage___Together    |  (base outcome)
---------------------+----------------------------------------------------------------
Keep_Some___Separate |
               index |    1.00322   .0148025     0.22   0.828     .9746226    1.032656
               _cons |   .3312522   .0932639    -3.92   0.000      .190767    .5751938
---------------------+----------------------------------------------------------------
Keep_All___Separate  |
               index |   1.020393   .0181795     1.13   0.257     .9853765    1.056653
               _cons |   .1461044   .0510412    -5.51   0.000     .0736712    .2897533
--------------------------------------------------------------------------------------
Note: _cons estimates baseline relative risk for each outcome.

. estat           ic

Akaike's information criterion and Bayesian information criterion

-----------------------------------------------------------------------------
       Model |        Obs  ll(null)  ll(model)      df         AIC        BIC
-------------+---------------------------------------------------------------
           . |      8,238  -10037.2  -9577.751       6     19167.5    19209.6
-----------------------------------------------------------------------------
               Note: N=Obs used in calculating BIC; see [R] BIC note.

. // Model 2
. mlogit          pool    index    i.relinc                                               , cluster(country) rrr

Iteration 0:   log pseudolikelihood = -10037.195  
Iteration 1:   log pseudolikelihood = -9556.2328  
Iteration 2:   log pseudolikelihood = -9532.5459  
Iteration 3:   log pseudolikelihood = -9532.4676  
Iteration 4:   log pseudolikelihood = -9532.4676  

Multinomial logistic regression                 Number of obs     =      8,238
                                                Wald chi2(9)      =      95.57
                                                Prob > chi2       =     0.0000
Log pseudolikelihood = -9532.4676               Pseudo R2         =     0.0503

                                        (Std. Err. adjusted for 20 clusters in country)
---------------------------------------------------------------------------------------
                      |               Robust
                 pool |        RRR   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
One___Manager         |
                index |   1.053523   .0108803     5.05   0.000     1.032412    1.075065
                      |
               relinc |
Woman primary-earner  |   .8018771   .1003248    -1.76   0.078     .6274974    1.024717
       Equal-earners  |   .5758775   .1337774    -2.38   0.018     .3652536     .907958
                      |
                _cons |   .1666339   .0361975    -8.25   0.000     .1088576    .2550749
----------------------+----------------------------------------------------------------
Manage___Together     |  (base outcome)
----------------------+----------------------------------------------------------------
Keep_Some___Separate  |
                index |   1.003259   .0147242     0.22   0.825     .9748113    1.032537
                      |
               relinc |
Woman primary-earner  |   1.321774   .1281408     2.88   0.004     1.093041    1.598372
       Equal-earners  |   1.178812   .1446661     1.34   0.180      .926794    1.499359
                      |
                _cons |   .3058217   .0877058    -4.13   0.000     .1743229    .5365153
----------------------+----------------------------------------------------------------
Keep_All___Separate   |
                index |   1.020215   .0180017     1.13   0.257     .9855358    1.056115
                      |
               relinc |
Woman primary-earner  |   1.558351   .2200636     3.14   0.002     1.181577    2.055267
       Equal-earners  |   1.147455   .1314483     1.20   0.230     .9166955    1.436303
                      |
                _cons |   .1313456   .0449591    -5.93   0.000      .067151    .2569085
---------------------------------------------------------------------------------------
Note: _cons estimates baseline relative risk for each outcome.

. estat           ic

Akaike's information criterion and Bayesian information criterion

-----------------------------------------------------------------------------
       Model |        Obs  ll(null)  ll(model)      df         AIC        BIC
-------------+---------------------------------------------------------------
           . |      8,238  -10037.2  -9532.468      12    19088.94   19173.13
-----------------------------------------------------------------------------
               Note: N=Obs used in calculating BIC; see [R] BIC note.

. // Model 3
. mlogit          pool    index    i.marst                                                , cluster(country) rrr

Iteration 0:   log pseudolikelihood = -10037.195  
Iteration 1:   log pseudolikelihood = -9388.3775  
Iteration 2:   log pseudolikelihood = -9366.3449  
Iteration 3:   log pseudolikelihood = -9366.3025  
Iteration 4:   log pseudolikelihood = -9366.3025  

Multinomial logistic regression                 Number of obs     =      8,238
                                                Wald chi2(6)      =     162.80
                                                Prob > chi2       =     0.0000
Log pseudolikelihood = -9366.3025               Pseudo R2         =     0.0668

                                       (Std. Err. adjusted for 20 clusters in country)
--------------------------------------------------------------------------------------
                     |               Robust
                pool |        RRR   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------------+----------------------------------------------------------------
One___Manager        |
               index |   1.053673   .0108237     5.09   0.000     1.032671    1.075102
                     |
               marst |
              Cohab  |   1.831597   .2482362     4.47   0.000     1.404321    2.388873
               _cons |   .1380935   .0300953    -9.08   0.000     .0900881    .2116797
---------------------+----------------------------------------------------------------
Manage___Together    |  (base outcome)
---------------------+----------------------------------------------------------------
Keep_Some___Separate |
               index |    1.00308   .0154406     0.20   0.842     .9732686    1.033804
                     |
               marst |
              Cohab  |    3.47527   .6383686     6.78   0.000     2.424557    4.981325
               _cons |   .2681763   .0739414    -4.77   0.000     .1562167    .4603765
---------------------+----------------------------------------------------------------
Keep_All___Separate  |
               index |    1.02005   .0192136     1.05   0.292     .9830791    1.058412
                     |
               marst |
              Cohab  |   4.944435   .9692373     8.15   0.000     3.367124    7.260629
               _cons |   .1065128   .0376474    -6.34   0.000     .0532772    .2129425
--------------------------------------------------------------------------------------
Note: _cons estimates baseline relative risk for each outcome.

. estat           ic

Akaike's information criterion and Bayesian information criterion

-----------------------------------------------------------------------------
       Model |        Obs  ll(null)  ll(model)      df         AIC        BIC
-------------+---------------------------------------------------------------
           . |      8,238  -10037.2  -9366.302       9     18750.6   18813.75
-----------------------------------------------------------------------------
               Note: N=Obs used in calculating BIC; see [R] BIC note.

. 
. 
. **********************************************************************************************************************
. *Table 4 - Model 4
. **********************************************************************************************************************
. global  ivars "sex age parent i.employ homemaker ib4.degree hswrk respmom famlife"

. 
. mlogit          pool    index i.relinc          i.marst         $ivars                                  , cluster(country) rrr

Iteration 0:   log pseudolikelihood = -10037.195  
Iteration 1:   log pseudolikelihood = -9010.4598  
Iteration 2:   log pseudolikelihood = -8971.9687  
Iteration 3:   log pseudolikelihood = -8971.7086  
Iteration 4:   log pseudolikelihood = -8971.7084  

Multinomial logistic regression                 Number of obs     =      8,238
                                                Wald chi2(16)     =          .
                                                Prob > chi2       =          .
Log pseudolikelihood = -8971.7084               Pseudo R2         =     0.1062

                                        (Std. Err. adjusted for 20 clusters in country)
---------------------------------------------------------------------------------------
                      |               Robust
                 pool |        RRR   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
One___Manager         |
                index |    1.04604   .0116002     4.06   0.000     1.023549    1.069025
                      |
               relinc |
Woman primary-earner  |    .914907   .1283839    -0.63   0.526     .6949162    1.204541
       Equal-earners  |   .6402994   .1347159    -2.12   0.034     .4239302    .9671009
                      |
                marst |
               Cohab  |   1.673016   .2305079     3.74   0.000      1.27709    2.191687
                  sex |   .9494194   .1500335    -0.33   0.743     .6965393    1.294108
                  age |   .9891317   .0047027    -2.30   0.022     .9799573    .9983919
               parent |   .9512046   .1335327    -0.36   0.722     .7224037    1.252472
                      |
               employ |
            Parttime  |   1.296354   .1478954     2.28   0.023     1.036606    1.621188
          Unemployed  |   1.391986   .3835368     1.20   0.230     .8111503    2.388736
             Student  |   1.422021   .2251523     2.22   0.026     1.042636    1.939451
  Not in labor force  |   .8269692   .1112272    -1.41   0.158     .6353352    1.076405
                      |
            homemaker |   1.063356   .1144387     0.57   0.568     .8611368    1.313062
                      |
               degree |
 No formal education  |   1.685475    .340272     2.59   0.010     1.134691    2.503612
      Primary school  |   1.453557   .2630647     2.07   0.039     1.019486    2.072442
     Lower secondary  |   1.028048   .1715361     0.17   0.868     .7412854    1.425745
      Post secondary  |   .9728462   .1809639    -0.15   0.882     .6756286    1.400814
Lower level tertiary  |   .7579313   .1718224    -1.22   0.221       .48603    1.181943
Upper level tertiary  |   .5315194   .0903126    -3.72   0.000     .3809675    .7415667
                      |
                hswrk |   .8992085   .0262233    -3.64   0.000     .8492531    .9521025
              respmom |   .9301704   .0839519    -0.80   0.423     .7793596    1.110164
              famlife |    .842757   .0757485    -1.90   0.057     .7066344    1.005101
                _cons |   1.328946   .8652664     0.44   0.662     .3709338    4.761218
----------------------+----------------------------------------------------------------
Manage___Together     |  (base outcome)
----------------------+----------------------------------------------------------------
Keep_Some___Separate  |
                index |   1.012316   .0140207     0.88   0.377     .9852053    1.040172
                      |
               relinc |
Woman primary-earner  |   1.121723   .1201986     1.07   0.284     .9092323    1.383874
       Equal-earners  |   .9832847    .121049    -0.14   0.891      .772486    1.251607
                      |
                marst |
               Cohab  |   3.084654   .5189405     6.70   0.000     2.218228    4.289499
                  sex |   1.049849   .1199031     0.43   0.670     .8392882    1.313235
                  age |   .9836633   .0039331    -4.12   0.000     .9759846    .9914024
               parent |   .9240821   .0823339    -0.89   0.376     .7760151    1.100401
                      |
               employ |
            Parttime  |   .6879955   .1116873    -2.30   0.021     .5004998    .9457303
          Unemployed  |   .7832559   .1800352    -1.06   0.288     .4991727    1.229013
             Student  |   .6619622   .0867419    -3.15   0.002     .5120282    .8558004
  Not in labor force  |   .8546121     .11538    -1.16   0.245     .6559179    1.113496
                      |
            homemaker |   .7221621   .0783523    -3.00   0.003     .5838241    .8932796
                      |
               degree |
 No formal education  |   1.617982   .6818878     1.14   0.254      .708338    3.695787
      Primary school  |   .7619253   .1179633    -1.76   0.079     .5625059    1.032043
     Lower secondary  |   .9693686   .1293872    -0.23   0.816     .7462326    1.259226
      Post secondary  |   .9983395   .1585509    -0.01   0.992     .7312991    1.362892
Lower level tertiary  |   1.519048   .1613674     3.94   0.000     1.233528    1.870656
Upper level tertiary  |   2.035098   .2538534     5.70   0.000     1.593706    2.598736
                      |
                hswrk |    .983207   .0201952    -0.82   0.410     .9444113    1.023596
              respmom |   1.300897    .162799     2.10   0.036     1.017936    1.662515
              famlife |   .7931044   .0321387    -5.72   0.000     .7325501    .8586642
                _cons |   1.775047   .6706423     1.52   0.129       .84647     3.72227
----------------------+----------------------------------------------------------------
Keep_All___Separate   |
                index |   1.025888   .0137831     1.90   0.057     .9992265    1.053262
                      |
               relinc |
Woman primary-earner  |   1.224638   .1739591     1.43   0.154     .9270325    1.617783
       Equal-earners  |   .9132712   .1033204    -0.80   0.423     .7316467    1.139982
                      |
                marst |
               Cohab  |   4.513547   .8550302     7.96   0.000     3.113647    6.542844
                  sex |   1.145636   .1359509     1.15   0.252     .9078955    1.445631
                  age |   .9934073   .0074723    -0.88   0.379     .9788693    1.008161
               parent |   .9254294   .1192089    -0.60   0.547     .7189455    1.191216
                      |
               employ |
            Parttime  |   .5101679   .0952727    -3.60   0.000     .3537963    .7356531
          Unemployed  |   1.318704   .4387439     0.83   0.406     .6869825    2.531333
             Student  |   .7840283   .2100075    -0.91   0.364     .4638007    1.325354
  Not in labor force  |   1.199935   .1315557     1.66   0.096     .9679119    1.487578
                      |
            homemaker |   .6833709   .0832071    -3.13   0.002     .5382876    .8675581
                      |
               degree |
 No formal education  |   1.573988   .4611442     1.55   0.122     .8863763     2.79502
      Primary school  |   1.090771   .2692768     0.35   0.725     .6723553    1.769572
     Lower secondary  |   1.282712   .2477167     1.29   0.197      .878508    1.872893
      Post secondary  |    1.36671   .2013012     2.12   0.034      1.02401    1.824101
Lower level tertiary  |   1.539227   .2160189     3.07   0.002     1.169077    2.026574
Upper level tertiary  |   1.669526   .3808626     2.25   0.025     1.067608    2.610806
                      |
                hswrk |   1.057242   .0278306     2.11   0.034     1.004078     1.11322
              respmom |   .9305577   .1459762    -0.46   0.646     .6842514    1.265526
              famlife |   .6579637   .0185384   -14.86   0.000     .6226142    .6953203
                _cons |   1.510134   .8245637     0.75   0.450     .5178959    4.403406
---------------------------------------------------------------------------------------
Note: _cons estimates baseline relative risk for each outcome.

. estat           ic

Akaike's information criterion and Bayesian information criterion

-----------------------------------------------------------------------------
       Model |        Obs  ll(null)  ll(model)      df         AIC        BIC
-------------+---------------------------------------------------------------
           . |      8,238  -10037.2  -8971.708      19    17981.42   18114.73
-----------------------------------------------------------------------------
               Note: N=Obs used in calculating BIC; see [R] BIC note.

. 
. **********************************************************************************************************************
. *Table 4 - Model 5
. **********************************************************************************************************************
. global  ivars " sex age parent i.employ homemaker ib4.degree hswrk respmom famlife"

. 
. mlogit          pool    c.index##i.relinc       i.marst         $ivars                                  , cluster(country) rrr

Iteration 0:   log pseudolikelihood = -10037.195  
Iteration 1:   log pseudolikelihood = -9000.9724  
Iteration 2:   log pseudolikelihood = -8960.1204  
Iteration 3:   log pseudolikelihood = -8959.8446  
Iteration 4:   log pseudolikelihood = -8959.8445  

Multinomial logistic regression                 Number of obs     =      8,238
                                                Wald chi2(16)     =          .
                                                Prob > chi2       =          .
Log pseudolikelihood = -8959.8445               Pseudo R2         =     0.1073

                                        (Std. Err. adjusted for 20 clusters in country)
---------------------------------------------------------------------------------------
                      |               Robust
                 pool |        RRR   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
One___Manager         |
                index |   1.051805   .0120456     4.41   0.000     1.028459     1.07568
                      |
               relinc |
Woman primary-earner  |   1.226959   .2135341     1.18   0.240     .8723506    1.725715
       Equal-earners  |    1.02832    .295056     0.10   0.922     .5859934    1.804528
                      |
       relinc#c.index |
Woman primary-earner  |    .986929   .0092426    -1.40   0.160     .9689791    1.005211
       Equal-earners  |   .9768226   .0082374    -2.78   0.005     .9608103    .9931017
                      |
                marst |
               Cohab  |   1.661336   .2335185     3.61   0.000     1.261281     2.18828
                  sex |   .9509201   .1503384    -0.32   0.750     .6975429    1.296335
                  age |   .9895366   .0047503    -2.19   0.028     .9802698    .9988911
               parent |   .9618865   .1368157    -0.27   0.785     .7278662    1.271148
                      |
               employ |
            Parttime  |   1.308728   .1484463     2.37   0.018      1.04785    1.634554
          Unemployed  |   1.409091    .387857     1.25   0.213     .8215668    2.416769
             Student  |   1.410422   .2239554     2.17   0.030     1.033214    1.925343
  Not in labor force  |    .821521   .1109887    -1.46   0.146     .6304056    1.070575
                      |
            homemaker |   1.070732   .1160242     0.63   0.528     .8658541    1.324087
                      |
               degree |
 No formal education  |    1.66827   .3302811     2.59   0.010     1.131741    2.459154
      Primary school  |   1.450426   .2679646     2.01   0.044     1.009804    2.083311
     Lower secondary  |   1.035736   .1734087     0.21   0.834     .7459958    1.438011
      Post secondary  |   .9767019   .1793681    -0.13   0.898      .681462    1.399853
Lower level tertiary  |   .7594031   .1723044    -1.21   0.225     .4867876    1.184692
Upper level tertiary  |   .5317956    .090541    -3.71   0.000     .3809107    .7424485
                      |
                hswrk |   .8989466   .0258324    -3.71   0.000     .8497154    .9510302
              respmom |   .9365591   .0834063    -0.74   0.462     .7865575    1.115167
              famlife |   .8445535   .0756631    -1.89   0.059     .7085466    1.006667
                _cons |   1.103165   .6966477     0.16   0.876     .3199688    3.803413
----------------------+----------------------------------------------------------------
Manage___Together     |  (base outcome)
----------------------+----------------------------------------------------------------
Keep_Some___Separate  |
                index |   1.016445   .0158017     1.05   0.294     .9859414    1.047892
                      |
               relinc |
Woman primary-earner  |   1.190754   .1938563     1.07   0.284     .8654566     1.63832
       Equal-earners  |   1.345804   .3758708     1.06   0.288     .7784829    2.326562
                      |
       relinc#c.index |
Woman primary-earner  |   .9960149   .0087793    -0.45   0.651     .9789555    1.013372
       Equal-earners  |   .9788444    .017704    -1.18   0.237      .944753    1.014166
                      |
                marst |
               Cohab  |   3.068412   .5196423     6.62   0.000     2.201713    4.276283
                  sex |   1.052136   .1184858     0.45   0.652     .8437512    1.311987
                  age |   .9838313   .0039875    -4.02   0.000      .976047    .9916777
               parent |   .9284838   .0844346    -0.82   0.415     .7769045    1.109637
                      |
               employ |
            Parttime  |   .6887451   .1129242    -2.27   0.023     .4994574    .9497702
          Unemployed  |   .7839412   .1833519    -1.04   0.298     .4956789    1.239843
             Student  |   .6536995   .0822397    -3.38   0.001     .5108476    .8364981
  Not in labor force  |   .8486153   .1133988    -1.23   0.219       .65308    1.102695
                      |
            homemaker |   .7225039   .0778792    -3.02   0.003     .5849094    .8924663
                      |
               degree |
 No formal education  |   1.562561   .6147329     1.13   0.257     .7227073    3.378402
      Primary school  |   .7564062   .1158112    -1.82   0.068     .5603122    1.021128
     Lower secondary  |   .9734021   .1307857    -0.20   0.841     .7480409    1.266657
      Post secondary  |    1.00396   .1595787     0.02   0.980     .7352221    1.370927
Lower level tertiary  |    1.52129   .1601245     3.99   0.000     1.237708    1.869846
Upper level tertiary  |   2.036916   .2546388     5.69   0.000     1.594273    2.602457
                      |
                hswrk |   .9831725   .0200683    -0.83   0.406     .9446158    1.023303
              respmom |   1.306587   .1637213     2.13   0.033     1.022066    1.670313
              famlife |   .7942219    .032106    -5.70   0.000     .7337236    .8597085
                _cons |   1.614378   .6453523     1.20   0.231     .7374543    3.534073
----------------------+----------------------------------------------------------------
Keep_All___Separate   |
                index |   1.028463   .0163711     1.76   0.078     .9968715    1.061056
                      |
               relinc |
Woman primary-earner  |   1.397493   .3245639     1.44   0.150      .886463    2.203124
       Equal-earners  |    .968673   .1811182    -0.17   0.865     .6714648    1.397433
                      |
       relinc#c.index |
Woman primary-earner  |   .9917808   .0095169    -0.86   0.390     .9733023     1.01061
       Equal-earners  |   .9950337    .009451    -0.52   0.600     .9766814    1.013731
                      |
                marst |
               Cohab  |   4.495198   .8559942     7.89   0.000     3.094992    6.528872
                  sex |   1.148169   .1323388     1.20   0.231     .9160008    1.439183
                  age |   .9935979   .0074085    -0.86   0.389     .9791831    1.008225
               parent |   .9262039   .1193882    -0.59   0.552     .7194262    1.192414
                      |
               employ |
            Parttime  |   .5123191   .0973418    -3.52   0.000     .3530289    .7434826
          Unemployed  |   1.316211    .439627     0.82   0.411     .6839368    2.532998
             Student  |   .7792229   .2054494    -0.95   0.344     .4647661    1.306438
  Not in labor force  |   1.198688   .1319694     1.65   0.100     .9660354     1.48737
                      |
            homemaker |   .6846828   .0838335    -3.09   0.002      .538601    .8703856
                      |
               degree |
 No formal education  |   1.589934   .4767578     1.55   0.122     .8833595    2.861676
      Primary school  |   1.086694   .2692908     0.34   0.737     .6686103    1.766205
     Lower secondary  |    1.28252    .249167     1.28   0.200     .8763823    1.876873
      Post secondary  |   1.365206   .2007734     2.12   0.034     1.023332    1.821293
Lower level tertiary  |   1.539603   .2145908     3.10   0.002     1.171569    2.023251
Upper level tertiary  |   1.663966   .3735751     2.27   0.023     1.071623    2.583727
                      |
                hswrk |   1.057645   .0281368     2.11   0.035     1.003911    1.114256
              respmom |   .9346602   .1458335    -0.43   0.665      .688402    1.269011
              famlife |   .6586477   .0183848   -14.96   0.000      .623582    .6956852
                _cons |   1.415995   .7817715     0.63   0.529     .4798579    4.178405
---------------------------------------------------------------------------------------
Note: _cons estimates baseline relative risk for each outcome.

. estat           ic

Akaike's information criterion and Bayesian information criterion

-----------------------------------------------------------------------------
       Model |        Obs  ll(null)  ll(model)      df         AIC        BIC
-------------+---------------------------------------------------------------
           . |      8,238  -10037.2  -8959.844      19    17957.69      18091
-----------------------------------------------------------------------------
               Note: N=Obs used in calculating BIC; see [R] BIC note.

. 
. // Figure 2
. mlogit          pool    c.index##i.relinc       i.marst         $ivars                                  , cluster(country)

Iteration 0:   log pseudolikelihood = -10037.195  
Iteration 1:   log pseudolikelihood = -9000.9724  
Iteration 2:   log pseudolikelihood = -8960.1204  
Iteration 3:   log pseudolikelihood = -8959.8446  
Iteration 4:   log pseudolikelihood = -8959.8445  

Multinomial logistic regression                 Number of obs     =      8,238
                                                Wald chi2(16)     =          .
                                                Prob > chi2       =          .
Log pseudolikelihood = -8959.8445               Pseudo R2         =     0.1073

                                        (Std. Err. adjusted for 20 clusters in country)
---------------------------------------------------------------------------------------
                      |               Robust
                 pool |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
One___Manager         |
                index |   .0505073   .0114523     4.41   0.000     .0280613    .0729534
                      |
               relinc |
Woman primary-earner  |   .2045389   .1740352     1.18   0.240    -.1365639    .5456417
       Equal-earners  |   .0279261   .2869302     0.10   0.922    -.5344468     .590299
                      |
       relinc#c.index |
Woman primary-earner  |  -.0131571    .009365    -1.40   0.160    -.0315122    .0051979
       Equal-earners  |  -.0234502   .0084328    -2.78   0.005    -.0399783   -.0069222
                      |
                marst |
               Cohab  |   .5076219   .1405607     3.61   0.000      .232128    .7831158
                  sex |  -.0503253   .1580978    -0.32   0.750    -.3601913    .2595408
                  age |  -.0105185   .0048006    -2.19   0.028    -.0199274   -.0011095
               parent |  -.0388589   .1422369    -0.27   0.785     -.317638    .2399203
                      |
               employ |
            Parttime  |   .2690555   .1134279     2.37   0.018     .0467409    .4913702
          Unemployed  |   .3429447   .2752534     1.25   0.213    -.1965421    .8824314
             Student  |   .3438891   .1587861     2.17   0.030     .0326742    .6551041
  Not in labor force  |  -.1965978   .1351015    -1.46   0.146    -.4613918    .0681962
                      |
            homemaker |   .0683423   .1083597     0.63   0.528    -.1440388    .2807235
                      |
               degree |
 No formal education  |   .5117873   .1979782     2.59   0.010     .1237572    .8998174
      Primary school  |   .3718573   .1847489     2.01   0.044     .0097561    .7339585
     Lower secondary  |   .0351127   .1674255     0.21   0.834    -.2930354    .3632607
      Post secondary  |  -.0235738   .1836467    -0.13   0.898    -.3835148    .3363672
Lower level tertiary  |  -.2752225   .2268945    -1.21   0.225    -.7199275    .1694824
Upper level tertiary  |   -.631496   .1702553    -3.71   0.000    -.9651903   -.2978017
                      |
                hswrk |  -.1065317   .0287363    -3.71   0.000    -.1628539   -.0502095
              respmom |  -.0655426   .0890561    -0.74   0.462    -.2400894    .1090042
              famlife |  -.1689472   .0895895    -1.89   0.059    -.3445394     .006645
                _cons |   .0981835    .631499     0.16   0.876    -1.139532    1.335899
----------------------+----------------------------------------------------------------
Manage___Together     |  (base outcome)
----------------------+----------------------------------------------------------------
Keep_Some___Separate  |
                index |   .0163113    .015546     1.05   0.294    -.0141583    .0467809
                      |
               relinc |
Woman primary-earner  |   .1745867   .1628013     1.07   0.284     -.144498    .4936714
       Equal-earners  |   .2969917   .2792908     1.06   0.288    -.2504083    .8443917
                      |
       relinc#c.index |
Woman primary-earner  |  -.0039931   .0088145    -0.45   0.651    -.0212691     .013283
       Equal-earners  |  -.0213826   .0180866    -1.18   0.237    -.0568318    .0140666
                      |
                marst |
               Cohab  |    1.12116   .1693522     6.62   0.000     .7892357    1.453084
                  sex |   .0508227   .1126145     0.45   0.652    -.1698976     .271543
                  age |  -.0163008    .004053    -4.02   0.000    -.0242446   -.0083571
               parent |  -.0742024   .0909382    -0.82   0.415    -.2524379    .1040331
                      |
               employ |
            Parttime  |  -.3728841   .1639565    -2.27   0.023    -.6942329   -.0515352
          Unemployed  |  -.2434212   .2338848    -1.04   0.298     -.701827    .2149845
             Student  |  -.4251075   .1258066    -3.38   0.001    -.6716839    -.178531
  Not in labor force  |  -.1641493   .1336281    -1.23   0.219    -.4260556    .0977569
                      |
            homemaker |  -.3250324   .1077907    -3.02   0.003    -.5362982   -.1137666
                      |
               degree |
 No formal education  |    .446326   .3934138     1.13   0.257    -.3247509    1.217403
      Primary school  |  -.2791767   .1531071    -1.82   0.068    -.5792611    .0209077
     Lower secondary  |   -.026958   .1343594    -0.20   0.841    -.2902976    .2363815
      Post secondary  |   .0039522   .1589493     0.02   0.980    -.3075826    .3154871
Lower level tertiary  |   .4195587   .1052557     3.99   0.000     .2132613    .6258561
Upper level tertiary  |    .711437   .1250119     5.69   0.000     .4664181    .9564559
                      |
                hswrk |  -.0169707   .0204117    -0.83   0.406     -.056977    .0230356
              respmom |   .2674187   .1253045     2.13   0.033     .0218263     .513011
              famlife |  -.2303924   .0404245    -5.70   0.000    -.3096229   -.1511619
                _cons |   .4789499   .3997528     1.20   0.231    -.3045511    1.262451
----------------------+----------------------------------------------------------------
Keep_All___Separate   |
                index |   .0280654    .015918     1.76   0.078    -.0031334    .0592642
                      |
               relinc |
Woman primary-earner  |   .3346802   .2322472     1.44   0.150    -.1205159    .7898762
       Equal-earners  |  -.0318282   .1869756    -0.17   0.865    -.3982936    .3346372
                      |
       relinc#c.index |
Woman primary-earner  |  -.0082531   .0095958    -0.86   0.390    -.0270605    .0105543
       Equal-earners  |  -.0049787   .0094982    -0.52   0.600    -.0235948    .0136374
                      |
                marst |
               Cohab  |    1.50301   .1904241     7.89   0.000     1.129785    1.876234
                  sex |   .1381688   .1152607     1.20   0.231    -.0877381    .3640757
                  age |  -.0064227   .0074562    -0.86   0.389    -.0210366    .0081912
               parent |  -.0766608   .1289006    -0.59   0.552    -.3293013    .1759797
                      |
               employ |
            Parttime  |  -.6688077   .1900023    -3.52   0.000    -1.041205     -.29641
          Unemployed  |    .274757   .3340096     0.82   0.411    -.3798898    .9294037
             Student  |  -.2494582   .2636594    -0.95   0.344     -.766221    .2673047
  Not in labor force  |   .1812273   .1100949     1.65   0.100    -.0345548    .3970094
                      |
            homemaker |  -.3787996   .1224414    -3.09   0.002    -.6187803    -.138819
                      |
               degree |
 No formal education  |   .4636922   .2998602     1.55   0.122     -.124023    1.051407
      Primary school  |   .0831397   .2478074     0.34   0.737    -.4025539    .5688334
     Lower secondary  |   .2488272   .1942791     1.28   0.200    -.1319529    .6296074
      Post secondary  |   .3113055   .1470645     2.12   0.034     .0230644    .5995466
Lower level tertiary  |   .4315247   .1393806     3.10   0.002     .1583438    .7047057
Upper level tertiary  |   .5092037   .2245089     2.27   0.023     .0691742    .9492331
                      |
                hswrk |   .0560451   .0266033     2.11   0.035     .0039037    .1081866
              respmom |  -.0675723   .1560284    -0.43   0.665    -.3733822    .2382377
              famlife |  -.4175666    .027913   -14.96   0.000     -.472275   -.3628581
                _cons |   .3478321   .5521007     0.63   0.529    -.7342653     1.42993
---------------------------------------------------------------------------------------

. 
. margin  relinc, at(index=(5(2)62)) predict(outcome(1))  /* One Manages  */

Predictive margins                              Number of obs     =      8,238
Model VCE    : Robust

Expression   : Pr(pool==One___Manager), predict(outcome(1))

1._at        : index           =           5

2._at        : index           =           7

3._at        : index           =           9

4._at        : index           =          11

5._at        : index           =          13

6._at        : index           =          15

7._at        : index           =          17

8._at        : index           =          19

9._at        : index           =          21

10._at       : index           =          23

11._at       : index           =          25

12._at       : index           =          27

13._at       : index           =          29

14._at       : index           =          31

15._at       : index           =          33

16._at       : index           =          35

17._at       : index           =          37

18._at       : index           =          39

19._at       : index           =          41

20._at       : index           =          43

21._at       : index           =          45

22._at       : index           =          47

23._at       : index           =          49

24._at       : index           =          51

25._at       : index           =          53

26._at       : index           =          55

27._at       : index           =          57

28._at       : index           =          59

29._at       : index           =          61

------------------------------------------------------------------------------------------
                         |            Delta-method
                         |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------------------+----------------------------------------------------------------
              _at#relinc |
   1#Man primary-earner  |   .1317326   .0229671     5.74   0.000     .0867179    .1767474
 1#Woman primary-earner  |   .1405667   .0159498     8.81   0.000     .1093058    .1718277
        1#Equal-earners  |   .1188837   .0306375     3.88   0.000     .0588353     .178932
   2#Man primary-earner  |   .1419173   .0218028     6.51   0.000     .0991845    .1846501
 2#Woman primary-earner  |   .1483007    .015197     9.76   0.000     .1185152    .1780863
        2#Equal-earners  |   .1242625   .0298446     4.16   0.000     .0657681    .1827569
   3#Man primary-earner  |    .152684   .0205952     7.41   0.000     .1123181    .1930499
 3#Woman primary-earner  |   .1563438   .0147437    10.60   0.000     .1274466    .1852409
        3#Equal-earners  |   .1298198   .0290545     4.47   0.000     .0728741    .1867655
   4#Man primary-earner  |   .1640387    .019499     8.41   0.000     .1258213    .2022561
 4#Woman primary-earner  |   .1646971   .0147413    11.17   0.000     .1358047    .1935896
        4#Equal-earners  |   .1355563   .0283054     4.79   0.000     .0800787     .191034
   5#Man primary-earner  |   .1759836   .0187515     9.39   0.000     .1392314    .2127357
 5#Woman primary-earner  |   .1733612    .015324    11.31   0.000     .1433267    .2033957
        5#Equal-earners  |   .1414723   .0276464     5.12   0.000     .0872864    .1956582
   6#Man primary-earner  |    .188517   .0186647    10.10   0.000     .1519349    .2250991
 6#Woman primary-earner  |   .1823351   .0165671    11.01   0.000      .149864    .2148061
        6#Equal-earners  |   .1475675   .0271371     5.44   0.000     .0943797    .2007553
   7#Man primary-earner  |   .2016332   .0195543    10.31   0.000     .1633074    .2399589
 7#Woman primary-earner  |   .1916167   .0184715    10.37   0.000     .1554133    .2278202
        7#Equal-earners  |   .1538413   .0268471     5.73   0.000      .101222    .2064606
   8#Man primary-earner  |   .2153218   .0216184     9.96   0.000     .1729505    .2576931
 8#Woman primary-earner  |   .2012031   .0209841     9.59   0.000      .160075    .2423311
        8#Equal-earners  |   .1602925   .0268515     5.97   0.000     .1076647    .2129204
   9#Man primary-earner  |   .2295682    .024874     9.23   0.000      .180816    .2783204
 9#Woman primary-earner  |   .2110895   .0240319     8.78   0.000     .1639879    .2581912
        9#Equal-earners  |   .1669194   .0272245     6.13   0.000     .1135604    .2202785
  10#Man primary-earner  |   .2443528   .0292098     8.37   0.000     .1871026     .301603
10#Woman primary-earner  |   .2212705   .0275443     8.03   0.000     .1672846    .2752564
       10#Equal-earners  |   .1737198   .0280306     6.20   0.000     .1187809    .2286587
  11#Man primary-earner  |   .2596516   .0344754     7.53   0.000     .1920811     .327222
11#Woman primary-earner  |    .231739   .0314621     7.37   0.000     .1700744    .2934035
       11#Equal-earners  |   .1806909    .029316     6.16   0.000     .1232327    .2381492
  12#Man primary-earner  |   .2754359   .0405321     6.80   0.000     .1959945    .3548773
12#Woman primary-earner  |   .2424866   .0357373     6.79   0.000     .1724429    .3125304
       12#Equal-earners  |   .1878294   .0311044     6.04   0.000      .126866    .2487928
  13#Man primary-earner  |   .2916728   .0472655     6.17   0.000     .1990342    .3843114
13#Woman primary-earner  |    .253504   .0403313     6.29   0.000     .1744562    .3325518
       13#Equal-earners  |   .1951314   .0333973     5.84   0.000     .1296738     .260589
  14#Man primary-earner  |   .3083251   .0545809     5.65   0.000     .2013486    .4153016
14#Woman primary-earner  |   .2647802   .0452116     5.86   0.000     .1761671    .3533934
       14#Equal-earners  |   .2025924   .0361793     5.60   0.000     .1316823    .2735026
  15#Man primary-earner  |   .3253519   .0623964     5.21   0.000     .2030572    .4476466
15#Woman primary-earner  |   .2763033   .0503501     5.49   0.000     .1776189    .3749877
       15#Equal-earners  |   .2102076   .0394239     5.33   0.000     .1329382    .2874769
  16#Man primary-earner  |   .3427091   .0706375     4.85   0.000     .2042622     .481156
16#Woman primary-earner  |   .2880601    .055721     5.17   0.000      .178849    .3972712
       16#Equal-earners  |   .2179712   .0430998     5.06   0.000     .1334972    .3024453
  17#Man primary-earner  |   .3603495   .0792328     4.55   0.000      .205056     .515643
17#Woman primary-earner  |   .3000364   .0612997     4.89   0.000     .1798912    .4201816
       17#Equal-earners  |   .2258773    .047175     4.79   0.000      .133416    .3183386
  18#Man primary-earner  |   .3782238   .0881127     4.29   0.000     .2055261    .5509214
18#Woman primary-earner  |   .3122168   .0670625     4.66   0.000     .1807766     .443657
       18#Equal-earners  |   .2339192    .051619     4.53   0.000     .1327478    .3350906
  19#Man primary-earner  |   .3962808   .0972074     4.08   0.000     .2057578    .5868039
19#Woman primary-earner  |   .3245852   .0729858     4.45   0.000     .1815355    .4676348
       19#Equal-earners  |   .2420897   .0564038     4.29   0.000     .1315403    .3526391
  20#Man primary-earner  |   .4144686   .1064477     3.89   0.000      .205835    .6231021
20#Woman primary-earner  |   .3371244   .0790459     4.26   0.000     .1821973    .4920515
       20#Equal-earners  |   .2503813   .0615042     4.07   0.000     .1298354    .3709272
  21#Man primary-earner  |   .4327343   .1157641     3.74   0.000     .2058408    .6596279
21#Woman primary-earner  |   .3498167   .0852187     4.10   0.000      .182791    .5168423
       21#Equal-earners  |   .2587858   .0668973     3.87   0.000     .1276694    .3899022
  22#Man primary-earner  |   .4510257   .1250884     3.61   0.000     .2058568    .6961945
22#Woman primary-earner  |   .3626436   .0914803     3.96   0.000     .1833455    .5419416
       22#Equal-earners  |   .2672948   .0725627     3.68   0.000     .1250744    .4095151
  23#Man primary-earner  |   .4692909   .1343535     3.49   0.000     .2059629     .732619
23#Woman primary-earner  |   .3755861   .0978061     3.84   0.000     .1838897    .5672825
       23#Equal-earners  |   .2758992   .0784815     3.52   0.000     .1220783      .42972
  24#Man primary-earner  |   .4874799   .1434945     3.40   0.001     .2062358    .7687239
24#Woman primary-earner  |   .3886249   .1041718     3.73   0.000      .184452    .5927979
       24#Equal-earners  |   .2845898   .0846359     3.36   0.001     .1187064    .4504732
  25#Man primary-earner  |    .505544   .1524494     3.32   0.001     .2067486    .8043394
25#Woman primary-earner  |   .4017405   .1105529     3.63   0.000     .1850608    .6184201
       25#Equal-earners  |   .2933569   .0910097     3.22   0.001     .1149812    .4717326
  26#Man primary-earner  |   .5234373   .1611599     3.25   0.001     .2075697    .8393049
26#Woman primary-earner  |   .4149129   .1169251     3.55   0.000      .185744    .6440819
       26#Equal-earners  |   .3021908   .0975869     3.10   0.002     .1109238    .4934577
  27#Man primary-earner  |   .5411163   .1695718     3.19   0.001     .2087617     .873471
27#Woman primary-earner  |   .4281225   .1232645     3.47   0.001     .1865286    .6697165
       27#Equal-earners  |   .3110811   .1043526     2.98   0.003     .1065537    .5156085
  28#Man primary-earner  |   .5585409   .1776358     3.14   0.002      .210381    .9067007
28#Woman primary-earner  |   .4413496   .1295475     3.41   0.001     .1874411    .6952581
       28#Equal-earners  |   .3200176   .1112922     2.88   0.004      .101889    .5381463
  29#Man primary-earner  |    .575674   .1853078     3.11   0.002     .2124774    .9388706
29#Woman primary-earner  |   .4545747   .1357514     3.35   0.001     .1885069    .7206425
       29#Equal-earners  |   .3289899   .1183912     2.78   0.005     .0969474    .5610325
------------------------------------------------------------------------------------------

. margin  relinc, at(index=(5(2)62)) predict(outcome(2))  /* Manage Equal */

Predictive margins                              Number of obs     =      8,238
Model VCE    : Robust

Expression   : Pr(pool==Manage___Together), predict(outcome(2))

1._at        : index           =           5

2._at        : index           =           7

3._at        : index           =           9

4._at        : index           =          11

5._at        : index           =          13

6._at        : index           =          15

7._at        : index           =          17

8._at        : index           =          19

9._at        : index           =          21

10._at       : index           =          23

11._at       : index           =          25

12._at       : index           =          27

13._at       : index           =          29

14._at       : index           =          31

15._at       : index           =          33

16._at       : index           =          35

17._at       : index           =          37

18._at       : index           =          39

19._at       : index           =          41

20._at       : index           =          43

21._at       : index           =          45

22._at       : index           =          47

23._at       : index           =          49

24._at       : index           =          51

25._at       : index           =          53

26._at       : index           =          55

27._at       : index           =          57

28._at       : index           =          59

29._at       : index           =          61

------------------------------------------------------------------------------------------
                         |            Delta-method
                         |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------------------+----------------------------------------------------------------
              _at#relinc |
   1#Man primary-earner  |   .6056179   .0315456    19.20   0.000     .5437897    .6674461
 1#Woman primary-earner  |   .5649217   .0372522    15.16   0.000     .4919088    .6379347
        1#Equal-earners  |   .5952551    .044388    13.41   0.000     .5082563     .682254
   2#Man primary-earner  |   .5916078   .0293039    20.19   0.000     .5341733    .6490423
 2#Woman primary-earner  |   .5543951    .034003    16.30   0.000     .4877505    .6210398
        2#Equal-earners  |   .5904542   .0422062    13.99   0.000     .5077316    .6731767
   3#Man primary-earner  |   .5772222   .0273704    21.09   0.000     .5235773    .6308672
 3#Woman primary-earner  |   .5436971   .0312666    17.39   0.000     .4824157    .6049784
        3#Equal-earners  |   .5854292   .0401103    14.60   0.000     .5068144     .664044
   4#Man primary-earner  |    .562476   .0257741    21.82   0.000     .5119597    .6129923
 4#Woman primary-earner  |   .5328348   .0291902    18.25   0.000     .4756231    .5900465
        4#Equal-earners  |   .5801795    .038118    15.22   0.000     .5054695    .6548895
   5#Man primary-earner  |   .5473875   .0245335    22.31   0.000     .4993027    .5954722
 5#Woman primary-earner  |   .5218166   .0279166    18.69   0.000     .4671011    .5765322
        5#Equal-earners  |   .5747047   .0362521    15.85   0.000      .503652    .6457575
   6#Man primary-earner  |   .5319784   .0236525    22.49   0.000     .4856203    .5783365
 6#Woman primary-earner  |   .5106518   .0275444    18.54   0.000     .4566658    .5646378
        6#Equal-earners  |   .5690052   .0345412    16.47   0.000     .5013056    .6367047
   7#Man primary-earner  |   .5162744    .023119    22.33   0.000      .470962    .5615868
 7#Woman primary-earner  |   .4993505   .0280885    17.78   0.000      .444298    .5544031
        7#Equal-earners  |   .5630817   .0330205    17.05   0.000     .4983627    .6278008
   8#Man primary-earner  |   .5003044   .0229051    21.84   0.000     .4554113    .5451976
 8#Woman primary-earner  |   .4879238   .0294708    16.56   0.000     .4301621    .5456856
        8#Equal-earners  |   .5569359    .031731    17.55   0.000     .4947443    .6191275
   9#Man primary-earner  |   .4841012   .0229719    21.07   0.000     .4390771    .5291253
 9#Woman primary-earner  |   .4763838   .0315483    15.10   0.000     .4145503    .5382173
        9#Equal-earners  |   .5505699   .0307178    17.92   0.000     .4903642    .6107755
  10#Man primary-earner  |   .4677004   .0232752    20.09   0.000     .4220819    .5133189
10#Woman primary-earner  |   .4647434   .0341572    13.61   0.000     .3977966    .5316902
       10#Equal-earners  |   .5439863   .0300269    18.12   0.000     .4851347     .602838
  11#Man primary-earner  |   .4511411   .0237709    18.98   0.000     .4045509    .4977312
11#Woman primary-earner  |   .4530163   .0371456    12.20   0.000     .3802122    .5258203
       11#Equal-earners  |   .5371888   .0297006    18.09   0.000     .4789767    .5954009
  12#Man primary-earner  |   .4344648   .0244198    17.79   0.000     .3866028    .4823267
12#Woman primary-earner  |    .441217   .0403873    10.92   0.000     .3620594    .5203746
       12#Equal-earners  |   .5301813   .0297712    17.81   0.000     .4718308    .5885319
  13#Man primary-earner  |   .4177155   .0251889    16.58   0.000     .3683462    .4670847
13#Woman primary-earner  |   .4293609   .0437825     9.81   0.000     .3435487     .515173
       13#Equal-earners  |   .5229688   .0302564    17.28   0.000     .4636673    .5822703
  14#Man primary-earner  |    .400939   .0260517    15.39   0.000     .3498786    .4519994
14#Woman primary-earner  |   .4174637   .0472542     8.83   0.000     .3248472    .5100801
       14#Equal-earners  |   .5155567   .0311562    16.55   0.000     .4544916    .5766217
  15#Man primary-earner  |   .3841824   .0269875    14.24   0.000      .331288    .4370769
15#Woman primary-earner  |    .405542   .0507423     7.99   0.000     .3060888    .5049951
       15#Equal-earners  |   .5079512   .0324539    15.65   0.000     .4443426    .5715597
  16#Man primary-earner  |   .3674938   .0279793    13.13   0.000     .3126553    .4223323
16#Woman primary-earner  |   .3936126      .0542     7.26   0.000     .2873825    .4998427
       16#Equal-earners  |   .5001592   .0341197    14.66   0.000     .4332859    .5670325
  17#Man primary-earner  |   .3509211   .0290127    12.10   0.000     .2940571     .407785
17#Woman primary-earner  |   .3816928   .0575897     6.63   0.000     .2688191    .4945666
       17#Equal-earners  |   .4921883   .0361152    13.63   0.000     .4214039    .5629727
  18#Man primary-earner  |    .334512    .030074    11.12   0.000      .275568     .393456
18#Woman primary-earner  |   .3698002   .0608808     6.07   0.000     .2504762    .4891243
       18#Equal-earners  |   .4840466   .0383986    12.61   0.000     .4087868    .5593064
  19#Man primary-earner  |   .3183133   .0311494    10.22   0.000     .2572616    .3793649
19#Woman primary-earner  |   .3579525    .064048     5.59   0.000     .2324207    .4834843
       19#Equal-earners  |    .475743   .0409279    11.62   0.000     .3955257    .5559603
  20#Man primary-earner  |   .3023699   .0322243     9.38   0.000     .2392115    .3655284
20#Woman primary-earner  |   .3461672   .0670704     5.16   0.000     .2147115    .4776228
       20#Equal-earners  |    .467287   .0436634    10.70   0.000     .3817084    .5528656
  21#Man primary-earner  |   .2867249   .0332833     8.61   0.000     .2214908     .351959
21#Woman primary-earner  |    .334462   .0699304     4.78   0.000      .197401     .471523
       21#Equal-earners  |   .4586886    .046568     9.85   0.000      .367417    .5499601
  22#Man primary-earner  |   .2714184   .0343103     7.91   0.000     .2041715    .3386653
22#Woman primary-earner  |   .3228543   .0726129     4.45   0.000     .1805356    .4651731
       22#Equal-earners  |   .4499583   .0496082     9.07   0.000      .352728    .5471887
  23#Man primary-earner  |   .2564876   .0352886     7.27   0.000     .1873232     .325652
23#Woman primary-earner  |   .3113612   .0751057     4.15   0.000     .1641567    .4585657
       23#Equal-earners  |   .4411073   .0527537     8.36   0.000     .3377119    .5445027
  24#Man primary-earner  |   .2419662   .0362019     6.68   0.000     .1710118    .3129206
24#Woman primary-earner  |   .2999992   .0773985     3.88   0.000     .1483009    .4516975
       24#Equal-earners  |    .432147   .0559768     7.72   0.000     .3224344    .5418596
  25#Man primary-earner  |   .2278841   .0370343     6.15   0.000     .1552981    .3004701
25#Woman primary-earner  |   .2887845    .079483     3.63   0.000     .1330006    .4445685
       25#Equal-earners  |   .4230894   .0592523     7.14   0.000      .306957    .5392218
  26#Man primary-earner  |   .2142673   .0377715     5.67   0.000     .1402365     .288298
26#Woman primary-earner  |   .2777325    .081353     3.41   0.001     .1182837    .4371814
       26#Equal-earners  |   .4139468   .0625569     6.62   0.000     .2913375    .5365561
  27#Man primary-earner  |   .2011375   .0384005     5.24   0.000     .1258739    .2764012
27#Woman primary-earner  |   .2668579   .0830037     3.22   0.001     .1041737    .4295421
       27#Equal-earners  |   .4047318   .0658691     6.14   0.000     .2756306    .5338329
  28#Man primary-earner  |   .1885125   .0389107     4.84   0.000     .1122488    .2647761
28#Woman primary-earner  |   .2561744   .0844322     3.03   0.002     .0906904    .4216585
       28#Equal-earners  |   .3954571   .0691689     5.72   0.000     .2598885    .5310257
  29#Man primary-earner  |   .1764056   .0392938     4.49   0.000     .0993913    .2534199
29#Woman primary-earner  |   .2456951   .0856373     2.87   0.004     .0778492    .4135411
       29#Equal-earners  |   .3861359   .0724374     5.33   0.000     .2441611    .5281106
------------------------------------------------------------------------------------------

. margin  relinc, at(index=(5(2)62)) predict(outcome(3))  /* Pool Some    */

Predictive margins                              Number of obs     =      8,238
Model VCE    : Robust

Expression   : Pr(pool==Keep_Some___Separate), predict(outcome(3))

1._at        : index           =           5

2._at        : index           =           7

3._at        : index           =           9

4._at        : index           =          11

5._at        : index           =          13

6._at        : index           =          15

7._at        : index           =          17

8._at        : index           =          19

9._at        : index           =          21

10._at       : index           =          23

11._at       : index           =          25

12._at       : index           =          27

13._at       : index           =          29

14._at       : index           =          31

15._at       : index           =          33

16._at       : index           =          35

17._at       : index           =          37

18._at       : index           =          39

19._at       : index           =          41

20._at       : index           =          43

21._at       : index           =          45

22._at       : index           =          47

23._at       : index           =          49

24._at       : index           =          51

25._at       : index           =          53

26._at       : index           =          55

27._at       : index           =          57

28._at       : index           =          59

29._at       : index           =          61

------------------------------------------------------------------------------------------
                         |            Delta-method
                         |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------------------+----------------------------------------------------------------
              _at#relinc |
   1#Man primary-earner  |   .1734864   .0267291     6.49   0.000     .1210982    .2258745
 1#Woman primary-earner  |   .1856617   .0282684     6.57   0.000     .1302567    .2410668
        1#Equal-earners  |   .2038608   .0228553     8.92   0.000     .1590653    .2486564
   2#Man primary-earner  |   .1747025   .0240513     7.26   0.000     .1275629    .2218422
 2#Woman primary-earner  |   .1864636   .0251934     7.40   0.000     .1370855    .2358417
        2#Equal-earners  |   .2001937   .0206601     9.69   0.000     .1597007    .2406868
   3#Man primary-earner  |   .1757381   .0216626     8.11   0.000     .1332801     .218196
 3#Woman primary-earner  |   .1871583   .0226278     8.27   0.000     .1428087    .2315079
        3#Equal-earners  |      .1965   .0187152    10.50   0.000     .1598189     .233181
   4#Man primary-earner  |   .1765824   .0197107     8.96   0.000       .13795    .2152147
 4#Woman primary-earner  |   .1877416   .0207758     9.04   0.000     .1470219    .2284613
        4#Equal-earners  |   .1927812   .0170718    11.29   0.000     .1593211    .2262413
   5#Man primary-earner  |   .1772254   .0183777     9.64   0.000     .1412058     .213245
 5#Woman primary-earner  |   .1882095    .019848     9.48   0.000     .1493082    .2271108
        5#Equal-earners  |   .1890392   .0157866    11.97   0.000     .1580981    .2199803
   6#Man primary-earner  |    .177658   .0178426     9.96   0.000      .142687    .2126289
 6#Woman primary-earner  |   .1885584   .0199779     9.44   0.000     .1494025    .2277143
        6#Equal-earners  |    .185276   .0149121    12.42   0.000     .1560489    .2145032
   7#Man primary-earner  |   .1778714   .0182107     9.77   0.000     .1421791    .2135636
 7#Woman primary-earner  |   .1887848   .0211447     8.93   0.000      .147342    .2302276
        7#Equal-earners  |   .1814938   .0144813    12.53   0.000     .1531109    .2098766
   8#Man primary-earner  |   .1778581   .0194581     9.14   0.000      .139721    .2159953
 8#Woman primary-earner  |   .1888855   .0231865     8.15   0.000     .1434409    .2343301
        8#Equal-earners  |   .1776947   .0144924    12.26   0.000     .1492902    .2060993
   9#Man primary-earner  |   .1776118   .0214518     8.28   0.000      .135567    .2196566
 9#Woman primary-earner  |   .1888576   .0258874     7.30   0.000     .1381192    .2395959
        9#Equal-earners  |   .1738813   .0149042    11.67   0.000     .1446697     .203093
  10#Man primary-earner  |   .1771271   .0240192     7.37   0.000     .1300504    .2242039
10#Woman primary-earner  |   .1886986   .0290518     6.50   0.000     .1317581    .2456391
       10#Equal-earners  |   .1700561   .0156472    10.87   0.000     .1393882    .2007241
  11#Man primary-earner  |   .1764003    .027003     6.53   0.000     .1234755    .2293252
11#Woman primary-earner  |   .1884063   .0325303     5.79   0.000     .1246482    .2521644
       11#Equal-earners  |   .1662219    .016642     9.99   0.000     .1336042    .1988395
  12#Man primary-earner  |    .175429   .0302801     5.79   0.000     .1160812    .2347769
12#Woman primary-earner  |    .187979   .0362163     5.19   0.000     .1169963    .2589617
       12#Equal-earners  |   .1623813   .0178139     9.12   0.000     .1274667     .197296
  13#Man primary-earner  |   .1742125   .0337597     5.16   0.000     .1080447    .2403803
13#Woman primary-earner  |   .1874154   .0400356     4.68   0.000      .108947    .2658837
       13#Equal-earners  |   .1585375   .0191008     8.30   0.000     .1211007    .1959744
  14#Man primary-earner  |   .1727516   .0373749     4.62   0.000     .0994981     .246005
14#Woman primary-earner  |   .1867145   .0439354     4.25   0.000     .1006028    .2728263
       14#Equal-earners  |   .1546935   .0204539     7.56   0.000     .1146047    .1947824
  15#Man primary-earner  |   .1710488   .0410751     4.16   0.000     .0905432    .2515545
15#Woman primary-earner  |    .185876   .0478774     3.88   0.000     .0920381    .2797139
       15#Equal-earners  |   .1508524   .0218362     6.91   0.000     .1080543    .1936505
  16#Man primary-earner  |   .1691086   .0448204     3.77   0.000     .0812621     .256955
16#Woman primary-earner  |   .1848999   .0518329     3.57   0.000     .0833093    .2864906
       16#Equal-earners  |   .1470175   .0232201     6.33   0.000     .1015069    .1925281
  17#Man primary-earner  |   .1669367   .0485781     3.44   0.001     .0717253    .2621481
17#Woman primary-earner  |   .1837869   .0557799     3.29   0.001     .0744603    .2931135
       17#Equal-earners  |    .143192    .024585     5.82   0.000     .0950063    .1913778
  18#Man primary-earner  |   .1645409     .05232     3.14   0.002     .0619955    .2670863
18#Woman primary-earner  |   .1825379   .0597005     3.06   0.002     .0655271    .2995486
       18#Equal-earners  |   .1393794   .0259155     5.38   0.000     .0885861    .1901728
  19#Man primary-earner  |   .1619303   .0560211     2.89   0.004      .052131    .2717296
19#Woman primary-earner  |   .1811545     .06358     2.85   0.004     .0565401    .3057689
       19#Equal-earners  |   .1355831   .0271998     4.98   0.000     .0822725    .1888938
  20#Man primary-earner  |   .1591157   .0596584     2.67   0.008     .0421874    .2760439
20#Woman primary-earner  |   .1796388   .0674059     2.67   0.008     .0475257    .3117519
       20#Equal-earners  |   .1318065   .0284292     4.64   0.000     .0760862    .1875268
  21#Man primary-earner  |    .156109   .0632106     2.47   0.014     .0322186    .2799995
21#Woman primary-earner  |   .1779934   .0711673     2.50   0.012      .038508    .3174788
       21#Equal-earners  |    .128053   .0295971     4.33   0.000     .0700439    .1860622
  22#Man primary-earner  |   .1529237   .0666578     2.29   0.022     .0222768    .2835705
22#Woman primary-earner  |   .1762213   .0748546     2.35   0.019      .029509    .3229337
       22#Equal-earners  |   .1243262   .0306982     4.05   0.000     .0641588    .1844935
  23#Man primary-earner  |   .1495739   .0699812     2.14   0.033     .0124133    .2867345
23#Woman primary-earner  |   .1743261    .078459     2.22   0.026     .0205492     .328103
       23#Equal-earners  |   .1206294   .0317288     3.80   0.000      .058442    .1828167
  24#Man primary-earner  |    .146075   .0731631     2.00   0.046     .0026779     .289472
24#Woman primary-earner  |   .1723118   .0819726     2.10   0.036     .0116485     .332975
       24#Equal-earners  |    .116966   .0326861     3.58   0.000     .0529024    .1810296
  25#Man primary-earner  |   .1424428   .0761872     1.87   0.062    -.0068813    .2917669
25#Woman primary-earner  |   .1701826   .0853877     1.99   0.046     .0028258    .3375395
       25#Equal-earners  |   .1133394   .0335681     3.38   0.001     .0475471    .1791317
  26#Man primary-earner  |   .1386938   .0790382     1.75   0.079    -.0162183    .2936058
26#Woman primary-earner  |   .1679436   .0886976     1.89   0.058    -.0059006    .3417877
       26#Equal-earners  |   .1097529   .0343734     3.19   0.001     .0423823    .1771234
  27#Man primary-earner  |   .1348446   .0817025     1.65   0.099    -.0252893    .2949786
27#Woman primary-earner  |   .1655997   .0918958     1.80   0.072    -.0145127    .3457122
       27#Equal-earners  |   .1062096   .0351011     3.03   0.002     .0374126    .1750066
  28#Man primary-earner  |   .1309122   .0841678     1.56   0.120    -.0340536    .2958781
28#Woman primary-earner  |   .1631567   .0949761     1.72   0.086     -.022993    .3493064
       28#Equal-earners  |   .1027127   .0357511     2.87   0.004     .0326418    .1727835
  29#Man primary-earner  |   .1269134   .0864234     1.47   0.142    -.0424735    .2963002
29#Woman primary-earner  |   .1606202   .0979329     1.64   0.101    -.0313248    .3525652
       29#Equal-earners  |    .099265   .0363234     2.73   0.006     .0280726    .1704575
------------------------------------------------------------------------------------------

. margin  relinc, at(index=(5(2)62)) predict(outcome(4))  /* Keep Sep             */

Predictive margins                              Number of obs     =      8,238
Model VCE    : Robust

Expression   : Pr(pool==Keep_All___Separate), predict(outcome(4))

1._at        : index           =           5

2._at        : index           =           7

3._at        : index           =           9

4._at        : index           =          11

5._at        : index           =          13

6._at        : index           =          15

7._at        : index           =          17

8._at        : index           =          19

9._at        : index           =          21

10._at       : index           =          23

11._at       : index           =          25

12._at       : index           =          27

13._at       : index           =          29

14._at       : index           =          31

15._at       : index           =          33

16._at       : index           =          35

17._at       : index           =          37

18._at       : index           =          39

19._at       : index           =          41

20._at       : index           =          43

21._at       : index           =          45

22._at       : index           =          47

23._at       : index           =          49

24._at       : index           =          51

25._at       : index           =          53

26._at       : index           =          55

27._at       : index           =          57

28._at       : index           =          59

29._at       : index           =          61

------------------------------------------------------------------------------------------
                         |            Delta-method
                         |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------------------+----------------------------------------------------------------
              _at#relinc |
   1#Man primary-earner  |   .0891631   .0177796     5.01   0.000     .0543157    .1240105
 1#Woman primary-earner  |   .1088498   .0160653     6.78   0.000     .0773625    .1403372
        1#Equal-earners  |   .0820004    .019819     4.14   0.000     .0431559    .1208448
   2#Man primary-earner  |   .0917724   .0167766     5.47   0.000     .0588908     .124654
 2#Woman primary-earner  |   .1108405   .0154858     7.16   0.000     .0804889    .1411921
        2#Equal-earners  |   .0850896   .0190977     4.46   0.000     .0476587    .1225204
   3#Man primary-earner  |   .0943557   .0158395     5.96   0.000     .0633109    .1254005
 3#Woman primary-earner  |   .1128009   .0149338     7.55   0.000     .0835312    .1420706
        3#Equal-earners  |    .088251   .0184182     4.79   0.000     .0521519    .1243501
   4#Man primary-earner  |   .0969029   .0150271     6.45   0.000     .0674504    .1263555
 4#Woman primary-earner  |   .1147265    .014421     7.96   0.000     .0864618    .1429912
        4#Equal-earners  |    .091483   .0178196     5.13   0.000     .0565572    .1264088
   5#Man primary-earner  |   .0994035   .0144146     6.90   0.000     .0711515    .1276556
 5#Woman primary-earner  |   .1166126   .0139613     8.35   0.000      .089249    .1439763
        5#Equal-earners  |   .0947838     .01735     5.46   0.000     .0607783    .1287892
   6#Man primary-earner  |   .1018466   .0140888     7.23   0.000     .0742331    .1294602
 6#Woman primary-earner  |   .1184547   .0135705     8.73   0.000     .0918571    .1450523
        6#Equal-earners  |   .0981513   .0170655     5.75   0.000     .0647035     .131599
   7#Man primary-earner  |   .1042211   .0141356     7.37   0.000     .0765158    .1319264
 7#Woman primary-earner  |   .1202479    .013266     9.06   0.000     .0942471    .1462488
        7#Equal-earners  |   .1015831   .0170257     5.97   0.000     .0682134    .1349529
   8#Man primary-earner  |   .1065156   .0146202     7.29   0.000     .0778605    .1351707
 8#Woman primary-earner  |   .1219876   .0130663     9.34   0.000     .0963782    .1475971
        8#Equal-earners  |   .1050768   .0172871     6.08   0.000     .0711948    .1389588
   9#Man primary-earner  |   .1087189   .0155706     6.98   0.000      .078201    .1392367
 9#Woman primary-earner  |    .123669   .0129895     9.52   0.000     .0982101     .149128
        9#Equal-earners  |   .1086294   .0178943     6.07   0.000     .0735571    .1437016
  10#Man primary-earner  |   .1108197   .0169753     6.53   0.000     .0775488    .1440906
10#Woman primary-earner  |   .1252875    .013052     9.60   0.000     .0997062    .1508689
       10#Equal-earners  |   .1122377   .0188738     5.95   0.000     .0752458    .1492296
  11#Man primary-earner  |   .1128071   .0187953     6.00   0.000      .075969    .1496451
11#Woman primary-earner  |   .1268384   .0132666     9.56   0.000     .1008365    .1528404
       11#Equal-earners  |   .1158985   .0202316     5.73   0.000     .0762453    .1555516
  12#Man primary-earner  |   .1146703   .0209806     5.47   0.000     .0735491    .1557915
12#Woman primary-earner  |   .1283173   .0136415     9.41   0.000     .1015804    .1550542
       12#Equal-earners  |    .119608   .0219572     5.45   0.000     .0765727    .1626432
  13#Man primary-earner  |   .1163993   .0234818     4.96   0.000     .0703757    .1624228
13#Woman primary-earner  |   .1297198   .0141799     9.15   0.000     .1019278    .1575118
       13#Equal-earners  |   .1233623   .0240298     5.13   0.000     .0762649    .1704598
  14#Man primary-earner  |   .1179844   .0262555     4.49   0.000     .0665244    .1694443
14#Woman primary-earner  |   .1310416   .0148796     8.81   0.000      .101878    .1602052
       14#Equal-earners  |   .1271574   .0264241     4.81   0.000     .0753671    .1789477
  15#Man primary-earner  |   .1194168   .0292652     4.08   0.000      .062058    .1767755
15#Woman primary-earner  |   .1322787   .0157351     8.41   0.000     .1014386    .1631189
       15#Equal-earners  |   .1309888   .0291152     4.50   0.000     .0739241    .1880536
  16#Man primary-earner  |   .1206886   .0324803     3.72   0.000     .0570283    .1843488
16#Woman primary-earner  |   .1334274   .0167377     7.97   0.000     .1006221    .1662326
       16#Equal-earners  |   .1348521   .0320803     4.20   0.000     .0719758    .1977284
  17#Man primary-earner  |   .1217927   .0358749     3.39   0.001     .0514793    .1921062
17#Woman primary-earner  |   .1344839   .0178777     7.52   0.000     .0994443    .1695235
       17#Equal-earners  |   .1387424      .0353     3.93   0.000     .0695558    .2079291
  18#Man primary-earner  |   .1227233   .0394259     3.11   0.002     .0454499    .1999968
18#Woman primary-earner  |   .1354451   .0191448     7.07   0.000     .0979219    .1729683
       18#Equal-earners  |   .1426548   .0387578     3.68   0.000     .0666908    .2186188
  19#Man primary-earner  |   .1234756   .0431127     2.86   0.004     .0389763    .2079749
19#Woman primary-earner  |   .1363079   .0205292     6.64   0.000     .0960714    .1765444
       19#Equal-earners  |   .1465842   .0424405     3.45   0.001     .0634022    .2297661
  20#Man primary-earner  |   .1240458   .0469153     2.64   0.008     .0320934    .2159982
20#Woman primary-earner  |   .1370696   .0220214     6.22   0.000     .0939086    .1802307
       20#Equal-earners  |   .1505252   .0463369     3.25   0.001     .0597065    .2413439
  21#Man primary-earner  |   .1244318   .0508148     2.45   0.014     .0248365     .224027
21#Woman primary-earner  |   .1377279   .0236126     5.83   0.000     .0914482    .1840077
       21#Equal-earners  |   .1544726   .0504378     3.06   0.002     .0556164    .2533288
  22#Man primary-earner  |   .1246323   .0547923     2.27   0.023     .0172415    .2320232
22#Woman primary-earner  |   .1382808   .0252948     5.47   0.000     .0887039    .1878577
       22#Equal-earners  |   .1584208   .0547352     2.89   0.004     .0511418    .2656997
  23#Man primary-earner  |   .1246476   .0588288     2.12   0.034     .0093453    .2399498
23#Woman primary-earner  |   .1387266   .0270605     5.13   0.000      .085689    .1917642
       23#Equal-earners  |   .1623642   .0592224     2.74   0.006     .0462905    .2784379
  24#Man primary-earner  |    .124479   .0629054     1.98   0.048     .0011866    .2477714
24#Woman primary-earner  |   .1390641   .0289027     4.81   0.000     .0824157    .1957124
       24#Equal-earners  |   .1662972   .0638934     2.60   0.009     .0410686    .2915259
  25#Man primary-earner  |   .1241291   .0670033     1.85   0.064    -.0071949    .2554531
25#Woman primary-earner  |   .1392923   .0308148     4.52   0.000     .0788965    .1996882
       25#Equal-earners  |   .1702143   .0687427     2.48   0.013     .0354811    .3049475
  26#Man primary-earner  |   .1236017   .0711031     1.74   0.082    -.0157579    .2629613
26#Woman primary-earner  |    .139411   .0327902     4.25   0.000     .0751434    .2036786
       26#Equal-earners  |   .1741096   .0737653     2.36   0.018     .0295322     .318687
  27#Man primary-earner  |   .1229015   .0751861     1.63   0.102    -.0244605    .2702636
27#Woman primary-earner  |   .1394198   .0348226     4.00   0.000     .0711688    .2076709
       27#Equal-earners  |   .1779776   .0789565     2.25   0.024     .0232256    .3327295
  28#Man primary-earner  |   .1220344   .0792332     1.54   0.124    -.0332599    .2773287
28#Woman primary-earner  |   .1393193   .0369057     3.78   0.000     .0669854    .2116532
       28#Equal-earners  |   .1818126   .0843116     2.16   0.031     .0165649    .3470603
  29#Man primary-earner  |   .1210071   .0832261     1.45   0.146    -.0421131    .2841272
29#Woman primary-earner  |   .1391099   .0390333     3.56   0.000     .0626061    .2156138
       29#Equal-earners  |   .1856092    .089826     2.07   0.039     .0095534     .361665
------------------------------------------------------------------------------------------

. 
. **********************************************************************************************************************
. *Table 4 - Model 6
. **********************************************************************************************************************
. global  ivars "i.marst sex age parent i.employ homemaker ib4.degree hswrk respmom famlife"

. 
. mlogit          pool    c.index##i.marst                i.relinc $ivars                                         , cluster(country) rrr

Iteration 0:   log pseudolikelihood = -10037.195  
Iteration 1:   log pseudolikelihood = -8965.2138  
Iteration 2:   log pseudolikelihood = -8922.1568  
Iteration 3:   log pseudolikelihood = -8921.8576  
Iteration 4:   log pseudolikelihood = -8921.8575  

Multinomial logistic regression                 Number of obs     =      8,238
                                                Wald chi2(16)     =          .
                                                Prob > chi2       =          .
Log pseudolikelihood = -8921.8575               Pseudo R2         =     0.1111

                                        (Std. Err. adjusted for 20 clusters in country)
---------------------------------------------------------------------------------------
                      |               Robust
                 pool |        RRR   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
One___Manager         |
                index |   1.046865   .0122804     3.90   0.000      1.02307    1.071213
                      |
                marst |
               Cohab  |   1.602122   .2979828     2.53   0.011     1.112701    2.306815
                      |
        marst#c.index |
               Cohab  |   .9933516   .0064185    -1.03   0.302      .980851    1.006012
                      |
               relinc |
Woman primary-earner  |   .9182187   .1288967    -0.61   0.543     .6973601    1.209025
       Equal-earners  |   .6399657   .1349614    -2.12   0.034     .4232998    .9675319
                      |
                  sex |   .9489676   .1490971    -0.33   0.739     .6974528    1.291183
                  age |   .9887927   .0048869    -2.28   0.023     .9792607    .9984174
               parent |   .9490599   .1359272    -0.37   0.715     .7167736    1.256624
                      |
               employ |
            Parttime  |   1.294777   .1482932     2.26   0.024      1.03444    1.620632
          Unemployed  |   1.393438   .3871453     1.19   0.232     .8083405    2.402044
             Student  |   1.414833   .2223972     2.21   0.027     1.039693     1.92533
  Not in labor force  |   .8281683   .1101631    -1.42   0.156     .6381043    1.074844
                      |
            homemaker |   1.060155   .1125472     0.55   0.582     .8610034     1.30537
                      |
               degree |
 No formal education  |   1.691524   .3432928     2.59   0.010     1.136391    2.517842
      Primary school  |   1.465311    .262638     2.13   0.033     1.031248    2.082077
     Lower secondary  |   1.032665    .172573     0.19   0.847     .7442373    1.432872
      Post secondary  |   .9693326   .1800074    -0.17   0.867     .6736008      1.3949
Lower level tertiary  |    .754145   .1724246    -1.23   0.217       .48177    1.180511
Upper level tertiary  |   .5300326   .0909212    -3.70   0.000      .378694     .741851
                      |
                hswrk |   .8997333   .0261094    -3.64   0.000     .8499879      .95239
              respmom |    .927918   .0828093    -0.84   0.402     .7790165    1.105281
              famlife |   .8400824   .0742026    -1.97   0.049     .7065406    .9988647
                _cons |   1.401732   .9015633     0.53   0.600     .3973659    4.944691
----------------------+----------------------------------------------------------------
Manage___Together     |  (base outcome)
----------------------+----------------------------------------------------------------
Keep_Some___Separate  |
                index |    1.02294   .0129874     1.79   0.074     .9977989    1.048714
                      |
                marst |
               Cohab  |   7.764549   1.145007    13.90   0.000     5.815579    10.36668
                      |
        marst#c.index |
               Cohab  |   .9417652   .0076747    -7.36   0.000     .9268425     .956928
                      |
               relinc |
Woman primary-earner  |   1.118813   .1241186     1.01   0.312     .9001752    1.390554
       Equal-earners  |   .9714061   .1189472    -0.24   0.813     .7641393    1.234892
                      |
                  sex |   1.044328   .1194782     0.38   0.705     .8345527    1.306833
                  age |   .9841307   .0041942    -3.75   0.000     .9759444    .9923857
               parent |   .9576262   .0893237    -0.46   0.643     .7976258    1.149722
                      |
               employ |
            Parttime  |   .6920154   .1208416    -2.11   0.035      .491447    .9744394
          Unemployed  |   .7670672   .1774827    -1.15   0.252      .487398     1.20721
             Student  |   .6608872   .0881082    -3.11   0.002     .5089169    .8582382
  Not in labor force  |   .8496445   .1194566    -1.16   0.246     .6450029    1.119213
                      |
            homemaker |   .7315989   .0779182    -2.93   0.003     .5937678    .9014245
                      |
               degree |
 No formal education  |   1.642298   .7038331     1.16   0.247     .7090154    3.804065
      Primary school  |   .7984139   .1435289    -1.25   0.210     .5613189    1.135655
     Lower secondary  |   .9560133   .1225046    -0.35   0.726     .7436867     1.22896
      Post secondary  |    .990592   .1638321    -0.06   0.954     .7163351    1.369851
Lower level tertiary  |   1.516316   .1710288     3.69   0.000     1.215572    1.891467
Upper level tertiary  |   2.065395   .2678934     5.59   0.000     1.601761    2.663231
                      |
                hswrk |   .9787056   .0198225    -1.06   0.288     .9406153    1.018338
              respmom |   1.297888   .1607002     2.11   0.035     1.018226     1.65436
              famlife |   .7978756   .0321123    -5.61   0.000     .7373551    .8633635
                _cons |   1.355989   .5939343     0.70   0.487     .5746762    3.199554
----------------------+----------------------------------------------------------------
Keep_All___Separate   |
                index |   1.033976   .0118369     2.92   0.004     1.011034    1.057438
                      |
                marst |
               Cohab  |    8.98522    2.16542     9.11   0.000     5.602617    14.41009
                      |
        marst#c.index |
               Cohab  |    .961778   .0145221    -2.58   0.010     .9337322    .9906663
                      |
               relinc |
Woman primary-earner  |   1.223333   .1769257     1.39   0.163     .9213804    1.624241
       Equal-earners  |    .907347   .1041936    -0.85   0.397     .7244813     1.13637
                      |
                  sex |   1.140785   .1344631     1.12   0.264     .9054691    1.437256
                  age |    .993945   .0072261    -0.84   0.403     .9798825    1.008209
               parent |   .9546473   .1223675    -0.36   0.717     .7425662      1.2273
                      |
               employ |
            Parttime  |   .5153462    .097194    -3.51   0.000     .3560926     .745822
          Unemployed  |   1.294944   .4366597     0.77   0.443     .6686868    2.507721
             Student  |   .7935149    .223684    -0.82   0.412     .4566778    1.378797
  Not in labor force  |   1.192682   .1285788     1.63   0.102     .9655163    1.473295
                      |
            homemaker |   .6926997    .084465    -3.01   0.003     .5454475    .8797049
                      |
               degree |
 No formal education  |   1.622409   .4997534     1.57   0.116     .8870811    2.967272
      Primary school  |   1.126778      .2982     0.45   0.652     .6707634    1.892812
     Lower secondary  |   1.265737   .2513609     1.19   0.235     .8576389    1.868023
      Post secondary  |   1.366975   .2102658     2.03   0.042     1.011184    1.847953
Lower level tertiary  |   1.550858   .2411224     2.82   0.005     1.143484    2.103363
Upper level tertiary  |   1.711226   .4102887     2.24   0.025     1.069598    2.737752
                      |
                hswrk |   1.053582   .0292259     1.88   0.060     .9978294    1.112449
              respmom |   .9263434   .1439809    -0.49   0.623      .683078    1.256243
              famlife |   .6622465   .0181057   -15.07   0.000     .6276941     .698701
                _cons |   1.176009    .662467     0.29   0.773     .3898645     3.54738
---------------------------------------------------------------------------------------
Note: _cons estimates baseline relative risk for each outcome.

. estat           ic

Akaike's information criterion and Bayesian information criterion

-----------------------------------------------------------------------------
       Model |        Obs  ll(null)  ll(model)      df         AIC        BIC
-------------+---------------------------------------------------------------
           . |      8,238  -10037.2  -8921.858      19    17881.72   18015.03
-----------------------------------------------------------------------------
               Note: N=Obs used in calculating BIC; see [R] BIC note.

. 
. 
. // Figure 3
. mlogit          pool    c.index##i.marst                i.relinc $ivars                                         , cluster(country)

Iteration 0:   log pseudolikelihood = -10037.195  
Iteration 1:   log pseudolikelihood = -8965.2138  
Iteration 2:   log pseudolikelihood = -8922.1568  
Iteration 3:   log pseudolikelihood = -8921.8576  
Iteration 4:   log pseudolikelihood = -8921.8575  

Multinomial logistic regression                 Number of obs     =      8,238
                                                Wald chi2(16)     =          .
                                                Prob > chi2       =          .
Log pseudolikelihood = -8921.8575               Pseudo R2         =     0.1111

                                        (Std. Err. adjusted for 20 clusters in country)
---------------------------------------------------------------------------------------
                      |               Robust
                 pool |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
One___Manager         |
                index |   .0458001   .0117307     3.90   0.000     .0228084    .0687917
                      |
                marst |
               Cohab  |   .4713292   .1859926     2.53   0.011     .1067905    .8358679
                      |
        marst#c.index |
               Cohab  |  -.0066706   .0064614    -1.03   0.302    -.0193347    .0059936
                      |
               relinc |
Woman primary-earner  |  -.0853197   .1403769    -0.61   0.543    -.3604534     .189814
       Equal-earners  |  -.4463408   .2108885    -2.12   0.034    -.8596747   -.0330069
                      |
                  sex |  -.0523806   .1571151    -0.33   0.739    -.3603205    .2555592
                  age |  -.0112706   .0049423    -2.28   0.023    -.0209574   -.0015839
               parent |  -.0522834    .143223    -0.37   0.715    -.3329953    .2284285
                      |
               employ |
            Parttime  |   .2583382   .1145318     2.26   0.024     .0338599    .4828165
          Unemployed  |    .331774   .2778346     1.19   0.232    -.2127719    .8763199
             Student  |   .3470113   .1571898     2.21   0.027      .038925    .6550975
  Not in labor force  |  -.1885389   .1330201    -1.42   0.156    -.4492536    .0721758
                      |
            homemaker |    .058415   .1061611     0.55   0.582    -.1496568    .2664869
                      |
               degree |
 No formal education  |   .5256298   .2029488     2.59   0.010     .1278574    .9234021
      Primary school  |   .3820678    .179237     2.13   0.033     .0307698    .7333659
     Lower secondary  |   .0321427   .1671143     0.19   0.847    -.2953953    .3596806
      Post secondary  |  -.0311475   .1857025    -0.17   0.867    -.3951177    .3328226
Lower level tertiary  |  -.2821706   .2286358    -1.23   0.217    -.7302885    .1659474
Upper level tertiary  |  -.6348168   .1715389    -3.70   0.000    -.9710268   -.2986068
                      |
                hswrk |  -.1056569    .029019    -3.64   0.000    -.1625331   -.0487806
              respmom |   -.074812    .089242    -0.84   0.402    -.2497231    .1000992
              famlife |  -.1742552   .0883278    -1.97   0.049    -.3473746   -.0011359
                _cons |   .3377084   .6431782     0.53   0.600    -.9228977    1.598314
----------------------+----------------------------------------------------------------
Manage___Together     |  (base outcome)
----------------------+----------------------------------------------------------------
Keep_Some___Separate  |
                index |   .0226805   .0126961     1.79   0.074    -.0022035    .0475644
                      |
                marst |
               Cohab  |   2.049568    .147466    13.90   0.000      1.76054    2.338597
                      |
        marst#c.index |
               Cohab  |  -.0599993   .0081493    -7.36   0.000    -.0759716   -.0440271
                      |
               relinc |
Woman primary-earner  |   .1122683   .1109378     1.01   0.312    -.1051658    .3297023
       Equal-earners  |  -.0290107   .1224485    -0.24   0.813    -.2690052    .2109839
                      |
                  sex |   .0433738   .1144068     0.38   0.705    -.1808594     .267607
                  age |  -.0159966   .0042619    -3.75   0.000    -.0243497   -.0076435
               parent |  -.0432978   .0932762    -0.46   0.643    -.2261157    .1395202
                      |
               employ |
            Parttime  |  -.3681471   .1746227    -2.11   0.035    -.7104012   -.0258929
          Unemployed  |  -.2651809   .2313783    -1.15   0.252    -.7186741    .1883123
             Student  |  -.4141721    .133318    -3.11   0.002    -.6754706   -.1528736
  Not in labor force  |  -.1629373    .140596    -1.16   0.246    -.4385005    .1126259
                      |
            homemaker |  -.3125229    .106504    -2.93   0.003    -.5212669    -.103779
                      |
               degree |
 No formal education  |   .4960962   .4285661     1.16   0.247     -.343878     1.33607
      Primary school  |  -.2251282   .1797675    -1.25   0.210    -.5774661    .1272097
     Lower secondary  |  -.0449835   .1281411    -0.35   0.726    -.2961355    .2061685
      Post secondary  |  -.0094526    .165388    -0.06   0.954    -.3336072     .314702
Lower level tertiary  |   .4162835   .1127924     3.69   0.000     .1952146    .6373525
Upper level tertiary  |   .7253217   .1297056     5.59   0.000     .4711033      .97954
                      |
                hswrk |  -.0215244   .0202538    -1.06   0.288    -.0612211    .0181723
              respmom |    .260738   .1238167     2.11   0.035     .0180617    .5034143
              famlife |  -.2258026   .0402472    -5.61   0.000    -.3046857   -.1469195
                _cons |   .3045314    .438008     0.70   0.487    -.5539485    1.163011
----------------------+----------------------------------------------------------------
Keep_All___Separate   |
                index |   .0334111    .011448     2.92   0.004     .0109735    .0558487
                      |
                marst |
               Cohab  |   2.195581   .2409979     9.11   0.000     1.723234    2.667928
                      |
        marst#c.index |
               Cohab  |  -.0389716   .0150993    -2.58   0.010    -.0685656   -.0093776
                      |
               relinc |
Woman primary-earner  |   .2015793   .1446259     1.39   0.163    -.0818823    .4850409
       Equal-earners  |  -.0972303   .1148333    -0.85   0.397    -.3222994    .1278387
                      |
                  sex |   .1317167   .1178689     1.12   0.264    -.0993021    .3627356
                  age |  -.0060734   .0072701    -0.84   0.403    -.0203226    .0081758
               parent |  -.0464134   .1281808    -0.36   0.717    -.2976432    .2048165
                      |
               employ |
            Parttime  |  -.6629163   .1885994    -3.51   0.000    -1.032564   -.2932683
          Unemployed  |   .2584674   .3372036     0.77   0.443    -.4024394    .9193743
             Student  |  -.2312829     .28189    -0.82   0.412    -.7837773    .3212114
  Not in labor force  |   .1762045   .1078065     1.63   0.102    -.0350923    .3875013
                      |
            homemaker |  -.3671587   .1219359    -3.01   0.003    -.6061487   -.1281688
                      |
               degree |
 No formal education  |   .4839121   .3080317     1.57   0.116    -.1198189    1.087643
      Primary school  |   .1193624   .2646484     0.45   0.652    -.3993388    .6380637
     Lower secondary  |   .2356543   .1985886     1.19   0.235    -.1535722    .6248808
      Post secondary  |   .3126006   .1538182     2.03   0.042     .0111224    .6140788
Lower level tertiary  |   .4388086   .1554767     2.82   0.005     .1340799    .7435373
Upper level tertiary  |     .53721    .239763     2.24   0.025     .0672831    1.007137
                      |
                hswrk |   .0521957   .0277396     1.88   0.060    -.0021729    .1065643
              respmom |  -.0765103   .1554293    -0.49   0.623    -.3811462    .2281256
              famlife |  -.4121174   .0273398   -15.07   0.000    -.4657024   -.3585324
                _cons |   .1621267   .5633179     0.29   0.773     -.941956    1.266209
---------------------------------------------------------------------------------------

. margin          i.marst, at(index=(5(2)62)) predict(outcome(1))         /* One Manages  */

Predictive margins                              Number of obs     =      8,238
Model VCE    : Robust

Expression   : Pr(pool==One___Manager), predict(outcome(1))

1._at        : index           =           5

2._at        : index           =           7

3._at        : index           =           9

4._at        : index           =          11

5._at        : index           =          13

6._at        : index           =          15

7._at        : index           =          17

8._at        : index           =          19

9._at        : index           =          21

10._at       : index           =          23

11._at       : index           =          25

12._at       : index           =          27

13._at       : index           =          29

14._at       : index           =          31

15._at       : index           =          33

16._at       : index           =          35

17._at       : index           =          37

18._at       : index           =          39

19._at       : index           =          41

20._at       : index           =          43

21._at       : index           =          45

22._at       : index           =          47

23._at       : index           =          49

24._at       : index           =          51

25._at       : index           =          53

26._at       : index           =          55

27._at       : index           =          57

28._at       : index           =          59

29._at       : index           =          61

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   _at#marst |
  1#Married  |   .1361434   .0214626     6.34   0.000     .0940775    .1782093
    1#Cohab  |   .1047215   .0214091     4.89   0.000     .0627605    .1466826
  2#Married  |   .1453912   .0204082     7.12   0.000     .1053918    .1853906
    2#Cohab  |   .1148747   .0206945     5.55   0.000     .0743143    .1554351
  3#Married  |   .1550689   .0193952     8.00   0.000     .1170551    .1930827
    3#Cohab  |   .1257296   .0200015     6.29   0.000     .0865273    .1649319
  4#Married  |    .165174   .0185634     8.90   0.000     .1287904    .2015576
    4#Cohab  |   .1372981   .0194937     7.04   0.000     .0990911    .1755052
  5#Married  |    .175701   .0181039     9.71   0.000      .140218     .211184
    5#Cohab  |   .1495877   .0193918     7.71   0.000     .1115806    .1875949
  6#Married  |    .186642   .0182389    10.23   0.000     .1508944    .2223896
    6#Cohab  |   .1626011   .0199448     8.15   0.000       .12351    .2016921
  7#Married  |   .1979862   .0191672    10.33   0.000     .1604192    .2355532
    7#Cohab  |   .1763359   .0213652     8.25   0.000     .1344609    .2182109
  8#Married  |   .2097201   .0209988     9.99   0.000     .1685631     .250877
    8#Cohab  |   .1907846   .0237618     8.03   0.000     .1442124    .2373569
  9#Married  |   .2218272   .0237329     9.35   0.000     .1753115    .2683429
    9#Cohab  |   .2059342   .0271256     7.59   0.000     .1527691    .2590993
 10#Married  |   .2342886   .0272922     8.58   0.000     .1807969    .2877803
   10#Cohab  |    .221766   .0313699     7.07   0.000     .1602821    .2832499
 11#Married  |   .2470828   .0315732     7.83   0.000     .1852005    .3089651
   11#Cohab  |   .2382558   .0363796     6.55   0.000     .1669532    .3095585
 12#Married  |   .2601858   .0364773     7.13   0.000     .1886915      .33168
   12#Cohab  |    .255374   .0420395     6.07   0.000     .1729781    .3377698
 13#Married  |   .2735713   .0419209     6.53   0.000     .1914078    .3557349
   13#Cohab  |   .2730854   .0482439     5.66   0.000     .1785292    .3676417
 14#Married  |   .2872114    .047835     6.00   0.000     .1934565    .3809663
   14#Cohab  |     .29135   .0548965     5.31   0.000     .1837547    .3989452
 15#Married  |   .3010761   .0541614     5.56   0.000     .1949217    .4072306
   15#Cohab  |   .3101227   .0619079     5.01   0.000     .1887855    .4314599
 16#Married  |   .3151345   .0608493     5.18   0.000     .1958719     .434397
   16#Cohab  |   .3293542   .0691924     4.76   0.000     .1937397    .4649688
 17#Married  |   .3293541   .0678528     4.85   0.000     .1963651    .4623432
   17#Cohab  |   .3489915   .0766669     4.55   0.000     .1987272    .4992558
 18#Married  |   .3437023   .0751287     4.57   0.000     .1964528    .4909518
   18#Cohab  |   .3689778   .0842495     4.38   0.000     .2038519    .5341038
 19#Married  |   .3581456   .0826357     4.33   0.000     .1961826    .5201086
   19#Cohab  |    .389254   .0918596     4.24   0.000     .2092125    .5692955
 20#Married  |   .3726508   .0903339     4.13   0.000     .1955997    .5497019
   20#Cohab  |   .4097585   .0994178     4.12   0.000     .2149031    .6046139
 21#Married  |    .387185   .0981842     3.94   0.000     .1947476    .5796224
   21#Cohab  |   .4304284    .106847     4.03   0.000     .2210122    .6398446
 22#Married  |   .4017158   .1061484     3.78   0.000     .1936687    .6097629
   22#Cohab  |      .4512   .1140723     3.96   0.000     .2276224    .6747776
 23#Married  |   .4162118   .1141896     3.64   0.000     .1924043    .6400194
   23#Cohab  |   .4720092   .1210228     3.90   0.000     .2348088    .7092096
 24#Married  |    .430643   .1222717     3.52   0.000     .1909949     .670291
   24#Cohab  |   .4927927    .127632     3.86   0.000     .2426385    .7429469
 25#Married  |   .4449804     .13036     3.41   0.001     .1894796    .7004813
   25#Cohab  |   .5134883   .1338386     3.84   0.000     .2511693    .7758072
 26#Married  |   .4591971   .1384214     3.32   0.001     .1878962    .7304981
   26#Cohab  |   .5340352   .1395875     3.83   0.000     .2604487    .8076217
 27#Married  |   .4732678   .1464246     3.23   0.001     .1862809    .7602547
   27#Cohab  |   .5543753   .1448303     3.83   0.000     .2705131    .8382375
 28#Married  |   .4871692     .15434     3.16   0.002     .1846683    .7896701
   28#Cohab  |   .5744531    .149526     3.84   0.000     .2813875    .8675186
 29#Married  |     .50088   .1621402     3.09   0.002      .183091     .818669
   29#Cohab  |   .5942162   .1536413     3.87   0.000     .2930849    .8953475
------------------------------------------------------------------------------

. margin          i.marst, at(index=(5(2)62)) predict(outcome(2))         /* Manage Equal */

Predictive margins                              Number of obs     =      8,238
Model VCE    : Robust

Expression   : Pr(pool==Manage___Together), predict(outcome(2))

1._at        : index           =           5

2._at        : index           =           7

3._at        : index           =           9

4._at        : index           =          11

5._at        : index           =          13

6._at        : index           =          15

7._at        : index           =          17

8._at        : index           =          19

9._at        : index           =          21

10._at       : index           =          23

11._at       : index           =          25

12._at       : index           =          27

13._at       : index           =          29

14._at       : index           =          31

15._at       : index           =          33

16._at       : index           =          35

17._at       : index           =          37

18._at       : index           =          39

19._at       : index           =          41

20._at       : index           =          43

21._at       : index           =          45

22._at       : index           =          47

23._at       : index           =          49

24._at       : index           =          51

25._at       : index           =          53

26._at       : index           =          55

27._at       : index           =          57

28._at       : index           =          59

29._at       : index           =          61

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   _at#marst |
  1#Married  |   .6517595    .032347    20.15   0.000     .5883606    .7151584
    1#Cohab  |   .3133219   .0287281    10.91   0.000     .2570159    .3696278
  2#Married  |   .6365742    .030547    20.84   0.000     .5767031    .6964452
    2#Cohab  |   .3191653   .0253988    12.57   0.000     .2693845     .368946
  3#Married  |   .6210203   .0288242    21.55   0.000     .5645258    .6775147
    3#Cohab  |    .324449   .0229228    14.15   0.000     .2795212    .3693769
  4#Married  |   .6051211   .0272286    22.22   0.000     .5517539    .6584882
    4#Cohab  |   .3291332   .0215462    15.28   0.000     .2869035    .3713629
  5#Married  |    .588903   .0258186    22.81   0.000     .5382994    .6395065
    5#Cohab  |   .3331812   .0213833    15.58   0.000     .2912708    .3750917
  6#Married  |   .5723954    .024659    23.21   0.000     .5240647    .6207261
    6#Cohab  |   .3365608    .022326    15.07   0.000     .2928026     .380319
  7#Married  |   .5556308   .0238154    23.33   0.000     .5089535     .602308
    7#Cohab  |   .3392442   .0240909    14.08   0.000      .292027    .3864614
  8#Married  |   .5386441   .0233456    23.07   0.000     .4928877    .5844006
    8#Cohab  |   .3412087   .0263531    12.95   0.000     .2895576    .3928598
  9#Married  |    .521473   .0232883    22.39   0.000     .4758288    .5671172
    9#Cohab  |   .3424371   .0288399    11.87   0.000      .285912    .3989622
 10#Married  |   .5041572   .0236542    21.31   0.000     .4577959    .5505185
   10#Cohab  |   .3429177   .0313532    10.94   0.000     .2814666    .4043689
 11#Married  |   .4867382   .0244227    19.93   0.000     .4388705    .5346059
   11#Cohab  |   .3426449   .0337593    10.15   0.000     .2764779     .408812
 12#Married  |   .4692591   .0255474    18.37   0.000      .419187    .5193312
   12#Cohab  |    .341619   .0359719     9.50   0.000     .2711154    .4121226
 13#Married  |    .451764   .0269654    16.75   0.000     .3989127    .5046152
   13#Cohab  |   .3398462    .037939     8.96   0.000     .2654872    .4142052
 14#Married  |   .4342975   .0286077    15.18   0.000     .3782274    .4903677
   14#Cohab  |   .3373389   .0396342     8.51   0.000     .2596573    .4150204
 15#Married  |   .4169046    .030407    13.71   0.000     .3573079    .4765013
   15#Cohab  |    .334115   .0410508     8.14   0.000     .2536569     .414573
 16#Married  |   .3996296   .0323017    12.37   0.000     .3363194    .4629398
   16#Cohab  |    .330198   .0421978     7.83   0.000     .2474918    .4129041
 17#Married  |   .3825164   .0342376    11.17   0.000      .315412    .4496209
   17#Cohab  |   .3256166   .0430971     7.56   0.000     .2411478    .4100854
 18#Married  |   .3656074   .0361681    10.11   0.000     .2947192    .4364956
   18#Cohab  |   .3204042   .0437808     7.32   0.000     .2345954    .4062131
 19#Married  |   .3489435   .0380538     9.17   0.000     .2743594    .4235276
   19#Cohab  |   .3145985   .0442891     7.10   0.000     .2277935    .4014035
 20#Married  |   .3325633   .0398615     8.34   0.000     .2544363    .4106903
   20#Cohab  |   .3082408   .0446673     6.90   0.000     .2206945    .3957871
 21#Married  |   .3165032   .0415635     7.61   0.000     .2350403    .3979662
   21#Cohab  |   .3013757   .0449636     6.70   0.000     .2132486    .3895027
 22#Married  |   .3007969   .0431374     6.97   0.000     .2162492    .3853445
   22#Cohab  |   .2940502   .0452258     6.50   0.000     .2054092    .3826912
 23#Married  |   .2854749   .0445648     6.41   0.000     .1981294    .3728204
   23#Cohab  |   .2863135   .0454983     6.29   0.000     .1971385    .3754886
 24#Married  |   .2705646   .0458319     5.90   0.000     .1807357    .3603934
   24#Cohab  |    .278216    .045819     6.07   0.000     .1884125    .3680195
 25#Married  |   .2560901    .046928     5.46   0.000     .1641128    .3480674
   25#Cohab  |   .2698086   .0462167     5.84   0.000     .1792255    .3603918
 26#Married  |   .2420721   .0478463     5.06   0.000     .1482951    .3358491
   26#Cohab  |   .2611427   .0467098     5.59   0.000     .1695932    .3526923
 27#Married  |   .2285277   .0485826     4.70   0.000     .1333076    .3237478
   27#Cohab  |   .2522691   .0473048     5.33   0.000     .1595535    .3449847
 28#Married  |   .2154706   .0491357     4.39   0.000     .1191664    .3117749
   28#Cohab  |   .2432375    .047997     5.07   0.000     .1491652    .3373099
 29#Married  |   .2029112   .0495071     4.10   0.000     .1058792    .2999433
   29#Cohab  |   .2340965   .0487721     4.80   0.000      .138505     .329688
------------------------------------------------------------------------------

. margin          i.marst, at(index=(5(2)62)) predict(outcome(3))         /* Pool Some    */

Predictive margins                              Number of obs     =      8,238
Model VCE    : Robust

Expression   : Pr(pool==Keep_Some___Separate), predict(outcome(3))

1._at        : index           =           5

2._at        : index           =           7

3._at        : index           =           9

4._at        : index           =          11

5._at        : index           =          13

6._at        : index           =          15

7._at        : index           =          17

8._at        : index           =          19

9._at        : index           =          21

10._at       : index           =          23

11._at       : index           =          25

12._at       : index           =          27

13._at       : index           =          29

14._at       : index           =          31

15._at       : index           =          33

16._at       : index           =          35

17._at       : index           =          37

18._at       : index           =          39

19._at       : index           =          41

20._at       : index           =          43

21._at       : index           =          45

22._at       : index           =          47

23._at       : index           =          49

24._at       : index           =          51

25._at       : index           =          53

26._at       : index           =          55

27._at       : index           =          57

28._at       : index           =          59

29._at       : index           =          61

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   _at#marst |
  1#Married  |   .1455502   .0224333     6.49   0.000     .1015817    .1895188
    1#Cohab  |   .3670557   .0323199    11.36   0.000     .3037099    .4304015
  2#Married  |   .1486432   .0206616     7.19   0.000     .1081471    .1891392
    2#Cohab  |   .3487431    .028976    12.04   0.000     .2919511    .4055351
  3#Married  |   .1516343    .019064     7.95   0.000     .1142696     .188999
    3#Cohab  |   .3306914   .0259405    12.75   0.000     .2798488    .3815339
  4#Married  |   .1545103   .0177456     8.71   0.000     .1197297     .189291
    4#Cohab  |   .3129463     .02333    13.41   0.000     .2672204    .3586722
  5#Married  |   .1572578   .0168332     9.34   0.000     .1242654    .1902502
    5#Cohab  |   .2955517   .0212709    13.89   0.000     .2538614    .3372419
  6#Married  |   .1598636   .0164557     9.71   0.000      .127611    .1921163
    6#Cohab  |   .2785492   .0198775    14.01   0.000       .23959    .3175083
  7#Married  |    .162315    .016708     9.71   0.000     .1295679     .195062
    7#Cohab  |   .2619776   .0192121    13.64   0.000     .2243226    .2996327
  8#Married  |   .1645994   .0176158     9.34   0.000     .1300732    .1991257
    8#Cohab  |   .2458729   .0192495    12.77   0.000     .2081446    .2836011
  9#Married  |   .1667054   .0191317     8.71   0.000      .129208    .2042027
    9#Cohab  |   .2302673   .0198748    11.59   0.000     .1913134    .2692213
 10#Married  |   .1686218   .0211637     7.97   0.000     .1271418    .2101018
   10#Cohab  |   .2151899   .0209227    10.28   0.000     .1741821    .2561977
 11#Married  |   .1703386   .0236099     7.21   0.000     .1240641    .2166131
   11#Cohab  |   .2006656   .0222242     9.03   0.000     .1571068    .2442243
 12#Married  |   .1718468   .0263797     6.51   0.000     .1201435    .2235501
   12#Cohab  |   .1867154    .023636     7.90   0.000     .1403897    .2330411
 13#Married  |   .1731385   .0294004     5.89   0.000     .1155148    .2307622
   13#Cohab  |   .1733564   .0250482     6.92   0.000     .1242628    .2224499
 14#Married  |    .174207   .0326155     5.34   0.000     .1102818    .2381323
   14#Cohab  |   .1606013   .0263816     6.09   0.000     .1088944    .2123082
 15#Married  |    .175047   .0359815     4.86   0.000     .1045245    .2455695
   15#Cohab  |    .148459   .0275811     5.38   0.000     .0944011    .2025168
 16#Married  |   .1756545   .0394641     4.45   0.000     .0983063    .2530027
   16#Cohab  |   .1369341     .02861     4.79   0.000     .0808596    .1930087
 17#Married  |   .1760269   .0430354     4.09   0.000     .0916791    .2603748
   17#Cohab  |   .1260277   .0294454     4.28   0.000     .0683157    .1837396
 18#Married  |   .1761633   .0466722     3.77   0.000     .0846875    .2676391
   18#Cohab  |   .1157367   .0300748     3.85   0.000     .0567912    .1746822
 19#Married  |   .1760639   .0503542     3.50   0.000     .0773714    .2747564
   19#Cohab  |   .1060549   .0304935     3.48   0.001     .0462887    .1658211
 20#Married  |   .1757306   .0540634     3.25   0.001     .0697683    .2816929
   20#Cohab  |   .0969726   .0307032     3.16   0.002     .0367955    .1571498
 21#Married  |   .1751666   .0577832     3.03   0.002     .0619137    .2884195
   21#Cohab  |   .0884774   .0307101     2.88   0.004     .0282866    .1486681
 22#Married  |   .1743765    .061498     2.84   0.005     .0538427    .2949104
   22#Cohab  |   .0805539   .0305244     2.64   0.008     .0207272    .1403806
 23#Married  |   .1733661   .0651932     2.66   0.008     .0455898    .3011425
   23#Cohab  |   .0731848   .0301589     2.43   0.015     .0140743    .1322952
 24#Married  |   .1721425   .0688548     2.50   0.012     .0371895    .3070955
   24#Cohab  |   .0663504   .0296288     2.24   0.025     .0082789    .1244218
 25#Married  |   .1707136   .0724693     2.36   0.018     .0286763    .3127509
   25#Cohab  |   .0600295   .0289506     2.07   0.038     .0032873    .1167716
 26#Married  |   .1690885   .0760238     2.22   0.026     .0200846    .3180925
   26#Cohab  |   .0541995   .0281418     1.93   0.054    -.0009573    .1093564
 27#Married  |   .1672772   .0795058     2.10   0.035     .0114486    .3231057
   27#Cohab  |    .048837   .0272203     1.79   0.073    -.0045138    .1021878
 28#Married  |   .1652901   .0829036     1.99   0.046     .0028021    .3277781
   28#Cohab  |   .0439175   .0262043     1.68   0.094    -.0074419    .0952769
 29#Married  |   .1631384   .0862057     1.89   0.058    -.0058217    .3320986
   29#Cohab  |   .0394163   .0251114     1.57   0.116    -.0098011    .0886338
------------------------------------------------------------------------------

. margin          i.marst, at(index=(5(2)62)) predict(outcome(4))         /* Keep Sep             */

Predictive margins                              Number of obs     =      8,238
Model VCE    : Robust

Expression   : Pr(pool==Keep_All___Separate), predict(outcome(4))

1._at        : index           =           5

2._at        : index           =           7

3._at        : index           =           9

4._at        : index           =          11

5._at        : index           =          13

6._at        : index           =          15

7._at        : index           =          17

8._at        : index           =          19

9._at        : index           =          21

10._at       : index           =          23

11._at       : index           =          25

12._at       : index           =          27

13._at       : index           =          29

14._at       : index           =          31

15._at       : index           =          33

16._at       : index           =          35

17._at       : index           =          37

18._at       : index           =          39

19._at       : index           =          41

20._at       : index           =          43

21._at       : index           =          45

22._at       : index           =          47

23._at       : index           =          49

24._at       : index           =          51

25._at       : index           =          53

26._at       : index           =          55

27._at       : index           =          57

28._at       : index           =          59

29._at       : index           =          61

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   _at#marst |
  1#Married  |   .0665469   .0145113     4.59   0.000     .0381052    .0949886
    1#Cohab  |   .2149009   .0328358     6.54   0.000     .1505439    .2792578
  2#Married  |   .0693915   .0141169     4.92   0.000     .0417229    .0970601
    2#Cohab  |    .217217   .0293379     7.40   0.000     .1597157    .2747182
  3#Married  |   .0722764   .0137196     5.27   0.000     .0453865    .0991664
    3#Cohab  |     .21913   .0262239     8.36   0.000     .1677321    .2705279
  4#Married  |   .0751946   .0133395     5.64   0.000     .0490497    .1013395
    4#Cohab  |   .2206224   .0238312     9.26   0.000     .1739141    .2673307
  5#Married  |   .0781382   .0130022     6.01   0.000     .0526544     .103622
    5#Cohab  |   .2216794   .0225829     9.82   0.000     .1774176    .2659411
  6#Married  |   .0810989   .0127398     6.37   0.000     .0561294    .1060684
    6#Cohab  |   .2222889   .0228469     9.73   0.000     .1775098     .267068
  7#Married  |    .084068   .0125899     6.68   0.000     .0593922    .1087439
    7#Cohab  |   .2224422   .0247236     9.00   0.000     .1739848    .2708997
  8#Married  |   .0870364   .0125939     6.91   0.000     .0623528      .11172
    8#Cohab  |   .2221338   .0280025     7.93   0.000     .1672498    .2770177
  9#Married  |   .0899944   .0127924     7.04   0.000     .0649218     .115067
    9#Cohab  |   .2213614   .0323362     6.85   0.000     .1579835    .2847392
 10#Married  |   .0929324   .0132203     7.03   0.000     .0670211    .1188438
   10#Cohab  |   .2201264   .0374049     5.88   0.000     .1468141    .2934386
 11#Married  |   .0958404    .013902     6.89   0.000      .068593    .1230878
   11#Cohab  |   .2184337   .0429671     5.08   0.000     .1342198    .3026476
 12#Married  |   .0987083   .0148487     6.65   0.000     .0696054    .1278112
   12#Cohab  |   .2162916   .0488491     4.43   0.000     .1205492    .3120341
 13#Married  |   .1015262   .0160595     6.32   0.000     .0700502    .1330022
   13#Cohab  |    .213712   .0549231     3.89   0.000     .1060647    .3213594
 14#Married  |   .1042841   .0175245     5.95   0.000     .0699368    .1386314
   14#Cohab  |   .2107099   .0610903     3.45   0.001      .090975    .3304447
 15#Married  |   .1069723   .0192288     5.56   0.000     .0692846      .14466
   15#Cohab  |   .2073034   .0672697     3.08   0.002     .0754572    .3391496
 16#Married  |   .1095814   .0211557     5.18   0.000     .0681171    .1510457
   16#Cohab  |   .2035136   .0733919     2.77   0.006     .0596681    .3473591
 17#Married  |   .1121025   .0232884     4.81   0.000      .066458     .157747
   17#Cohab  |   .1993642   .0793954     2.51   0.012     .0437522    .3549763
 18#Married  |    .114527   .0256117     4.47   0.000     .0643291    .1647249
   18#Cohab  |   .1948812   .0852244     2.29   0.022     .0278444     .361918
 19#Married  |    .116847   .0281112     4.16   0.000     .0617501     .171944
   19#Cohab  |   .1900926   .0908282     2.09   0.036     .0120727    .3681126
 20#Married  |   .1190553   .0307744     3.87   0.000     .0587386    .1793719
   20#Cohab  |   .1850281   .0961601     1.92   0.054    -.0034422    .3734984
 21#Married  |   .1211451   .0335894     3.61   0.000      .055311    .1869792
   21#Cohab  |   .1797186   .1011779     1.78   0.076    -.0185864    .3780236
 22#Married  |   .1231108   .0365456     3.37   0.001     .0514827    .1947389
   22#Cohab  |   .1741959   .1058435     1.65   0.100    -.0332537    .3816454
 23#Married  |   .1249471   .0396326     3.15   0.002     .0472686    .2026257
   23#Cohab  |   .1684925   .1101236     1.53   0.126    -.0473458    .3843307
 24#Married  |     .12665   .0428405     2.96   0.003     .0426842    .2106158
   24#Cohab  |   .1626409   .1139892     1.43   0.154    -.0607738    .3860556
 25#Married  |   .1282159   .0461594     2.78   0.005     .0377452    .2186866
   25#Cohab  |   .1566736   .1174164     1.33   0.182    -.0734583    .3868056
 26#Married  |   .1296422   .0495796     2.61   0.009     .0324679    .2268166
   26#Cohab  |   .1506225   .1203865     1.25   0.211    -.0853306    .3865756
 27#Married  |   .1309273   .0530915     2.47   0.014     .0268699    .2349847
   27#Cohab  |   .1445186   .1228855     1.18   0.240    -.0963326    .3853698
 28#Married  |   .1320701   .0566851     2.33   0.020     .0209693    .2431709
   28#Cohab  |   .1383919   .1249051     1.11   0.268    -.1064176    .3832014
 29#Married  |   .1330704   .0603507     2.20   0.027     .0147853    .2513555
   29#Cohab  |    .132271   .1264417     1.05   0.296    -.1155503    .3800922
------------------------------------------------------------------------------

. 
. 
. **********************************************************************************************************************
. * Figure data
. **********************************************************************************************************************
. // Figure 2
. global  ivars " sex age parent i.employ homemaker ib4.degree hswrk respmom famlife"

. 
. mlogit  pool    c.index##i.relinc       i.marst         $ivars                                          , cluster(country)

Iteration 0:   log pseudolikelihood = -10037.195  
Iteration 1:   log pseudolikelihood = -9000.9724  
Iteration 2:   log pseudolikelihood = -8960.1204  
Iteration 3:   log pseudolikelihood = -8959.8446  
Iteration 4:   log pseudolikelihood = -8959.8445  

Multinomial logistic regression                 Number of obs     =      8,238
                                                Wald chi2(16)     =          .
                                                Prob > chi2       =          .
Log pseudolikelihood = -8959.8445               Pseudo R2         =     0.1073

                                        (Std. Err. adjusted for 20 clusters in country)
---------------------------------------------------------------------------------------
                      |               Robust
                 pool |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
One___Manager         |
                index |   .0505073   .0114523     4.41   0.000     .0280613    .0729534
                      |
               relinc |
Woman primary-earner  |   .2045389   .1740352     1.18   0.240    -.1365639    .5456417
       Equal-earners  |   .0279261   .2869302     0.10   0.922    -.5344468     .590299
                      |
       relinc#c.index |
Woman primary-earner  |  -.0131571    .009365    -1.40   0.160    -.0315122    .0051979
       Equal-earners  |  -.0234502   .0084328    -2.78   0.005    -.0399783   -.0069222
                      |
                marst |
               Cohab  |   .5076219   .1405607     3.61   0.000      .232128    .7831158
                  sex |  -.0503253   .1580978    -0.32   0.750    -.3601913    .2595408
                  age |  -.0105185   .0048006    -2.19   0.028    -.0199274   -.0011095
               parent |  -.0388589   .1422369    -0.27   0.785     -.317638    .2399203
                      |
               employ |
            Parttime  |   .2690555   .1134279     2.37   0.018     .0467409    .4913702
          Unemployed  |   .3429447   .2752534     1.25   0.213    -.1965421    .8824314
             Student  |   .3438891   .1587861     2.17   0.030     .0326742    .6551041
  Not in labor force  |  -.1965978   .1351015    -1.46   0.146    -.4613918    .0681962
                      |
            homemaker |   .0683423   .1083597     0.63   0.528    -.1440388    .2807235
                      |
               degree |
 No formal education  |   .5117873   .1979782     2.59   0.010     .1237572    .8998174
      Primary school  |   .3718573   .1847489     2.01   0.044     .0097561    .7339585
     Lower secondary  |   .0351127   .1674255     0.21   0.834    -.2930354    .3632607
      Post secondary  |  -.0235738   .1836467    -0.13   0.898    -.3835148    .3363672
Lower level tertiary  |  -.2752225   .2268945    -1.21   0.225    -.7199275    .1694824
Upper level tertiary  |   -.631496   .1702553    -3.71   0.000    -.9651903   -.2978017
                      |
                hswrk |  -.1065317   .0287363    -3.71   0.000    -.1628539   -.0502095
              respmom |  -.0655426   .0890561    -0.74   0.462    -.2400894    .1090042
              famlife |  -.1689472   .0895895    -1.89   0.059    -.3445394     .006645
                _cons |   .0981835    .631499     0.16   0.876    -1.139532    1.335899
----------------------+----------------------------------------------------------------
Manage___Together     |  (base outcome)
----------------------+----------------------------------------------------------------
Keep_Some___Separate  |
                index |   .0163113    .015546     1.05   0.294    -.0141583    .0467809
                      |
               relinc |
Woman primary-earner  |   .1745867   .1628013     1.07   0.284     -.144498    .4936714
       Equal-earners  |   .2969917   .2792908     1.06   0.288    -.2504083    .8443917
                      |
       relinc#c.index |
Woman primary-earner  |  -.0039931   .0088145    -0.45   0.651    -.0212691     .013283
       Equal-earners  |  -.0213826   .0180866    -1.18   0.237    -.0568318    .0140666
                      |
                marst |
               Cohab  |    1.12116   .1693522     6.62   0.000     .7892357    1.453084
                  sex |   .0508227   .1126145     0.45   0.652    -.1698976     .271543
                  age |  -.0163008    .004053    -4.02   0.000    -.0242446   -.0083571
               parent |  -.0742024   .0909382    -0.82   0.415    -.2524379    .1040331
                      |
               employ |
            Parttime  |  -.3728841   .1639565    -2.27   0.023    -.6942329   -.0515352
          Unemployed  |  -.2434212   .2338848    -1.04   0.298     -.701827    .2149845
             Student  |  -.4251075   .1258066    -3.38   0.001    -.6716839    -.178531
  Not in labor force  |  -.1641493   .1336281    -1.23   0.219    -.4260556    .0977569
                      |
            homemaker |  -.3250324   .1077907    -3.02   0.003    -.5362982   -.1137666
                      |
               degree |
 No formal education  |    .446326   .3934138     1.13   0.257    -.3247509    1.217403
      Primary school  |  -.2791767   .1531071    -1.82   0.068    -.5792611    .0209077
     Lower secondary  |   -.026958   .1343594    -0.20   0.841    -.2902976    .2363815
      Post secondary  |   .0039522   .1589493     0.02   0.980    -.3075826    .3154871
Lower level tertiary  |   .4195587   .1052557     3.99   0.000     .2132613    .6258561
Upper level tertiary  |    .711437   .1250119     5.69   0.000     .4664181    .9564559
                      |
                hswrk |  -.0169707   .0204117    -0.83   0.406     -.056977    .0230356
              respmom |   .2674187   .1253045     2.13   0.033     .0218263     .513011
              famlife |  -.2303924   .0404245    -5.70   0.000    -.3096229   -.1511619
                _cons |   .4789499   .3997528     1.20   0.231    -.3045511    1.262451
----------------------+----------------------------------------------------------------
Keep_All___Separate   |
                index |   .0280654    .015918     1.76   0.078    -.0031334    .0592642
                      |
               relinc |
Woman primary-earner  |   .3346802   .2322472     1.44   0.150    -.1205159    .7898762
       Equal-earners  |  -.0318282   .1869756    -0.17   0.865    -.3982936    .3346372
                      |
       relinc#c.index |
Woman primary-earner  |  -.0082531   .0095958    -0.86   0.390    -.0270605    .0105543
       Equal-earners  |  -.0049787   .0094982    -0.52   0.600    -.0235948    .0136374
                      |
                marst |
               Cohab  |    1.50301   .1904241     7.89   0.000     1.129785    1.876234
                  sex |   .1381688   .1152607     1.20   0.231    -.0877381    .3640757
                  age |  -.0064227   .0074562    -0.86   0.389    -.0210366    .0081912
               parent |  -.0766608   .1289006    -0.59   0.552    -.3293013    .1759797
                      |
               employ |
            Parttime  |  -.6688077   .1900023    -3.52   0.000    -1.041205     -.29641
          Unemployed  |    .274757   .3340096     0.82   0.411    -.3798898    .9294037
             Student  |  -.2494582   .2636594    -0.95   0.344     -.766221    .2673047
  Not in labor force  |   .1812273   .1100949     1.65   0.100    -.0345548    .3970094
                      |
            homemaker |  -.3787996   .1224414    -3.09   0.002    -.6187803    -.138819
                      |
               degree |
 No formal education  |   .4636922   .2998602     1.55   0.122     -.124023    1.051407
      Primary school  |   .0831397   .2478074     0.34   0.737    -.4025539    .5688334
     Lower secondary  |   .2488272   .1942791     1.28   0.200    -.1319529    .6296074
      Post secondary  |   .3113055   .1470645     2.12   0.034     .0230644    .5995466
Lower level tertiary  |   .4315247   .1393806     3.10   0.002     .1583438    .7047057
Upper level tertiary  |   .5092037   .2245089     2.27   0.023     .0691742    .9492331
                      |
                hswrk |   .0560451   .0266033     2.11   0.035     .0039037    .1081866
              respmom |  -.0675723   .1560284    -0.43   0.665    -.3733822    .2382377
              famlife |  -.4175666    .027913   -14.96   0.000     -.472275   -.3628581
                _cons |   .3478321   .5521007     0.63   0.529    -.7342653     1.42993
---------------------------------------------------------------------------------------

. margin          relinc, at(index=(5(2)62)) predict(outcome(1)) post             /* One Manages  */

Predictive margins                              Number of obs     =      8,238
Model VCE    : Robust

Expression   : Pr(pool==One___Manager), predict(outcome(1))

1._at        : index           =           5

2._at        : index           =           7

3._at        : index           =           9

4._at        : index           =          11

5._at        : index           =          13

6._at        : index           =          15

7._at        : index           =          17

8._at        : index           =          19

9._at        : index           =          21

10._at       : index           =          23

11._at       : index           =          25

12._at       : index           =          27

13._at       : index           =          29

14._at       : index           =          31

15._at       : index           =          33

16._at       : index           =          35

17._at       : index           =          37

18._at       : index           =          39

19._at       : index           =          41

20._at       : index           =          43

21._at       : index           =          45

22._at       : index           =          47

23._at       : index           =          49

24._at       : index           =          51

25._at       : index           =          53

26._at       : index           =          55

27._at       : index           =          57

28._at       : index           =          59

29._at       : index           =          61

------------------------------------------------------------------------------------------
                         |            Delta-method
                         |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------------------+----------------------------------------------------------------
              _at#relinc |
   1#Man primary-earner  |   .1317326   .0229671     5.74   0.000     .0867179    .1767474
 1#Woman primary-earner  |   .1405667   .0159498     8.81   0.000     .1093058    .1718277
        1#Equal-earners  |   .1188837   .0306375     3.88   0.000     .0588353     .178932
   2#Man primary-earner  |   .1419173   .0218028     6.51   0.000     .0991845    .1846501
 2#Woman primary-earner  |   .1483007    .015197     9.76   0.000     .1185152    .1780863
        2#Equal-earners  |   .1242625   .0298446     4.16   0.000     .0657681    .1827569
   3#Man primary-earner  |    .152684   .0205952     7.41   0.000     .1123181    .1930499
 3#Woman primary-earner  |   .1563438   .0147437    10.60   0.000     .1274466    .1852409
        3#Equal-earners  |   .1298198   .0290545     4.47   0.000     .0728741    .1867655
   4#Man primary-earner  |   .1640387    .019499     8.41   0.000     .1258213    .2022561
 4#Woman primary-earner  |   .1646971   .0147413    11.17   0.000     .1358047    .1935896
        4#Equal-earners  |   .1355563   .0283054     4.79   0.000     .0800787     .191034
   5#Man primary-earner  |   .1759836   .0187515     9.39   0.000     .1392314    .2127357
 5#Woman primary-earner  |   .1733612    .015324    11.31   0.000     .1433267    .2033957
        5#Equal-earners  |   .1414723   .0276464     5.12   0.000     .0872864    .1956582
   6#Man primary-earner  |    .188517   .0186647    10.10   0.000     .1519349    .2250991
 6#Woman primary-earner  |   .1823351   .0165671    11.01   0.000      .149864    .2148061
        6#Equal-earners  |   .1475675   .0271371     5.44   0.000     .0943797    .2007553
   7#Man primary-earner  |   .2016332   .0195543    10.31   0.000     .1633074    .2399589
 7#Woman primary-earner  |   .1916167   .0184715    10.37   0.000     .1554133    .2278202
        7#Equal-earners  |   .1538413   .0268471     5.73   0.000      .101222    .2064606
   8#Man primary-earner  |   .2153218   .0216184     9.96   0.000     .1729505    .2576931
 8#Woman primary-earner  |   .2012031   .0209841     9.59   0.000      .160075    .2423311
        8#Equal-earners  |   .1602925   .0268515     5.97   0.000     .1076647    .2129204
   9#Man primary-earner  |   .2295682    .024874     9.23   0.000      .180816    .2783204
 9#Woman primary-earner  |   .2110895   .0240319     8.78   0.000     .1639879    .2581912
        9#Equal-earners  |   .1669194   .0272245     6.13   0.000     .1135604    .2202785
  10#Man primary-earner  |   .2443528   .0292098     8.37   0.000     .1871026     .301603
10#Woman primary-earner  |   .2212705   .0275443     8.03   0.000     .1672846    .2752564
       10#Equal-earners  |   .1737198   .0280306     6.20   0.000     .1187809    .2286587
  11#Man primary-earner  |   .2596516   .0344754     7.53   0.000     .1920811     .327222
11#Woman primary-earner  |    .231739   .0314621     7.37   0.000     .1700744    .2934035
       11#Equal-earners  |   .1806909    .029316     6.16   0.000     .1232327    .2381492
  12#Man primary-earner  |   .2754359   .0405321     6.80   0.000     .1959945    .3548773
12#Woman primary-earner  |   .2424866   .0357373     6.79   0.000     .1724429    .3125304
       12#Equal-earners  |   .1878294   .0311044     6.04   0.000      .126866    .2487928
  13#Man primary-earner  |   .2916728   .0472655     6.17   0.000     .1990342    .3843114
13#Woman primary-earner  |    .253504   .0403313     6.29   0.000     .1744562    .3325518
       13#Equal-earners  |   .1951314   .0333973     5.84   0.000     .1296738     .260589
  14#Man primary-earner  |   .3083251   .0545809     5.65   0.000     .2013486    .4153016
14#Woman primary-earner  |   .2647802   .0452116     5.86   0.000     .1761671    .3533934
       14#Equal-earners  |   .2025924   .0361793     5.60   0.000     .1316823    .2735026
  15#Man primary-earner  |   .3253519   .0623964     5.21   0.000     .2030572    .4476466
15#Woman primary-earner  |   .2763033   .0503501     5.49   0.000     .1776189    .3749877
       15#Equal-earners  |   .2102076   .0394239     5.33   0.000     .1329382    .2874769
  16#Man primary-earner  |   .3427091   .0706375     4.85   0.000     .2042622     .481156
16#Woman primary-earner  |   .2880601    .055721     5.17   0.000      .178849    .3972712
       16#Equal-earners  |   .2179712   .0430998     5.06   0.000     .1334972    .3024453
  17#Man primary-earner  |   .3603495   .0792328     4.55   0.000      .205056     .515643
17#Woman primary-earner  |   .3000364   .0612997     4.89   0.000     .1798912    .4201816
       17#Equal-earners  |   .2258773    .047175     4.79   0.000      .133416    .3183386
  18#Man primary-earner  |   .3782238   .0881127     4.29   0.000     .2055261    .5509214
18#Woman primary-earner  |   .3122168   .0670625     4.66   0.000     .1807766     .443657
       18#Equal-earners  |   .2339192    .051619     4.53   0.000     .1327478    .3350906
  19#Man primary-earner  |   .3962808   .0972074     4.08   0.000     .2057578    .5868039
19#Woman primary-earner  |   .3245852   .0729858     4.45   0.000     .1815355    .4676348
       19#Equal-earners  |   .2420897   .0564038     4.29   0.000     .1315403    .3526391
  20#Man primary-earner  |   .4144686   .1064477     3.89   0.000      .205835    .6231021
20#Woman primary-earner  |   .3371244   .0790459     4.26   0.000     .1821973    .4920515
       20#Equal-earners  |   .2503813   .0615042     4.07   0.000     .1298354    .3709272
  21#Man primary-earner  |   .4327343   .1157641     3.74   0.000     .2058408    .6596279
21#Woman primary-earner  |   .3498167   .0852187     4.10   0.000      .182791    .5168423
       21#Equal-earners  |   .2587858   .0668973     3.87   0.000     .1276694    .3899022
  22#Man primary-earner  |   .4510257   .1250884     3.61   0.000     .2058568    .6961945
22#Woman primary-earner  |   .3626436   .0914803     3.96   0.000     .1833455    .5419416
       22#Equal-earners  |   .2672948   .0725627     3.68   0.000     .1250744    .4095151
  23#Man primary-earner  |   .4692909   .1343535     3.49   0.000     .2059629     .732619
23#Woman primary-earner  |   .3755861   .0978061     3.84   0.000     .1838897    .5672825
       23#Equal-earners  |   .2758992   .0784815     3.52   0.000     .1220783      .42972
  24#Man primary-earner  |   .4874799   .1434945     3.40   0.001     .2062358    .7687239
24#Woman primary-earner  |   .3886249   .1041718     3.73   0.000      .184452    .5927979
       24#Equal-earners  |   .2845898   .0846359     3.36   0.001     .1187064    .4504732
  25#Man primary-earner  |    .505544   .1524494     3.32   0.001     .2067486    .8043394
25#Woman primary-earner  |   .4017405   .1105529     3.63   0.000     .1850608    .6184201
       25#Equal-earners  |   .2933569   .0910097     3.22   0.001     .1149812    .4717326
  26#Man primary-earner  |   .5234373   .1611599     3.25   0.001     .2075697    .8393049
26#Woman primary-earner  |   .4149129   .1169251     3.55   0.000      .185744    .6440819
       26#Equal-earners  |   .3021908   .0975869     3.10   0.002     .1109238    .4934577
  27#Man primary-earner  |   .5411163   .1695718     3.19   0.001     .2087617     .873471
27#Woman primary-earner  |   .4281225   .1232645     3.47   0.001     .1865286    .6697165
       27#Equal-earners  |   .3110811   .1043526     2.98   0.003     .1065537    .5156085
  28#Man primary-earner  |   .5585409   .1776358     3.14   0.002      .210381    .9067007
28#Woman primary-earner  |   .4413496   .1295475     3.41   0.001     .1874411    .6952581
       28#Equal-earners  |   .3200176   .1112922     2.88   0.004      .101889    .5381463
  29#Man primary-earner  |    .575674   .1853078     3.11   0.002     .2124774    .9388706
29#Woman primary-earner  |   .4545747   .1357514     3.35   0.001     .1885069    .7206425
       29#Equal-earners  |   .3289899   .1183912     2.78   0.005     .0969474    .5610325
------------------------------------------------------------------------------------------

. est store       oneman

. 
. mlogit          pool    c.index##i.relinc       i.marst         $ivars                                  , cluster(country)

Iteration 0:   log pseudolikelihood = -10037.195  
Iteration 1:   log pseudolikelihood = -9000.9724  
Iteration 2:   log pseudolikelihood = -8960.1204  
Iteration 3:   log pseudolikelihood = -8959.8446  
Iteration 4:   log pseudolikelihood = -8959.8445  

Multinomial logistic regression                 Number of obs     =      8,238
                                                Wald chi2(16)     =          .
                                                Prob > chi2       =          .
Log pseudolikelihood = -8959.8445               Pseudo R2         =     0.1073

                                        (Std. Err. adjusted for 20 clusters in country)
---------------------------------------------------------------------------------------
                      |               Robust
                 pool |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
One___Manager         |
                index |   .0505073   .0114523     4.41   0.000     .0280613    .0729534
                      |
               relinc |
Woman primary-earner  |   .2045389   .1740352     1.18   0.240    -.1365639    .5456417
       Equal-earners  |   .0279261   .2869302     0.10   0.922    -.5344468     .590299
                      |
       relinc#c.index |
Woman primary-earner  |  -.0131571    .009365    -1.40   0.160    -.0315122    .0051979
       Equal-earners  |  -.0234502   .0084328    -2.78   0.005    -.0399783   -.0069222
                      |
                marst |
               Cohab  |   .5076219   .1405607     3.61   0.000      .232128    .7831158
                  sex |  -.0503253   .1580978    -0.32   0.750    -.3601913    .2595408
                  age |  -.0105185   .0048006    -2.19   0.028    -.0199274   -.0011095
               parent |  -.0388589   .1422369    -0.27   0.785     -.317638    .2399203
                      |
               employ |
            Parttime  |   .2690555   .1134279     2.37   0.018     .0467409    .4913702
          Unemployed  |   .3429447   .2752534     1.25   0.213    -.1965421    .8824314
             Student  |   .3438891   .1587861     2.17   0.030     .0326742    .6551041
  Not in labor force  |  -.1965978   .1351015    -1.46   0.146    -.4613918    .0681962
                      |
            homemaker |   .0683423   .1083597     0.63   0.528    -.1440388    .2807235
                      |
               degree |
 No formal education  |   .5117873   .1979782     2.59   0.010     .1237572    .8998174
      Primary school  |   .3718573   .1847489     2.01   0.044     .0097561    .7339585
     Lower secondary  |   .0351127   .1674255     0.21   0.834    -.2930354    .3632607
      Post secondary  |  -.0235738   .1836467    -0.13   0.898    -.3835148    .3363672
Lower level tertiary  |  -.2752225   .2268945    -1.21   0.225    -.7199275    .1694824
Upper level tertiary  |   -.631496   .1702553    -3.71   0.000    -.9651903   -.2978017
                      |
                hswrk |  -.1065317   .0287363    -3.71   0.000    -.1628539   -.0502095
              respmom |  -.0655426   .0890561    -0.74   0.462    -.2400894    .1090042
              famlife |  -.1689472   .0895895    -1.89   0.059    -.3445394     .006645
                _cons |   .0981835    .631499     0.16   0.876    -1.139532    1.335899
----------------------+----------------------------------------------------------------
Manage___Together     |  (base outcome)
----------------------+----------------------------------------------------------------
Keep_Some___Separate  |
                index |   .0163113    .015546     1.05   0.294    -.0141583    .0467809
                      |
               relinc |
Woman primary-earner  |   .1745867   .1628013     1.07   0.284     -.144498    .4936714
       Equal-earners  |   .2969917   .2792908     1.06   0.288    -.2504083    .8443917
                      |
       relinc#c.index |
Woman primary-earner  |  -.0039931   .0088145    -0.45   0.651    -.0212691     .013283
       Equal-earners  |  -.0213826   .0180866    -1.18   0.237    -.0568318    .0140666
                      |
                marst |
               Cohab  |    1.12116   .1693522     6.62   0.000     .7892357    1.453084
                  sex |   .0508227   .1126145     0.45   0.652    -.1698976     .271543
                  age |  -.0163008    .004053    -4.02   0.000    -.0242446   -.0083571
               parent |  -.0742024   .0909382    -0.82   0.415    -.2524379    .1040331
                      |
               employ |
            Parttime  |  -.3728841   .1639565    -2.27   0.023    -.6942329   -.0515352
          Unemployed  |  -.2434212   .2338848    -1.04   0.298     -.701827    .2149845
             Student  |  -.4251075   .1258066    -3.38   0.001    -.6716839    -.178531
  Not in labor force  |  -.1641493   .1336281    -1.23   0.219    -.4260556    .0977569
                      |
            homemaker |  -.3250324   .1077907    -3.02   0.003    -.5362982   -.1137666
                      |
               degree |
 No formal education  |    .446326   .3934138     1.13   0.257    -.3247509    1.217403
      Primary school  |  -.2791767   .1531071    -1.82   0.068    -.5792611    .0209077
     Lower secondary  |   -.026958   .1343594    -0.20   0.841    -.2902976    .2363815
      Post secondary  |   .0039522   .1589493     0.02   0.980    -.3075826    .3154871
Lower level tertiary  |   .4195587   .1052557     3.99   0.000     .2132613    .6258561
Upper level tertiary  |    .711437   .1250119     5.69   0.000     .4664181    .9564559
                      |
                hswrk |  -.0169707   .0204117    -0.83   0.406     -.056977    .0230356
              respmom |   .2674187   .1253045     2.13   0.033     .0218263     .513011
              famlife |  -.2303924   .0404245    -5.70   0.000    -.3096229   -.1511619
                _cons |   .4789499   .3997528     1.20   0.231    -.3045511    1.262451
----------------------+----------------------------------------------------------------
Keep_All___Separate   |
                index |   .0280654    .015918     1.76   0.078    -.0031334    .0592642
                      |
               relinc |
Woman primary-earner  |   .3346802   .2322472     1.44   0.150    -.1205159    .7898762
       Equal-earners  |  -.0318282   .1869756    -0.17   0.865    -.3982936    .3346372
                      |
       relinc#c.index |
Woman primary-earner  |  -.0082531   .0095958    -0.86   0.390    -.0270605    .0105543
       Equal-earners  |  -.0049787   .0094982    -0.52   0.600    -.0235948    .0136374
                      |
                marst |
               Cohab  |    1.50301   .1904241     7.89   0.000     1.129785    1.876234
                  sex |   .1381688   .1152607     1.20   0.231    -.0877381    .3640757
                  age |  -.0064227   .0074562    -0.86   0.389    -.0210366    .0081912
               parent |  -.0766608   .1289006    -0.59   0.552    -.3293013    .1759797
                      |
               employ |
            Parttime  |  -.6688077   .1900023    -3.52   0.000    -1.041205     -.29641
          Unemployed  |    .274757   .3340096     0.82   0.411    -.3798898    .9294037
             Student  |  -.2494582   .2636594    -0.95   0.344     -.766221    .2673047
  Not in labor force  |   .1812273   .1100949     1.65   0.100    -.0345548    .3970094
                      |
            homemaker |  -.3787996   .1224414    -3.09   0.002    -.6187803    -.138819
                      |
               degree |
 No formal education  |   .4636922   .2998602     1.55   0.122     -.124023    1.051407
      Primary school  |   .0831397   .2478074     0.34   0.737    -.4025539    .5688334
     Lower secondary  |   .2488272   .1942791     1.28   0.200    -.1319529    .6296074
      Post secondary  |   .3113055   .1470645     2.12   0.034     .0230644    .5995466
Lower level tertiary  |   .4315247   .1393806     3.10   0.002     .1583438    .7047057
Upper level tertiary  |   .5092037   .2245089     2.27   0.023     .0691742    .9492331
                      |
                hswrk |   .0560451   .0266033     2.11   0.035     .0039037    .1081866
              respmom |  -.0675723   .1560284    -0.43   0.665    -.3733822    .2382377
              famlife |  -.4175666    .027913   -14.96   0.000     -.472275   -.3628581
                _cons |   .3478321   .5521007     0.63   0.529    -.7342653     1.42993
---------------------------------------------------------------------------------------

. margin          relinc, at(index=(5(2)62)) predict(outcome(2))  post            /* Manage Equal */

Predictive margins                              Number of obs     =      8,238
Model VCE    : Robust

Expression   : Pr(pool==Manage___Together), predict(outcome(2))

1._at        : index           =           5

2._at        : index           =           7

3._at        : index           =           9

4._at        : index           =          11

5._at        : index           =          13

6._at        : index           =          15

7._at        : index           =          17

8._at        : index           =          19

9._at        : index           =          21

10._at       : index           =          23

11._at       : index           =          25

12._at       : index           =          27

13._at       : index           =          29

14._at       : index           =          31

15._at       : index           =          33

16._at       : index           =          35

17._at       : index           =          37

18._at       : index           =          39

19._at       : index           =          41

20._at       : index           =          43

21._at       : index           =          45

22._at       : index           =          47

23._at       : index           =          49

24._at       : index           =          51

25._at       : index           =          53

26._at       : index           =          55

27._at       : index           =          57

28._at       : index           =          59

29._at       : index           =          61

------------------------------------------------------------------------------------------
                         |            Delta-method
                         |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------------------+----------------------------------------------------------------
              _at#relinc |
   1#Man primary-earner  |   .6056179   .0315456    19.20   0.000     .5437897    .6674461
 1#Woman primary-earner  |   .5649217   .0372522    15.16   0.000     .4919088    .6379347
        1#Equal-earners  |   .5952551    .044388    13.41   0.000     .5082563     .682254
   2#Man primary-earner  |   .5916078   .0293039    20.19   0.000     .5341733    .6490423
 2#Woman primary-earner  |   .5543951    .034003    16.30   0.000     .4877505    .6210398
        2#Equal-earners  |   .5904542   .0422062    13.99   0.000     .5077316    .6731767
   3#Man primary-earner  |   .5772222   .0273704    21.09   0.000     .5235773    .6308672
 3#Woman primary-earner  |   .5436971   .0312666    17.39   0.000     .4824157    .6049784
        3#Equal-earners  |   .5854292   .0401103    14.60   0.000     .5068144     .664044
   4#Man primary-earner  |    .562476   .0257741    21.82   0.000     .5119597    .6129923
 4#Woman primary-earner  |   .5328348   .0291902    18.25   0.000     .4756231    .5900465
        4#Equal-earners  |   .5801795    .038118    15.22   0.000     .5054695    .6548895
   5#Man primary-earner  |   .5473875   .0245335    22.31   0.000     .4993027    .5954722
 5#Woman primary-earner  |   .5218166   .0279166    18.69   0.000     .4671011    .5765322
        5#Equal-earners  |   .5747047   .0362521    15.85   0.000      .503652    .6457575
   6#Man primary-earner  |   .5319784   .0236525    22.49   0.000     .4856203    .5783365
 6#Woman primary-earner  |   .5106518   .0275444    18.54   0.000     .4566658    .5646378
        6#Equal-earners  |   .5690052   .0345412    16.47   0.000     .5013056    .6367047
   7#Man primary-earner  |   .5162744    .023119    22.33   0.000      .470962    .5615868
 7#Woman primary-earner  |   .4993505   .0280885    17.78   0.000      .444298    .5544031
        7#Equal-earners  |   .5630817   .0330205    17.05   0.000     .4983627    .6278008
   8#Man primary-earner  |   .5003044   .0229051    21.84   0.000     .4554113    .5451976
 8#Woman primary-earner  |   .4879238   .0294708    16.56   0.000     .4301621    .5456856
        8#Equal-earners  |   .5569359    .031731    17.55   0.000     .4947443    .6191275
   9#Man primary-earner  |   .4841012   .0229719    21.07   0.000     .4390771    .5291253
 9#Woman primary-earner  |   .4763838   .0315483    15.10   0.000     .4145503    .5382173
        9#Equal-earners  |   .5505699   .0307178    17.92   0.000     .4903642    .6107755
  10#Man primary-earner  |   .4677004   .0232752    20.09   0.000     .4220819    .5133189
10#Woman primary-earner  |   .4647434   .0341572    13.61   0.000     .3977966    .5316902
       10#Equal-earners  |   .5439863   .0300269    18.12   0.000     .4851347     .602838
  11#Man primary-earner  |   .4511411   .0237709    18.98   0.000     .4045509    .4977312
11#Woman primary-earner  |   .4530163   .0371456    12.20   0.000     .3802122    .5258203
       11#Equal-earners  |   .5371888   .0297006    18.09   0.000     .4789767    .5954009
  12#Man primary-earner  |   .4344648   .0244198    17.79   0.000     .3866028    .4823267
12#Woman primary-earner  |    .441217   .0403873    10.92   0.000     .3620594    .5203746
       12#Equal-earners  |   .5301813   .0297712    17.81   0.000     .4718308    .5885319
  13#Man primary-earner  |   .4177155   .0251889    16.58   0.000     .3683462    .4670847
13#Woman primary-earner  |   .4293609   .0437825     9.81   0.000     .3435487     .515173
       13#Equal-earners  |   .5229688   .0302564    17.28   0.000     .4636673    .5822703
  14#Man primary-earner  |    .400939   .0260517    15.39   0.000     .3498786    .4519994
14#Woman primary-earner  |   .4174637   .0472542     8.83   0.000     .3248472    .5100801
       14#Equal-earners  |   .5155567   .0311562    16.55   0.000     .4544916    .5766217
  15#Man primary-earner  |   .3841824   .0269875    14.24   0.000      .331288    .4370769
15#Woman primary-earner  |    .405542   .0507423     7.99   0.000     .3060888    .5049951
       15#Equal-earners  |   .5079512   .0324539    15.65   0.000     .4443426    .5715597
  16#Man primary-earner  |   .3674938   .0279793    13.13   0.000     .3126553    .4223323
16#Woman primary-earner  |   .3936126      .0542     7.26   0.000     .2873825    .4998427
       16#Equal-earners  |   .5001592   .0341197    14.66   0.000     .4332859    .5670325
  17#Man primary-earner  |   .3509211   .0290127    12.10   0.000     .2940571     .407785
17#Woman primary-earner  |   .3816928   .0575897     6.63   0.000     .2688191    .4945666
       17#Equal-earners  |   .4921883   .0361152    13.63   0.000     .4214039    .5629727
  18#Man primary-earner  |    .334512    .030074    11.12   0.000      .275568     .393456
18#Woman primary-earner  |   .3698002   .0608808     6.07   0.000     .2504762    .4891243
       18#Equal-earners  |   .4840466   .0383986    12.61   0.000     .4087868    .5593064
  19#Man primary-earner  |   .3183133   .0311494    10.22   0.000     .2572616    .3793649
19#Woman primary-earner  |   .3579525    .064048     5.59   0.000     .2324207    .4834843
       19#Equal-earners  |    .475743   .0409279    11.62   0.000     .3955257    .5559603
  20#Man primary-earner  |   .3023699   .0322243     9.38   0.000     .2392115    .3655284
20#Woman primary-earner  |   .3461672   .0670704     5.16   0.000     .2147115    .4776228
       20#Equal-earners  |    .467287   .0436634    10.70   0.000     .3817084    .5528656
  21#Man primary-earner  |   .2867249   .0332833     8.61   0.000     .2214908     .351959
21#Woman primary-earner  |    .334462   .0699304     4.78   0.000      .197401     .471523
       21#Equal-earners  |   .4586886    .046568     9.85   0.000      .367417    .5499601
  22#Man primary-earner  |   .2714184   .0343103     7.91   0.000     .2041715    .3386653
22#Woman primary-earner  |   .3228543   .0726129     4.45   0.000     .1805356    .4651731
       22#Equal-earners  |   .4499583   .0496082     9.07   0.000      .352728    .5471887
  23#Man primary-earner  |   .2564876   .0352886     7.27   0.000     .1873232     .325652
23#Woman primary-earner  |   .3113612   .0751057     4.15   0.000     .1641567    .4585657
       23#Equal-earners  |   .4411073   .0527537     8.36   0.000     .3377119    .5445027
  24#Man primary-earner  |   .2419662   .0362019     6.68   0.000     .1710118    .3129206
24#Woman primary-earner  |   .2999992   .0773985     3.88   0.000     .1483009    .4516975
       24#Equal-earners  |    .432147   .0559768     7.72   0.000     .3224344    .5418596
  25#Man primary-earner  |   .2278841   .0370343     6.15   0.000     .1552981    .3004701
25#Woman primary-earner  |   .2887845    .079483     3.63   0.000     .1330006    .4445685
       25#Equal-earners  |   .4230894   .0592523     7.14   0.000      .306957    .5392218
  26#Man primary-earner  |   .2142673   .0377715     5.67   0.000     .1402365     .288298
26#Woman primary-earner  |   .2777325    .081353     3.41   0.001     .1182837    .4371814
       26#Equal-earners  |   .4139468   .0625569     6.62   0.000     .2913375    .5365561
  27#Man primary-earner  |   .2011375   .0384005     5.24   0.000     .1258739    .2764012
27#Woman primary-earner  |   .2668579   .0830037     3.22   0.001     .1041737    .4295421
       27#Equal-earners  |   .4047318   .0658691     6.14   0.000     .2756306    .5338329
  28#Man primary-earner  |   .1885125   .0389107     4.84   0.000     .1122488    .2647761
28#Woman primary-earner  |   .2561744   .0844322     3.03   0.002     .0906904    .4216585
       28#Equal-earners  |   .3954571   .0691689     5.72   0.000     .2598885    .5310257
  29#Man primary-earner  |   .1764056   .0392938     4.49   0.000     .0993913    .2534199
29#Woman primary-earner  |   .2456951   .0856373     2.87   0.004     .0778492    .4135411
       29#Equal-earners  |   .3861359   .0724374     5.33   0.000     .2441611    .5281106
------------------------------------------------------------------------------------------

. est store       equal

. 
. mlogit          pool    c.index##i.relinc       i.marst         $ivars                                  , cluster(country)

Iteration 0:   log pseudolikelihood = -10037.195  
Iteration 1:   log pseudolikelihood = -9000.9724  
Iteration 2:   log pseudolikelihood = -8960.1204  
Iteration 3:   log pseudolikelihood = -8959.8446  
Iteration 4:   log pseudolikelihood = -8959.8445  

Multinomial logistic regression                 Number of obs     =      8,238
                                                Wald chi2(16)     =          .
                                                Prob > chi2       =          .
Log pseudolikelihood = -8959.8445               Pseudo R2         =     0.1073

                                        (Std. Err. adjusted for 20 clusters in country)
---------------------------------------------------------------------------------------
                      |               Robust
                 pool |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
One___Manager         |
                index |   .0505073   .0114523     4.41   0.000     .0280613    .0729534
                      |
               relinc |
Woman primary-earner  |   .2045389   .1740352     1.18   0.240    -.1365639    .5456417
       Equal-earners  |   .0279261   .2869302     0.10   0.922    -.5344468     .590299
                      |
       relinc#c.index |
Woman primary-earner  |  -.0131571    .009365    -1.40   0.160    -.0315122    .0051979
       Equal-earners  |  -.0234502   .0084328    -2.78   0.005    -.0399783   -.0069222
                      |
                marst |
               Cohab  |   .5076219   .1405607     3.61   0.000      .232128    .7831158
                  sex |  -.0503253   .1580978    -0.32   0.750    -.3601913    .2595408
                  age |  -.0105185   .0048006    -2.19   0.028    -.0199274   -.0011095
               parent |  -.0388589   .1422369    -0.27   0.785     -.317638    .2399203
                      |
               employ |
            Parttime  |   .2690555   .1134279     2.37   0.018     .0467409    .4913702
          Unemployed  |   .3429447   .2752534     1.25   0.213    -.1965421    .8824314
             Student  |   .3438891   .1587861     2.17   0.030     .0326742    .6551041
  Not in labor force  |  -.1965978   .1351015    -1.46   0.146    -.4613918    .0681962
                      |
            homemaker |   .0683423   .1083597     0.63   0.528    -.1440388    .2807235
                      |
               degree |
 No formal education  |   .5117873   .1979782     2.59   0.010     .1237572    .8998174
      Primary school  |   .3718573   .1847489     2.01   0.044     .0097561    .7339585
     Lower secondary  |   .0351127   .1674255     0.21   0.834    -.2930354    .3632607
      Post secondary  |  -.0235738   .1836467    -0.13   0.898    -.3835148    .3363672
Lower level tertiary  |  -.2752225   .2268945    -1.21   0.225    -.7199275    .1694824
Upper level tertiary  |   -.631496   .1702553    -3.71   0.000    -.9651903   -.2978017
                      |
                hswrk |  -.1065317   .0287363    -3.71   0.000    -.1628539   -.0502095
              respmom |  -.0655426   .0890561    -0.74   0.462    -.2400894    .1090042
              famlife |  -.1689472   .0895895    -1.89   0.059    -.3445394     .006645
                _cons |   .0981835    .631499     0.16   0.876    -1.139532    1.335899
----------------------+----------------------------------------------------------------
Manage___Together     |  (base outcome)
----------------------+----------------------------------------------------------------
Keep_Some___Separate  |
                index |   .0163113    .015546     1.05   0.294    -.0141583    .0467809
                      |
               relinc |
Woman primary-earner  |   .1745867   .1628013     1.07   0.284     -.144498    .4936714
       Equal-earners  |   .2969917   .2792908     1.06   0.288    -.2504083    .8443917
                      |
       relinc#c.index |
Woman primary-earner  |  -.0039931   .0088145    -0.45   0.651    -.0212691     .013283
       Equal-earners  |  -.0213826   .0180866    -1.18   0.237    -.0568318    .0140666
                      |
                marst |
               Cohab  |    1.12116   .1693522     6.62   0.000     .7892357    1.453084
                  sex |   .0508227   .1126145     0.45   0.652    -.1698976     .271543
                  age |  -.0163008    .004053    -4.02   0.000    -.0242446   -.0083571
               parent |  -.0742024   .0909382    -0.82   0.415    -.2524379    .1040331
                      |
               employ |
            Parttime  |  -.3728841   .1639565    -2.27   0.023    -.6942329   -.0515352
          Unemployed  |  -.2434212   .2338848    -1.04   0.298     -.701827    .2149845
             Student  |  -.4251075   .1258066    -3.38   0.001    -.6716839    -.178531
  Not in labor force  |  -.1641493   .1336281    -1.23   0.219    -.4260556    .0977569
                      |
            homemaker |  -.3250324   .1077907    -3.02   0.003    -.5362982   -.1137666
                      |
               degree |
 No formal education  |    .446326   .3934138     1.13   0.257    -.3247509    1.217403
      Primary school  |  -.2791767   .1531071    -1.82   0.068    -.5792611    .0209077
     Lower secondary  |   -.026958   .1343594    -0.20   0.841    -.2902976    .2363815
      Post secondary  |   .0039522   .1589493     0.02   0.980    -.3075826    .3154871
Lower level tertiary  |   .4195587   .1052557     3.99   0.000     .2132613    .6258561
Upper level tertiary  |    .711437   .1250119     5.69   0.000     .4664181    .9564559
                      |
                hswrk |  -.0169707   .0204117    -0.83   0.406     -.056977    .0230356
              respmom |   .2674187   .1253045     2.13   0.033     .0218263     .513011
              famlife |  -.2303924   .0404245    -5.70   0.000    -.3096229   -.1511619
                _cons |   .4789499   .3997528     1.20   0.231    -.3045511    1.262451
----------------------+----------------------------------------------------------------
Keep_All___Separate   |
                index |   .0280654    .015918     1.76   0.078    -.0031334    .0592642
                      |
               relinc |
Woman primary-earner  |   .3346802   .2322472     1.44   0.150    -.1205159    .7898762
       Equal-earners  |  -.0318282   .1869756    -0.17   0.865    -.3982936    .3346372
                      |
       relinc#c.index |
Woman primary-earner  |  -.0082531   .0095958    -0.86   0.390    -.0270605    .0105543
       Equal-earners  |  -.0049787   .0094982    -0.52   0.600    -.0235948    .0136374
                      |
                marst |
               Cohab  |    1.50301   .1904241     7.89   0.000     1.129785    1.876234
                  sex |   .1381688   .1152607     1.20   0.231    -.0877381    .3640757
                  age |  -.0064227   .0074562    -0.86   0.389    -.0210366    .0081912
               parent |  -.0766608   .1289006    -0.59   0.552    -.3293013    .1759797
                      |
               employ |
            Parttime  |  -.6688077   .1900023    -3.52   0.000    -1.041205     -.29641
          Unemployed  |    .274757   .3340096     0.82   0.411    -.3798898    .9294037
             Student  |  -.2494582   .2636594    -0.95   0.344     -.766221    .2673047
  Not in labor force  |   .1812273   .1100949     1.65   0.100    -.0345548    .3970094
                      |
            homemaker |  -.3787996   .1224414    -3.09   0.002    -.6187803    -.138819
                      |
               degree |
 No formal education  |   .4636922   .2998602     1.55   0.122     -.124023    1.051407
      Primary school  |   .0831397   .2478074     0.34   0.737    -.4025539    .5688334
     Lower secondary  |   .2488272   .1942791     1.28   0.200    -.1319529    .6296074
      Post secondary  |   .3113055   .1470645     2.12   0.034     .0230644    .5995466
Lower level tertiary  |   .4315247   .1393806     3.10   0.002     .1583438    .7047057
Upper level tertiary  |   .5092037   .2245089     2.27   0.023     .0691742    .9492331
                      |
                hswrk |   .0560451   .0266033     2.11   0.035     .0039037    .1081866
              respmom |  -.0675723   .1560284    -0.43   0.665    -.3733822    .2382377
              famlife |  -.4175666    .027913   -14.96   0.000     -.472275   -.3628581
                _cons |   .3478321   .5521007     0.63   0.529    -.7342653     1.42993
---------------------------------------------------------------------------------------

. margin          relinc, at(index=(5(2)62)) predict(outcome(3))  post            /* Pool Some    */

Predictive margins                              Number of obs     =      8,238
Model VCE    : Robust

Expression   : Pr(pool==Keep_Some___Separate), predict(outcome(3))

1._at        : index           =           5

2._at        : index           =           7

3._at        : index           =           9

4._at        : index           =          11

5._at        : index           =          13

6._at        : index           =          15

7._at        : index           =          17

8._at        : index           =          19

9._at        : index           =          21

10._at       : index           =          23

11._at       : index           =          25

12._at       : index           =          27

13._at       : index           =          29

14._at       : index           =          31

15._at       : index           =          33

16._at       : index           =          35

17._at       : index           =          37

18._at       : index           =          39

19._at       : index           =          41

20._at       : index           =          43

21._at       : index           =          45

22._at       : index           =          47

23._at       : index           =          49

24._at       : index           =          51

25._at       : index           =          53

26._at       : index           =          55

27._at       : index           =          57

28._at       : index           =          59

29._at       : index           =          61

------------------------------------------------------------------------------------------
                         |            Delta-method
                         |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------------------+----------------------------------------------------------------
              _at#relinc |
   1#Man primary-earner  |   .1734864   .0267291     6.49   0.000     .1210982    .2258745
 1#Woman primary-earner  |   .1856617   .0282684     6.57   0.000     .1302567    .2410668
        1#Equal-earners  |   .2038608   .0228553     8.92   0.000     .1590653    .2486564
   2#Man primary-earner  |   .1747025   .0240513     7.26   0.000     .1275629    .2218422
 2#Woman primary-earner  |   .1864636   .0251934     7.40   0.000     .1370855    .2358417
        2#Equal-earners  |   .2001937   .0206601     9.69   0.000     .1597007    .2406868
   3#Man primary-earner  |   .1757381   .0216626     8.11   0.000     .1332801     .218196
 3#Woman primary-earner  |   .1871583   .0226278     8.27   0.000     .1428087    .2315079
        3#Equal-earners  |      .1965   .0187152    10.50   0.000     .1598189     .233181
   4#Man primary-earner  |   .1765824   .0197107     8.96   0.000       .13795    .2152147
 4#Woman primary-earner  |   .1877416   .0207758     9.04   0.000     .1470219    .2284613
        4#Equal-earners  |   .1927812   .0170718    11.29   0.000     .1593211    .2262413
   5#Man primary-earner  |   .1772254   .0183777     9.64   0.000     .1412058     .213245
 5#Woman primary-earner  |   .1882095    .019848     9.48   0.000     .1493082    .2271108
        5#Equal-earners  |   .1890392   .0157866    11.97   0.000     .1580981    .2199803
   6#Man primary-earner  |    .177658   .0178426     9.96   0.000      .142687    .2126289
 6#Woman primary-earner  |   .1885584   .0199779     9.44   0.000     .1494025    .2277143
        6#Equal-earners  |    .185276   .0149121    12.42   0.000     .1560489    .2145032
   7#Man primary-earner  |   .1778714   .0182107     9.77   0.000     .1421791    .2135636
 7#Woman primary-earner  |   .1887848   .0211447     8.93   0.000      .147342    .2302276
        7#Equal-earners  |   .1814938   .0144813    12.53   0.000     .1531109    .2098766
   8#Man primary-earner  |   .1778581   .0194581     9.14   0.000      .139721    .2159953
 8#Woman primary-earner  |   .1888855   .0231865     8.15   0.000     .1434409    .2343301
        8#Equal-earners  |   .1776947   .0144924    12.26   0.000     .1492902    .2060993
   9#Man primary-earner  |   .1776118   .0214518     8.28   0.000      .135567    .2196566
 9#Woman primary-earner  |   .1888576   .0258874     7.30   0.000     .1381192    .2395959
        9#Equal-earners  |   .1738813   .0149042    11.67   0.000     .1446697     .203093
  10#Man primary-earner  |   .1771271   .0240192     7.37   0.000     .1300504    .2242039
10#Woman primary-earner  |   .1886986   .0290518     6.50   0.000     .1317581    .2456391
       10#Equal-earners  |   .1700561   .0156472    10.87   0.000     .1393882    .2007241
  11#Man primary-earner  |   .1764003    .027003     6.53   0.000     .1234755    .2293252
11#Woman primary-earner  |   .1884063   .0325303     5.79   0.000     .1246482    .2521644
       11#Equal-earners  |   .1662219    .016642     9.99   0.000     .1336042    .1988395
  12#Man primary-earner  |    .175429   .0302801     5.79   0.000     .1160812    .2347769
12#Woman primary-earner  |    .187979   .0362163     5.19   0.000     .1169963    .2589617
       12#Equal-earners  |   .1623813   .0178139     9.12   0.000     .1274667     .197296
  13#Man primary-earner  |   .1742125   .0337597     5.16   0.000     .1080447    .2403803
13#Woman primary-earner  |   .1874154   .0400356     4.68   0.000      .108947    .2658837
       13#Equal-earners  |   .1585375   .0191008     8.30   0.000     .1211007    .1959744
  14#Man primary-earner  |   .1727516   .0373749     4.62   0.000     .0994981     .246005
14#Woman primary-earner  |   .1867145   .0439354     4.25   0.000     .1006028    .2728263
       14#Equal-earners  |   .1546935   .0204539     7.56   0.000     .1146047    .1947824
  15#Man primary-earner  |   .1710488   .0410751     4.16   0.000     .0905432    .2515545
15#Woman primary-earner  |    .185876   .0478774     3.88   0.000     .0920381    .2797139
       15#Equal-earners  |   .1508524   .0218362     6.91   0.000     .1080543    .1936505
  16#Man primary-earner  |   .1691086   .0448204     3.77   0.000     .0812621     .256955
16#Woman primary-earner  |   .1848999   .0518329     3.57   0.000     .0833093    .2864906
       16#Equal-earners  |   .1470175   .0232201     6.33   0.000     .1015069    .1925281
  17#Man primary-earner  |   .1669367   .0485781     3.44   0.001     .0717253    .2621481
17#Woman primary-earner  |   .1837869   .0557799     3.29   0.001     .0744603    .2931135
       17#Equal-earners  |    .143192    .024585     5.82   0.000     .0950063    .1913778
  18#Man primary-earner  |   .1645409     .05232     3.14   0.002     .0619955    .2670863
18#Woman primary-earner  |   .1825379   .0597005     3.06   0.002     .0655271    .2995486
       18#Equal-earners  |   .1393794   .0259155     5.38   0.000     .0885861    .1901728
  19#Man primary-earner  |   .1619303   .0560211     2.89   0.004      .052131    .2717296
19#Woman primary-earner  |   .1811545     .06358     2.85   0.004     .0565401    .3057689
       19#Equal-earners  |   .1355831   .0271998     4.98   0.000     .0822725    .1888938
  20#Man primary-earner  |   .1591157   .0596584     2.67   0.008     .0421874    .2760439
20#Woman primary-earner  |   .1796388   .0674059     2.67   0.008     .0475257    .3117519
       20#Equal-earners  |   .1318065   .0284292     4.64   0.000     .0760862    .1875268
  21#Man primary-earner  |    .156109   .0632106     2.47   0.014     .0322186    .2799995
21#Woman primary-earner  |   .1779934   .0711673     2.50   0.012      .038508    .3174788
       21#Equal-earners  |    .128053   .0295971     4.33   0.000     .0700439    .1860622
  22#Man primary-earner  |   .1529237   .0666578     2.29   0.022     .0222768    .2835705
22#Woman primary-earner  |   .1762213   .0748546     2.35   0.019      .029509    .3229337
       22#Equal-earners  |   .1243262   .0306982     4.05   0.000     .0641588    .1844935
  23#Man primary-earner  |   .1495739   .0699812     2.14   0.033     .0124133    .2867345
23#Woman primary-earner  |   .1743261    .078459     2.22   0.026     .0205492     .328103
       23#Equal-earners  |   .1206294   .0317288     3.80   0.000      .058442    .1828167
  24#Man primary-earner  |    .146075   .0731631     2.00   0.046     .0026779     .289472
24#Woman primary-earner  |   .1723118   .0819726     2.10   0.036     .0116485     .332975
       24#Equal-earners  |    .116966   .0326861     3.58   0.000     .0529024    .1810296
  25#Man primary-earner  |   .1424428   .0761872     1.87   0.062    -.0068813    .2917669
25#Woman primary-earner  |   .1701826   .0853877     1.99   0.046     .0028258    .3375395
       25#Equal-earners  |   .1133394   .0335681     3.38   0.001     .0475471    .1791317
  26#Man primary-earner  |   .1386938   .0790382     1.75   0.079    -.0162183    .2936058
26#Woman primary-earner  |   .1679436   .0886976     1.89   0.058    -.0059006    .3417877
       26#Equal-earners  |   .1097529   .0343734     3.19   0.001     .0423823    .1771234
  27#Man primary-earner  |   .1348446   .0817025     1.65   0.099    -.0252893    .2949786
27#Woman primary-earner  |   .1655997   .0918958     1.80   0.072    -.0145127    .3457122
       27#Equal-earners  |   .1062096   .0351011     3.03   0.002     .0374126    .1750066
  28#Man primary-earner  |   .1309122   .0841678     1.56   0.120    -.0340536    .2958781
28#Woman primary-earner  |   .1631567   .0949761     1.72   0.086     -.022993    .3493064
       28#Equal-earners  |   .1027127   .0357511     2.87   0.004     .0326418    .1727835
  29#Man primary-earner  |   .1269134   .0864234     1.47   0.142    -.0424735    .2963002
29#Woman primary-earner  |   .1606202   .0979329     1.64   0.101    -.0313248    .3525652
       29#Equal-earners  |    .099265   .0363234     2.73   0.006     .0280726    .1704575
------------------------------------------------------------------------------------------

. est store       some

. 
. mlogit          pool    c.index##i.relinc       i.marst         $ivars                                  , cluster(country)

Iteration 0:   log pseudolikelihood = -10037.195  
Iteration 1:   log pseudolikelihood = -9000.9724  
Iteration 2:   log pseudolikelihood = -8960.1204  
Iteration 3:   log pseudolikelihood = -8959.8446  
Iteration 4:   log pseudolikelihood = -8959.8445  

Multinomial logistic regression                 Number of obs     =      8,238
                                                Wald chi2(16)     =          .
                                                Prob > chi2       =          .
Log pseudolikelihood = -8959.8445               Pseudo R2         =     0.1073

                                        (Std. Err. adjusted for 20 clusters in country)
---------------------------------------------------------------------------------------
                      |               Robust
                 pool |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
One___Manager         |
                index |   .0505073   .0114523     4.41   0.000     .0280613    .0729534
                      |
               relinc |
Woman primary-earner  |   .2045389   .1740352     1.18   0.240    -.1365639    .5456417
       Equal-earners  |   .0279261   .2869302     0.10   0.922    -.5344468     .590299
                      |
       relinc#c.index |
Woman primary-earner  |  -.0131571    .009365    -1.40   0.160    -.0315122    .0051979
       Equal-earners  |  -.0234502   .0084328    -2.78   0.005    -.0399783   -.0069222
                      |
                marst |
               Cohab  |   .5076219   .1405607     3.61   0.000      .232128    .7831158
                  sex |  -.0503253   .1580978    -0.32   0.750    -.3601913    .2595408
                  age |  -.0105185   .0048006    -2.19   0.028    -.0199274   -.0011095
               parent |  -.0388589   .1422369    -0.27   0.785     -.317638    .2399203
                      |
               employ |
            Parttime  |   .2690555   .1134279     2.37   0.018     .0467409    .4913702
          Unemployed  |   .3429447   .2752534     1.25   0.213    -.1965421    .8824314
             Student  |   .3438891   .1587861     2.17   0.030     .0326742    .6551041
  Not in labor force  |  -.1965978   .1351015    -1.46   0.146    -.4613918    .0681962
                      |
            homemaker |   .0683423   .1083597     0.63   0.528    -.1440388    .2807235
                      |
               degree |
 No formal education  |   .5117873   .1979782     2.59   0.010     .1237572    .8998174
      Primary school  |   .3718573   .1847489     2.01   0.044     .0097561    .7339585
     Lower secondary  |   .0351127   .1674255     0.21   0.834    -.2930354    .3632607
      Post secondary  |  -.0235738   .1836467    -0.13   0.898    -.3835148    .3363672
Lower level tertiary  |  -.2752225   .2268945    -1.21   0.225    -.7199275    .1694824
Upper level tertiary  |   -.631496   .1702553    -3.71   0.000    -.9651903   -.2978017
                      |
                hswrk |  -.1065317   .0287363    -3.71   0.000    -.1628539   -.0502095
              respmom |  -.0655426   .0890561    -0.74   0.462    -.2400894    .1090042
              famlife |  -.1689472   .0895895    -1.89   0.059    -.3445394     .006645
                _cons |   .0981835    .631499     0.16   0.876    -1.139532    1.335899
----------------------+----------------------------------------------------------------
Manage___Together     |  (base outcome)
----------------------+----------------------------------------------------------------
Keep_Some___Separate  |
                index |   .0163113    .015546     1.05   0.294    -.0141583    .0467809
                      |
               relinc |
Woman primary-earner  |   .1745867   .1628013     1.07   0.284     -.144498    .4936714
       Equal-earners  |   .2969917   .2792908     1.06   0.288    -.2504083    .8443917
                      |
       relinc#c.index |
Woman primary-earner  |  -.0039931   .0088145    -0.45   0.651    -.0212691     .013283
       Equal-earners  |  -.0213826   .0180866    -1.18   0.237    -.0568318    .0140666
                      |
                marst |
               Cohab  |    1.12116   .1693522     6.62   0.000     .7892357    1.453084
                  sex |   .0508227   .1126145     0.45   0.652    -.1698976     .271543
                  age |  -.0163008    .004053    -4.02   0.000    -.0242446   -.0083571
               parent |  -.0742024   .0909382    -0.82   0.415    -.2524379    .1040331
                      |
               employ |
            Parttime  |  -.3728841   .1639565    -2.27   0.023    -.6942329   -.0515352
          Unemployed  |  -.2434212   .2338848    -1.04   0.298     -.701827    .2149845
             Student  |  -.4251075   .1258066    -3.38   0.001    -.6716839    -.178531
  Not in labor force  |  -.1641493   .1336281    -1.23   0.219    -.4260556    .0977569
                      |
            homemaker |  -.3250324   .1077907    -3.02   0.003    -.5362982   -.1137666
                      |
               degree |
 No formal education  |    .446326   .3934138     1.13   0.257    -.3247509    1.217403
      Primary school  |  -.2791767   .1531071    -1.82   0.068    -.5792611    .0209077
     Lower secondary  |   -.026958   .1343594    -0.20   0.841    -.2902976    .2363815
      Post secondary  |   .0039522   .1589493     0.02   0.980    -.3075826    .3154871
Lower level tertiary  |   .4195587   .1052557     3.99   0.000     .2132613    .6258561
Upper level tertiary  |    .711437   .1250119     5.69   0.000     .4664181    .9564559
                      |
                hswrk |  -.0169707   .0204117    -0.83   0.406     -.056977    .0230356
              respmom |   .2674187   .1253045     2.13   0.033     .0218263     .513011
              famlife |  -.2303924   .0404245    -5.70   0.000    -.3096229   -.1511619
                _cons |   .4789499   .3997528     1.20   0.231    -.3045511    1.262451
----------------------+----------------------------------------------------------------
Keep_All___Separate   |
                index |   .0280654    .015918     1.76   0.078    -.0031334    .0592642
                      |
               relinc |
Woman primary-earner  |   .3346802   .2322472     1.44   0.150    -.1205159    .7898762
       Equal-earners  |  -.0318282   .1869756    -0.17   0.865    -.3982936    .3346372
                      |
       relinc#c.index |
Woman primary-earner  |  -.0082531   .0095958    -0.86   0.390    -.0270605    .0105543
       Equal-earners  |  -.0049787   .0094982    -0.52   0.600    -.0235948    .0136374
                      |
                marst |
               Cohab  |    1.50301   .1904241     7.89   0.000     1.129785    1.876234
                  sex |   .1381688   .1152607     1.20   0.231    -.0877381    .3640757
                  age |  -.0064227   .0074562    -0.86   0.389    -.0210366    .0081912
               parent |  -.0766608   .1289006    -0.59   0.552    -.3293013    .1759797
                      |
               employ |
            Parttime  |  -.6688077   .1900023    -3.52   0.000    -1.041205     -.29641
          Unemployed  |    .274757   .3340096     0.82   0.411    -.3798898    .9294037
             Student  |  -.2494582   .2636594    -0.95   0.344     -.766221    .2673047
  Not in labor force  |   .1812273   .1100949     1.65   0.100    -.0345548    .3970094
                      |
            homemaker |  -.3787996   .1224414    -3.09   0.002    -.6187803    -.138819
                      |
               degree |
 No formal education  |   .4636922   .2998602     1.55   0.122     -.124023    1.051407
      Primary school  |   .0831397   .2478074     0.34   0.737    -.4025539    .5688334
     Lower secondary  |   .2488272   .1942791     1.28   0.200    -.1319529    .6296074
      Post secondary  |   .3113055   .1470645     2.12   0.034     .0230644    .5995466
Lower level tertiary  |   .4315247   .1393806     3.10   0.002     .1583438    .7047057
Upper level tertiary  |   .5092037   .2245089     2.27   0.023     .0691742    .9492331
                      |
                hswrk |   .0560451   .0266033     2.11   0.035     .0039037    .1081866
              respmom |  -.0675723   .1560284    -0.43   0.665    -.3733822    .2382377
              famlife |  -.4175666    .027913   -14.96   0.000     -.472275   -.3628581
                _cons |   .3478321   .5521007     0.63   0.529    -.7342653     1.42993
---------------------------------------------------------------------------------------

. margin          relinc, at(index=(5(2)62)) predict(outcome(4))  post            /* Keep Sep             */

Predictive margins                              Number of obs     =      8,238
Model VCE    : Robust

Expression   : Pr(pool==Keep_All___Separate), predict(outcome(4))

1._at        : index           =           5

2._at        : index           =           7

3._at        : index           =           9

4._at        : index           =          11

5._at        : index           =          13

6._at        : index           =          15

7._at        : index           =          17

8._at        : index           =          19

9._at        : index           =          21

10._at       : index           =          23

11._at       : index           =          25

12._at       : index           =          27

13._at       : index           =          29

14._at       : index           =          31

15._at       : index           =          33

16._at       : index           =          35

17._at       : index           =          37

18._at       : index           =          39

19._at       : index           =          41

20._at       : index           =          43

21._at       : index           =          45

22._at       : index           =          47

23._at       : index           =          49

24._at       : index           =          51

25._at       : index           =          53

26._at       : index           =          55

27._at       : index           =          57

28._at       : index           =          59

29._at       : index           =          61

------------------------------------------------------------------------------------------
                         |            Delta-method
                         |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------------------+----------------------------------------------------------------
              _at#relinc |
   1#Man primary-earner  |   .0891631   .0177796     5.01   0.000     .0543157    .1240105
 1#Woman primary-earner  |   .1088498   .0160653     6.78   0.000     .0773625    .1403372
        1#Equal-earners  |   .0820004    .019819     4.14   0.000     .0431559    .1208448
   2#Man primary-earner  |   .0917724   .0167766     5.47   0.000     .0588908     .124654
 2#Woman primary-earner  |   .1108405   .0154858     7.16   0.000     .0804889    .1411921
        2#Equal-earners  |   .0850896   .0190977     4.46   0.000     .0476587    .1225204
   3#Man primary-earner  |   .0943557   .0158395     5.96   0.000     .0633109    .1254005
 3#Woman primary-earner  |   .1128009   .0149338     7.55   0.000     .0835312    .1420706
        3#Equal-earners  |    .088251   .0184182     4.79   0.000     .0521519    .1243501
   4#Man primary-earner  |   .0969029   .0150271     6.45   0.000     .0674504    .1263555
 4#Woman primary-earner  |   .1147265    .014421     7.96   0.000     .0864618    .1429912
        4#Equal-earners  |    .091483   .0178196     5.13   0.000     .0565572    .1264088
   5#Man primary-earner  |   .0994035   .0144146     6.90   0.000     .0711515    .1276556
 5#Woman primary-earner  |   .1166126   .0139613     8.35   0.000      .089249    .1439763
        5#Equal-earners  |   .0947838     .01735     5.46   0.000     .0607783    .1287892
   6#Man primary-earner  |   .1018466   .0140888     7.23   0.000     .0742331    .1294602
 6#Woman primary-earner  |   .1184547   .0135705     8.73   0.000     .0918571    .1450523
        6#Equal-earners  |   .0981513   .0170655     5.75   0.000     .0647035     .131599
   7#Man primary-earner  |   .1042211   .0141356     7.37   0.000     .0765158    .1319264
 7#Woman primary-earner  |   .1202479    .013266     9.06   0.000     .0942471    .1462488
        7#Equal-earners  |   .1015831   .0170257     5.97   0.000     .0682134    .1349529
   8#Man primary-earner  |   .1065156   .0146202     7.29   0.000     .0778605    .1351707
 8#Woman primary-earner  |   .1219876   .0130663     9.34   0.000     .0963782    .1475971
        8#Equal-earners  |   .1050768   .0172871     6.08   0.000     .0711948    .1389588
   9#Man primary-earner  |   .1087189   .0155706     6.98   0.000      .078201    .1392367
 9#Woman primary-earner  |    .123669   .0129895     9.52   0.000     .0982101     .149128
        9#Equal-earners  |   .1086294   .0178943     6.07   0.000     .0735571    .1437016
  10#Man primary-earner  |   .1108197   .0169753     6.53   0.000     .0775488    .1440906
10#Woman primary-earner  |   .1252875    .013052     9.60   0.000     .0997062    .1508689
       10#Equal-earners  |   .1122377   .0188738     5.95   0.000     .0752458    .1492296
  11#Man primary-earner  |   .1128071   .0187953     6.00   0.000      .075969    .1496451
11#Woman primary-earner  |   .1268384   .0132666     9.56   0.000     .1008365    .1528404
       11#Equal-earners  |   .1158985   .0202316     5.73   0.000     .0762453    .1555516
  12#Man primary-earner  |   .1146703   .0209806     5.47   0.000     .0735491    .1557915
12#Woman primary-earner  |   .1283173   .0136415     9.41   0.000     .1015804    .1550542
       12#Equal-earners  |    .119608   .0219572     5.45   0.000     .0765727    .1626432
  13#Man primary-earner  |   .1163993   .0234818     4.96   0.000     .0703757    .1624228
13#Woman primary-earner  |   .1297198   .0141799     9.15   0.000     .1019278    .1575118
       13#Equal-earners  |   .1233623   .0240298     5.13   0.000     .0762649    .1704598
  14#Man primary-earner  |   .1179844   .0262555     4.49   0.000     .0665244    .1694443
14#Woman primary-earner  |   .1310416   .0148796     8.81   0.000      .101878    .1602052
       14#Equal-earners  |   .1271574   .0264241     4.81   0.000     .0753671    .1789477
  15#Man primary-earner  |   .1194168   .0292652     4.08   0.000      .062058    .1767755
15#Woman primary-earner  |   .1322787   .0157351     8.41   0.000     .1014386    .1631189
       15#Equal-earners  |   .1309888   .0291152     4.50   0.000     .0739241    .1880536
  16#Man primary-earner  |   .1206886   .0324803     3.72   0.000     .0570283    .1843488
16#Woman primary-earner  |   .1334274   .0167377     7.97   0.000     .1006221    .1662326
       16#Equal-earners  |   .1348521   .0320803     4.20   0.000     .0719758    .1977284
  17#Man primary-earner  |   .1217927   .0358749     3.39   0.001     .0514793    .1921062
17#Woman primary-earner  |   .1344839   .0178777     7.52   0.000     .0994443    .1695235
       17#Equal-earners  |   .1387424      .0353     3.93   0.000     .0695558    .2079291
  18#Man primary-earner  |   .1227233   .0394259     3.11   0.002     .0454499    .1999968
18#Woman primary-earner  |   .1354451   .0191448     7.07   0.000     .0979219    .1729683
       18#Equal-earners  |   .1426548   .0387578     3.68   0.000     .0666908    .2186188
  19#Man primary-earner  |   .1234756   .0431127     2.86   0.004     .0389763    .2079749
19#Woman primary-earner  |   .1363079   .0205292     6.64   0.000     .0960714    .1765444
       19#Equal-earners  |   .1465842   .0424405     3.45   0.001     .0634022    .2297661
  20#Man primary-earner  |   .1240458   .0469153     2.64   0.008     .0320934    .2159982
20#Woman primary-earner  |   .1370696   .0220214     6.22   0.000     .0939086    .1802307
       20#Equal-earners  |   .1505252   .0463369     3.25   0.001     .0597065    .2413439
  21#Man primary-earner  |   .1244318   .0508148     2.45   0.014     .0248365     .224027
21#Woman primary-earner  |   .1377279   .0236126     5.83   0.000     .0914482    .1840077
       21#Equal-earners  |   .1544726   .0504378     3.06   0.002     .0556164    .2533288
  22#Man primary-earner  |   .1246323   .0547923     2.27   0.023     .0172415    .2320232
22#Woman primary-earner  |   .1382808   .0252948     5.47   0.000     .0887039    .1878577
       22#Equal-earners  |   .1584208   .0547352     2.89   0.004     .0511418    .2656997
  23#Man primary-earner  |   .1246476   .0588288     2.12   0.034     .0093453    .2399498
23#Woman primary-earner  |   .1387266   .0270605     5.13   0.000      .085689    .1917642
       23#Equal-earners  |   .1623642   .0592224     2.74   0.006     .0462905    .2784379
  24#Man primary-earner  |    .124479   .0629054     1.98   0.048     .0011866    .2477714
24#Woman primary-earner  |   .1390641   .0289027     4.81   0.000     .0824157    .1957124
       24#Equal-earners  |   .1662972   .0638934     2.60   0.009     .0410686    .2915259
  25#Man primary-earner  |   .1241291   .0670033     1.85   0.064    -.0071949    .2554531
25#Woman primary-earner  |   .1392923   .0308148     4.52   0.000     .0788965    .1996882
       25#Equal-earners  |   .1702143   .0687427     2.48   0.013     .0354811    .3049475
  26#Man primary-earner  |   .1236017   .0711031     1.74   0.082    -.0157579    .2629613
26#Woman primary-earner  |    .139411   .0327902     4.25   0.000     .0751434    .2036786
       26#Equal-earners  |   .1741096   .0737653     2.36   0.018     .0295322     .318687
  27#Man primary-earner  |   .1229015   .0751861     1.63   0.102    -.0244605    .2702636
27#Woman primary-earner  |   .1394198   .0348226     4.00   0.000     .0711688    .2076709
       27#Equal-earners  |   .1779776   .0789565     2.25   0.024     .0232256    .3327295
  28#Man primary-earner  |   .1220344   .0792332     1.54   0.124    -.0332599    .2773287
28#Woman primary-earner  |   .1393193   .0369057     3.78   0.000     .0669854    .2116532
       28#Equal-earners  |   .1818126   .0843116     2.16   0.031     .0165649    .3470603
  29#Man primary-earner  |   .1210071   .0832261     1.45   0.146    -.0421131    .2841272
29#Woman primary-earner  |   .1391099   .0390333     3.56   0.000     .0626061    .2156138
       29#Equal-earners  |   .1856092    .089826     2.07   0.039     .0095534     .361665
------------------------------------------------------------------------------------------

. est store       sep

. 
. est table oneman equal some sep 

------------------------------------------------------------------
    Variable |   oneman       equal         some         sep      
-------------+----------------------------------------------------
  _at#relinc |
          1 #|
Man prima..  |  .13173264     .6056179    .17348635    .08916311  
          1 #|
Woman pri..  |  .14056671    .56492174    .18566172    .10884983  
          1 #|
Equal-ear~s  |  .11888369    .59525511    .20386084    .08200036  
          2 #|
Man prima..  |  .14191729     .5916078    .17470254    .09177237  
          2 #|
Woman pri..  |  .14830072    .55439515    .18646364    .11084049  
          2 #|
Equal-ear~s  |  .12426249    .59045417    .20019375    .08508959  
          3 #|
Man prima..  |  .15268403    .57722224    .17573805    .09435568  
          3 #|
Woman pri..  |  .15634375    .54369705     .1871583    .11280089  
          3 #|
Equal-ear~s  |  .12981981    .58542923    .19649998    .08825098  
          4 #|
Man prima..  |  .16403869    .56247602    .17658236    .09690292  
          4 #|
Woman pri..  |  .16469715    .53283479    .18774158    .11472648  
          4 #|
Equal-ear~s  |  .13555633     .5801795     .1927812    .09148298  
          5 #|
Man prima..  |  .17598357    .54738745    .17722544    .09940353  
          5 #|
Woman pri..  |  .17336119    .52181664    .18820953    .11661264  
          5 #|
Equal-ear~s  |   .1414723    .57470471    .18903923    .09478376  
          6 #|
Man prima..  |  .18851701    .53197841    .17765796    .10184663  
          6 #|
Woman pri..  |  .18233505    .51065182    .18855843    .11845469  
          6 #|
Equal-ear~s  |  .14756754    .56900516    .18527604    .09815126  
          7 #|
Man prima..  |  .20163317    .51627438    .17787138    .10422107  
          7 #|
Woman pri..  |  .19161674    .49935052    .18878482    .12024793  
          7 #|
Equal-ear~s  |  .15384134    .56308173    .18149378    .10158314  
          8 #|
Man prima..  |  .21532183    .50030444    .17785814    .10651559  
          8 #|
Woman pri..  |  .20120305    .48792384    .18888549    .12198761  
          8 #|
Equal-ear~s  |  .16029254    .55693592    .17769473     .1050768  
          9 #|
Man prima..  |  .22956817    .48410116     .1776118    .10871887  
          9 #|
Woman pri..  |  .21108955    .47638383    .18885759    .12366903  
          9 #|
Equal-ear~s  |  .16691945    .55056986    .17388132    .10862937  
         10 #|
Man prima..  |  .24435278     .4677004    .17712714    .11081969  
         10 #|
Woman pri..  |  .22127052    .46474339    .18869858    .12528751  
         10 #|
Equal-ear~s  |  .17371983    .54398633    .17005613    .11223772  
         11 #|
Man prima..  |  .25965156    .45114105    .17640033    .11280706  
         11 #|
Woman pri..  |  .23173898    .45301627    .18840631    .12683844  
         11 #|
Equal-ear~s  |  .18069091    .53718877    .16622186    .11589846  
         12 #|
Man prima..  |  .27543589    .43446476    .17542905     .1146703  
         12 #|
Woman pri..  |  .24248665    .44121701    .18797902    .12831733  
         12 #|
Equal-ear~s  |  .18782939    .53018131    .16238134    .11960795  
         13 #|
Man prima..  |  .29167277    .41771547     .1742125    .11639926  
         13 #|
Woman pri..  |  .25350399    .42936085    .18741538    .12971978  
         13 #|
Equal-ear~s  |  .19513137    .52296878    .15853754    .12336231  
         14 #|
Man prima..  |  .30832508    .40093898    .17275158    .11798436  
         14 #|
Woman pri..  |   .2647802    .41746369    .18671451    .13104159  
         14 #|
Equal-ear~s  |  .20259243    .51555667    .15469351    .12715739  
         15 #|
Man prima..  |  .32535193    .38418244    .17104884    .11941679  
         15 #|
Woman pri..  |   .2763033    .40554196    .18587601    .13227872  
         15 #|
Equal-ear~s  |  .21020756    .50795118    .15085241    .13098885  
         16 #|
Man prima..  |  .34270909    .36749377    .16910856    .12068859  
         16 #|
Woman pri..  |   .2880601    .39361259    .18489994    .13342736  
         16 #|
Equal-ear~s  |  .21797121     .5001592    .14701748    .13485211  
         17 #|
Man prima..  |  .36034949    .35092106     .1669367    .12179275  
         17 #|
Woman pri..  |  .30003636    .38169284    .18378687    .13448392  
         17 #|
Equal-ear~s  |  .22587729    .49218826    .14319203    .13874241  
         18 #|
Man prima..  |  .37822377    .33451201    .16454088    .12272334  
         18 #|
Woman pri..  |  .31221679    .36980024    .18253786    .13544511  
         18 #|
Equal-ear~s  |  .23391917    .48404659    .13937944     .1426548  
         19 #|
Man prima..  |  .39628084    .31831328     .1619303    .12347557  
         19 #|
Woman pri..  |  .32458515    .35795245    .18115448    .13630791  
         19 #|
Equal-ear~s  |  .24208972    .47574302    .13558311    .14658415  
         20 #|
Man prima..  |  .41446856    .30236994    .15911567    .12404584  
         20 #|
Woman pri..  |  .33712438    .34616717     .1796388    .13706964  
         20 #|
Equal-ear~s  |   .2503813    .46728701    .13180649     .1505252  
         21 #|
Man prima..  |  .43273431    .28672488    .15610902    .12443179  
         21 #|
Woman pri..  |  .34981666      .334462     .1779934    .13772794  
         21 #|
Equal-ear~s  |  .25878582    .45868858    .12805303    .15447257  
         22 #|
Man prima..  |  .45102565    .27141838    .15292365    .12463231  
         22 #|
Woman pri..  |  .36264356    .32285431    .17622133     .1382808  
         22 #|
Equal-ear~s  |  .26729475    .44995831    .12432618    .15842075  
         23 #|
Man prima..  |  .46929094    .25648759    .14957389    .12464758  
         23 #|
Woman pri..  |   .3755861    .31136119    .17432612    .13872659  
         23 #|
Equal-ear~s  |  .27589917    .44110727    .12062937    .16236419  
         24 #|
Man prima..  |  .48747987    .24196619    .14607496    .12447898  
         24 #|
Woman pri..  |  .38862495    .29999924    .17231175    .13906406  
         24 #|
Equal-ear~s  |  .28458977    .43214699      .116966    .16629724  
         25 #|
Man prima..  |  .50554401    .22788411    .14244278     .1241291  
         25 #|
Woman pri..  |  .40174048    .28878455    .17018263    .13929234  
         25 #|
Equal-ear~s  |  .29335693     .4230894    .11333941    .17021426  
         26 #|
Man prima..  |  .52343727    .21426728    .13869376    .12360169  
         26 #|
Woman pri..  |  .41491294    .27773254    .16794357    .13941096  
         26 #|
Equal-ear~s  |  .30219075    .41394679    .10975287    .17410958  
         27 #|
Man prima..  |  .54111631    .20113752    .13484463    .12290154  
         27 #|
Woman pri..  |  .42812254    .26685788    .16559975    .13941982  
         27 #|
Equal-ear~s  |   .3110811    .40473175    .10620959    .17797756  
         28 #|
Man prima..  |  .55854086    .18851246    .13091224    .12203444  
         28 #|
Woman pri..  |  .44134961    .25617444    .16315669    .13931925  
         28 #|
Equal-ear~s  |  .32001764    .39545711    .10271265     .1818126  
         29 #|
Man prima..  |  .57567398    .17640559    .12691338    .12100705  
         29 #|
Woman pri..  |   .4545747    .24569515    .16062021    .13910994  
         29 #|
Equal-ear~s  |  .32898992    .38613587    .09926504    .18560917  
------------------------------------------------------------------

. 
. // Figure 3
. global  ivars "i.marst sex age parent i.employ homemaker ib4.degree hswrk respmom famlife"

. 
. mlogit          pool    c.index##i.marst                i.relinc $ivars                                 , cluster(country)

Iteration 0:   log pseudolikelihood = -10037.195  
Iteration 1:   log pseudolikelihood = -8965.2138  
Iteration 2:   log pseudolikelihood = -8922.1568  
Iteration 3:   log pseudolikelihood = -8921.8576  
Iteration 4:   log pseudolikelihood = -8921.8575  

Multinomial logistic regression                 Number of obs     =      8,238
                                                Wald chi2(16)     =          .
                                                Prob > chi2       =          .
Log pseudolikelihood = -8921.8575               Pseudo R2         =     0.1111

                                        (Std. Err. adjusted for 20 clusters in country)
---------------------------------------------------------------------------------------
                      |               Robust
                 pool |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
One___Manager         |
                index |   .0458001   .0117307     3.90   0.000     .0228084    .0687917
                      |
                marst |
               Cohab  |   .4713292   .1859926     2.53   0.011     .1067905    .8358679
                      |
        marst#c.index |
               Cohab  |  -.0066706   .0064614    -1.03   0.302    -.0193347    .0059936
                      |
               relinc |
Woman primary-earner  |  -.0853197   .1403769    -0.61   0.543    -.3604534     .189814
       Equal-earners  |  -.4463408   .2108885    -2.12   0.034    -.8596747   -.0330069
                      |
                  sex |  -.0523806   .1571151    -0.33   0.739    -.3603205    .2555592
                  age |  -.0112706   .0049423    -2.28   0.023    -.0209574   -.0015839
               parent |  -.0522834    .143223    -0.37   0.715    -.3329953    .2284285
                      |
               employ |
            Parttime  |   .2583382   .1145318     2.26   0.024     .0338599    .4828165
          Unemployed  |    .331774   .2778346     1.19   0.232    -.2127719    .8763199
             Student  |   .3470113   .1571898     2.21   0.027      .038925    .6550975
  Not in labor force  |  -.1885389   .1330201    -1.42   0.156    -.4492536    .0721758
                      |
            homemaker |    .058415   .1061611     0.55   0.582    -.1496568    .2664869
                      |
               degree |
 No formal education  |   .5256298   .2029488     2.59   0.010     .1278574    .9234021
      Primary school  |   .3820678    .179237     2.13   0.033     .0307698    .7333659
     Lower secondary  |   .0321427   .1671143     0.19   0.847    -.2953953    .3596806
      Post secondary  |  -.0311475   .1857025    -0.17   0.867    -.3951177    .3328226
Lower level tertiary  |  -.2821706   .2286358    -1.23   0.217    -.7302885    .1659474
Upper level tertiary  |  -.6348168   .1715389    -3.70   0.000    -.9710268   -.2986068
                      |
                hswrk |  -.1056569    .029019    -3.64   0.000    -.1625331   -.0487806
              respmom |   -.074812    .089242    -0.84   0.402    -.2497231    .1000992
              famlife |  -.1742552   .0883278    -1.97   0.049    -.3473746   -.0011359
                _cons |   .3377084   .6431782     0.53   0.600    -.9228977    1.598314
----------------------+----------------------------------------------------------------
Manage___Together     |  (base outcome)
----------------------+----------------------------------------------------------------
Keep_Some___Separate  |
                index |   .0226805   .0126961     1.79   0.074    -.0022035    .0475644
                      |
                marst |
               Cohab  |   2.049568    .147466    13.90   0.000      1.76054    2.338597
                      |
        marst#c.index |
               Cohab  |  -.0599993   .0081493    -7.36   0.000    -.0759716   -.0440271
                      |
               relinc |
Woman primary-earner  |   .1122683   .1109378     1.01   0.312    -.1051658    .3297023
       Equal-earners  |  -.0290107   .1224485    -0.24   0.813    -.2690052    .2109839
                      |
                  sex |   .0433738   .1144068     0.38   0.705    -.1808594     .267607
                  age |  -.0159966   .0042619    -3.75   0.000    -.0243497   -.0076435
               parent |  -.0432978   .0932762    -0.46   0.643    -.2261157    .1395202
                      |
               employ |
            Parttime  |  -.3681471   .1746227    -2.11   0.035    -.7104012   -.0258929
          Unemployed  |  -.2651809   .2313783    -1.15   0.252    -.7186741    .1883123
             Student  |  -.4141721    .133318    -3.11   0.002    -.6754706   -.1528736
  Not in labor force  |  -.1629373    .140596    -1.16   0.246    -.4385005    .1126259
                      |
            homemaker |  -.3125229    .106504    -2.93   0.003    -.5212669    -.103779
                      |
               degree |
 No formal education  |   .4960962   .4285661     1.16   0.247     -.343878     1.33607
      Primary school  |  -.2251282   .1797675    -1.25   0.210    -.5774661    .1272097
     Lower secondary  |  -.0449835   .1281411    -0.35   0.726    -.2961355    .2061685
      Post secondary  |  -.0094526    .165388    -0.06   0.954    -.3336072     .314702
Lower level tertiary  |   .4162835   .1127924     3.69   0.000     .1952146    .6373525
Upper level tertiary  |   .7253217   .1297056     5.59   0.000     .4711033      .97954
                      |
                hswrk |  -.0215244   .0202538    -1.06   0.288    -.0612211    .0181723
              respmom |    .260738   .1238167     2.11   0.035     .0180617    .5034143
              famlife |  -.2258026   .0402472    -5.61   0.000    -.3046857   -.1469195
                _cons |   .3045314    .438008     0.70   0.487    -.5539485    1.163011
----------------------+----------------------------------------------------------------
Keep_All___Separate   |
                index |   .0334111    .011448     2.92   0.004     .0109735    .0558487
                      |
                marst |
               Cohab  |   2.195581   .2409979     9.11   0.000     1.723234    2.667928
                      |
        marst#c.index |
               Cohab  |  -.0389716   .0150993    -2.58   0.010    -.0685656   -.0093776
                      |
               relinc |
Woman primary-earner  |   .2015793   .1446259     1.39   0.163    -.0818823    .4850409
       Equal-earners  |  -.0972303   .1148333    -0.85   0.397    -.3222994    .1278387
                      |
                  sex |   .1317167   .1178689     1.12   0.264    -.0993021    .3627356
                  age |  -.0060734   .0072701    -0.84   0.403    -.0203226    .0081758
               parent |  -.0464134   .1281808    -0.36   0.717    -.2976432    .2048165
                      |
               employ |
            Parttime  |  -.6629163   .1885994    -3.51   0.000    -1.032564   -.2932683
          Unemployed  |   .2584674   .3372036     0.77   0.443    -.4024394    .9193743
             Student  |  -.2312829     .28189    -0.82   0.412    -.7837773    .3212114
  Not in labor force  |   .1762045   .1078065     1.63   0.102    -.0350923    .3875013
                      |
            homemaker |  -.3671587   .1219359    -3.01   0.003    -.6061487   -.1281688
                      |
               degree |
 No formal education  |   .4839121   .3080317     1.57   0.116    -.1198189    1.087643
      Primary school  |   .1193624   .2646484     0.45   0.652    -.3993388    .6380637
     Lower secondary  |   .2356543   .1985886     1.19   0.235    -.1535722    .6248808
      Post secondary  |   .3126006   .1538182     2.03   0.042     .0111224    .6140788
Lower level tertiary  |   .4388086   .1554767     2.82   0.005     .1340799    .7435373
Upper level tertiary  |     .53721    .239763     2.24   0.025     .0672831    1.007137
                      |
                hswrk |   .0521957   .0277396     1.88   0.060    -.0021729    .1065643
              respmom |  -.0765103   .1554293    -0.49   0.623    -.3811462    .2281256
              famlife |  -.4121174   .0273398   -15.07   0.000    -.4657024   -.3585324
                _cons |   .1621267   .5633179     0.29   0.773     -.941956    1.266209
---------------------------------------------------------------------------------------

. margin          i.marst, at(index=(5(2)62)) predict(outcome(1)) post            /* One Manages  */

Predictive margins                              Number of obs     =      8,238
Model VCE    : Robust

Expression   : Pr(pool==One___Manager), predict(outcome(1))

1._at        : index           =           5

2._at        : index           =           7

3._at        : index           =           9

4._at        : index           =          11

5._at        : index           =          13

6._at        : index           =          15

7._at        : index           =          17

8._at        : index           =          19

9._at        : index           =          21

10._at       : index           =          23

11._at       : index           =          25

12._at       : index           =          27

13._at       : index           =          29

14._at       : index           =          31

15._at       : index           =          33

16._at       : index           =          35

17._at       : index           =          37

18._at       : index           =          39

19._at       : index           =          41

20._at       : index           =          43

21._at       : index           =          45

22._at       : index           =          47

23._at       : index           =          49

24._at       : index           =          51

25._at       : index           =          53

26._at       : index           =          55

27._at       : index           =          57

28._at       : index           =          59

29._at       : index           =          61

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   _at#marst |
  1#Married  |   .1361434   .0214626     6.34   0.000     .0940775    .1782093
    1#Cohab  |   .1047215   .0214091     4.89   0.000     .0627605    .1466826
  2#Married  |   .1453912   .0204082     7.12   0.000     .1053918    .1853906
    2#Cohab  |   .1148747   .0206945     5.55   0.000     .0743143    .1554351
  3#Married  |   .1550689   .0193952     8.00   0.000     .1170551    .1930827
    3#Cohab  |   .1257296   .0200015     6.29   0.000     .0865273    .1649319
  4#Married  |    .165174   .0185634     8.90   0.000     .1287904    .2015576
    4#Cohab  |   .1372981   .0194937     7.04   0.000     .0990911    .1755052
  5#Married  |    .175701   .0181039     9.71   0.000      .140218     .211184
    5#Cohab  |   .1495877   .0193918     7.71   0.000     .1115806    .1875949
  6#Married  |    .186642   .0182389    10.23   0.000     .1508944    .2223896
    6#Cohab  |   .1626011   .0199448     8.15   0.000       .12351    .2016921
  7#Married  |   .1979862   .0191672    10.33   0.000     .1604192    .2355532
    7#Cohab  |   .1763359   .0213652     8.25   0.000     .1344609    .2182109
  8#Married  |   .2097201   .0209988     9.99   0.000     .1685631     .250877
    8#Cohab  |   .1907846   .0237618     8.03   0.000     .1442124    .2373569
  9#Married  |   .2218272   .0237329     9.35   0.000     .1753115    .2683429
    9#Cohab  |   .2059342   .0271256     7.59   0.000     .1527691    .2590993
 10#Married  |   .2342886   .0272922     8.58   0.000     .1807969    .2877803
   10#Cohab  |    .221766   .0313699     7.07   0.000     .1602821    .2832499
 11#Married  |   .2470828   .0315732     7.83   0.000     .1852005    .3089651
   11#Cohab  |   .2382558   .0363796     6.55   0.000     .1669532    .3095585
 12#Married  |   .2601858   .0364773     7.13   0.000     .1886915      .33168
   12#Cohab  |    .255374   .0420395     6.07   0.000     .1729781    .3377698
 13#Married  |   .2735713   .0419209     6.53   0.000     .1914078    .3557349
   13#Cohab  |   .2730854   .0482439     5.66   0.000     .1785292    .3676417
 14#Married  |   .2872114    .047835     6.00   0.000     .1934565    .3809663
   14#Cohab  |     .29135   .0548965     5.31   0.000     .1837547    .3989452
 15#Married  |   .3010761   .0541614     5.56   0.000     .1949217    .4072306
   15#Cohab  |   .3101227   .0619079     5.01   0.000     .1887855    .4314599
 16#Married  |   .3151345   .0608493     5.18   0.000     .1958719     .434397
   16#Cohab  |   .3293542   .0691924     4.76   0.000     .1937397    .4649688
 17#Married  |   .3293541   .0678528     4.85   0.000     .1963651    .4623432
   17#Cohab  |   .3489915   .0766669     4.55   0.000     .1987272    .4992558
 18#Married  |   .3437023   .0751287     4.57   0.000     .1964528    .4909518
   18#Cohab  |   .3689778   .0842495     4.38   0.000     .2038519    .5341038
 19#Married  |   .3581456   .0826357     4.33   0.000     .1961826    .5201086
   19#Cohab  |    .389254   .0918596     4.24   0.000     .2092125    .5692955
 20#Married  |   .3726508   .0903339     4.13   0.000     .1955997    .5497019
   20#Cohab  |   .4097585   .0994178     4.12   0.000     .2149031    .6046139
 21#Married  |    .387185   .0981842     3.94   0.000     .1947476    .5796224
   21#Cohab  |   .4304284    .106847     4.03   0.000     .2210122    .6398446
 22#Married  |   .4017158   .1061484     3.78   0.000     .1936687    .6097629
   22#Cohab  |      .4512   .1140723     3.96   0.000     .2276224    .6747776
 23#Married  |   .4162118   .1141896     3.64   0.000     .1924043    .6400194
   23#Cohab  |   .4720092   .1210228     3.90   0.000     .2348088    .7092096
 24#Married  |    .430643   .1222717     3.52   0.000     .1909949     .670291
   24#Cohab  |   .4927927    .127632     3.86   0.000     .2426385    .7429469
 25#Married  |   .4449804     .13036     3.41   0.001     .1894796    .7004813
   25#Cohab  |   .5134883   .1338386     3.84   0.000     .2511693    .7758072
 26#Married  |   .4591971   .1384214     3.32   0.001     .1878962    .7304981
   26#Cohab  |   .5340352   .1395875     3.83   0.000     .2604487    .8076217
 27#Married  |   .4732678   .1464246     3.23   0.001     .1862809    .7602547
   27#Cohab  |   .5543753   .1448303     3.83   0.000     .2705131    .8382375
 28#Married  |   .4871692     .15434     3.16   0.002     .1846683    .7896701
   28#Cohab  |   .5744531    .149526     3.84   0.000     .2813875    .8675186
 29#Married  |     .50088   .1621402     3.09   0.002      .183091     .818669
   29#Cohab  |   .5942162   .1536413     3.87   0.000     .2930849    .8953475
------------------------------------------------------------------------------

. est store       oneman

. 
. mlogit          pool    c.index##i.marst                i.relinc $ivars                                 , cluster(country)

Iteration 0:   log pseudolikelihood = -10037.195  
Iteration 1:   log pseudolikelihood = -8965.2138  
Iteration 2:   log pseudolikelihood = -8922.1568  
Iteration 3:   log pseudolikelihood = -8921.8576  
Iteration 4:   log pseudolikelihood = -8921.8575  

Multinomial logistic regression                 Number of obs     =      8,238
                                                Wald chi2(16)     =          .
                                                Prob > chi2       =          .
Log pseudolikelihood = -8921.8575               Pseudo R2         =     0.1111

                                        (Std. Err. adjusted for 20 clusters in country)
---------------------------------------------------------------------------------------
                      |               Robust
                 pool |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
One___Manager         |
                index |   .0458001   .0117307     3.90   0.000     .0228084    .0687917
                      |
                marst |
               Cohab  |   .4713292   .1859926     2.53   0.011     .1067905    .8358679
                      |
        marst#c.index |
               Cohab  |  -.0066706   .0064614    -1.03   0.302    -.0193347    .0059936
                      |
               relinc |
Woman primary-earner  |  -.0853197   .1403769    -0.61   0.543    -.3604534     .189814
       Equal-earners  |  -.4463408   .2108885    -2.12   0.034    -.8596747   -.0330069
                      |
                  sex |  -.0523806   .1571151    -0.33   0.739    -.3603205    .2555592
                  age |  -.0112706   .0049423    -2.28   0.023    -.0209574   -.0015839
               parent |  -.0522834    .143223    -0.37   0.715    -.3329953    .2284285
                      |
               employ |
            Parttime  |   .2583382   .1145318     2.26   0.024     .0338599    .4828165
          Unemployed  |    .331774   .2778346     1.19   0.232    -.2127719    .8763199
             Student  |   .3470113   .1571898     2.21   0.027      .038925    .6550975
  Not in labor force  |  -.1885389   .1330201    -1.42   0.156    -.4492536    .0721758
                      |
            homemaker |    .058415   .1061611     0.55   0.582    -.1496568    .2664869
                      |
               degree |
 No formal education  |   .5256298   .2029488     2.59   0.010     .1278574    .9234021
      Primary school  |   .3820678    .179237     2.13   0.033     .0307698    .7333659
     Lower secondary  |   .0321427   .1671143     0.19   0.847    -.2953953    .3596806
      Post secondary  |  -.0311475   .1857025    -0.17   0.867    -.3951177    .3328226
Lower level tertiary  |  -.2821706   .2286358    -1.23   0.217    -.7302885    .1659474
Upper level tertiary  |  -.6348168   .1715389    -3.70   0.000    -.9710268   -.2986068
                      |
                hswrk |  -.1056569    .029019    -3.64   0.000    -.1625331   -.0487806
              respmom |   -.074812    .089242    -0.84   0.402    -.2497231    .1000992
              famlife |  -.1742552   .0883278    -1.97   0.049    -.3473746   -.0011359
                _cons |   .3377084   .6431782     0.53   0.600    -.9228977    1.598314
----------------------+----------------------------------------------------------------
Manage___Together     |  (base outcome)
----------------------+----------------------------------------------------------------
Keep_Some___Separate  |
                index |   .0226805   .0126961     1.79   0.074    -.0022035    .0475644
                      |
                marst |
               Cohab  |   2.049568    .147466    13.90   0.000      1.76054    2.338597
                      |
        marst#c.index |
               Cohab  |  -.0599993   .0081493    -7.36   0.000    -.0759716   -.0440271
                      |
               relinc |
Woman primary-earner  |   .1122683   .1109378     1.01   0.312    -.1051658    .3297023
       Equal-earners  |  -.0290107   .1224485    -0.24   0.813    -.2690052    .2109839
                      |
                  sex |   .0433738   .1144068     0.38   0.705    -.1808594     .267607
                  age |  -.0159966   .0042619    -3.75   0.000    -.0243497   -.0076435
               parent |  -.0432978   .0932762    -0.46   0.643    -.2261157    .1395202
                      |
               employ |
            Parttime  |  -.3681471   .1746227    -2.11   0.035    -.7104012   -.0258929
          Unemployed  |  -.2651809   .2313783    -1.15   0.252    -.7186741    .1883123
             Student  |  -.4141721    .133318    -3.11   0.002    -.6754706   -.1528736
  Not in labor force  |  -.1629373    .140596    -1.16   0.246    -.4385005    .1126259
                      |
            homemaker |  -.3125229    .106504    -2.93   0.003    -.5212669    -.103779
                      |
               degree |
 No formal education  |   .4960962   .4285661     1.16   0.247     -.343878     1.33607
      Primary school  |  -.2251282   .1797675    -1.25   0.210    -.5774661    .1272097
     Lower secondary  |  -.0449835   .1281411    -0.35   0.726    -.2961355    .2061685
      Post secondary  |  -.0094526    .165388    -0.06   0.954    -.3336072     .314702
Lower level tertiary  |   .4162835   .1127924     3.69   0.000     .1952146    .6373525
Upper level tertiary  |   .7253217   .1297056     5.59   0.000     .4711033      .97954
                      |
                hswrk |  -.0215244   .0202538    -1.06   0.288    -.0612211    .0181723
              respmom |    .260738   .1238167     2.11   0.035     .0180617    .5034143
              famlife |  -.2258026   .0402472    -5.61   0.000    -.3046857   -.1469195
                _cons |   .3045314    .438008     0.70   0.487    -.5539485    1.163011
----------------------+----------------------------------------------------------------
Keep_All___Separate   |
                index |   .0334111    .011448     2.92   0.004     .0109735    .0558487
                      |
                marst |
               Cohab  |   2.195581   .2409979     9.11   0.000     1.723234    2.667928
                      |
        marst#c.index |
               Cohab  |  -.0389716   .0150993    -2.58   0.010    -.0685656   -.0093776
                      |
               relinc |
Woman primary-earner  |   .2015793   .1446259     1.39   0.163    -.0818823    .4850409
       Equal-earners  |  -.0972303   .1148333    -0.85   0.397    -.3222994    .1278387
                      |
                  sex |   .1317167   .1178689     1.12   0.264    -.0993021    .3627356
                  age |  -.0060734   .0072701    -0.84   0.403    -.0203226    .0081758
               parent |  -.0464134   .1281808    -0.36   0.717    -.2976432    .2048165
                      |
               employ |
            Parttime  |  -.6629163   .1885994    -3.51   0.000    -1.032564   -.2932683
          Unemployed  |   .2584674   .3372036     0.77   0.443    -.4024394    .9193743
             Student  |  -.2312829     .28189    -0.82   0.412    -.7837773    .3212114
  Not in labor force  |   .1762045   .1078065     1.63   0.102    -.0350923    .3875013
                      |
            homemaker |  -.3671587   .1219359    -3.01   0.003    -.6061487   -.1281688
                      |
               degree |
 No formal education  |   .4839121   .3080317     1.57   0.116    -.1198189    1.087643
      Primary school  |   .1193624   .2646484     0.45   0.652    -.3993388    .6380637
     Lower secondary  |   .2356543   .1985886     1.19   0.235    -.1535722    .6248808
      Post secondary  |   .3126006   .1538182     2.03   0.042     .0111224    .6140788
Lower level tertiary  |   .4388086   .1554767     2.82   0.005     .1340799    .7435373
Upper level tertiary  |     .53721    .239763     2.24   0.025     .0672831    1.007137
                      |
                hswrk |   .0521957   .0277396     1.88   0.060    -.0021729    .1065643
              respmom |  -.0765103   .1554293    -0.49   0.623    -.3811462    .2281256
              famlife |  -.4121174   .0273398   -15.07   0.000    -.4657024   -.3585324
                _cons |   .1621267   .5633179     0.29   0.773     -.941956    1.266209
---------------------------------------------------------------------------------------

. margin          i.marst, at(index=(5(2)62)) predict(outcome(2)) post            /* Manage Equal */

Predictive margins                              Number of obs     =      8,238
Model VCE    : Robust

Expression   : Pr(pool==Manage___Together), predict(outcome(2))

1._at        : index           =           5

2._at        : index           =           7

3._at        : index           =           9

4._at        : index           =          11

5._at        : index           =          13

6._at        : index           =          15

7._at        : index           =          17

8._at        : index           =          19

9._at        : index           =          21

10._at       : index           =          23

11._at       : index           =          25

12._at       : index           =          27

13._at       : index           =          29

14._at       : index           =          31

15._at       : index           =          33

16._at       : index           =          35

17._at       : index           =          37

18._at       : index           =          39

19._at       : index           =          41

20._at       : index           =          43

21._at       : index           =          45

22._at       : index           =          47

23._at       : index           =          49

24._at       : index           =          51

25._at       : index           =          53

26._at       : index           =          55

27._at       : index           =          57

28._at       : index           =          59

29._at       : index           =          61

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   _at#marst |
  1#Married  |   .6517595    .032347    20.15   0.000     .5883606    .7151584
    1#Cohab  |   .3133219   .0287281    10.91   0.000     .2570159    .3696278
  2#Married  |   .6365742    .030547    20.84   0.000     .5767031    .6964452
    2#Cohab  |   .3191653   .0253988    12.57   0.000     .2693845     .368946
  3#Married  |   .6210203   .0288242    21.55   0.000     .5645258    .6775147
    3#Cohab  |    .324449   .0229228    14.15   0.000     .2795212    .3693769
  4#Married  |   .6051211   .0272286    22.22   0.000     .5517539    .6584882
    4#Cohab  |   .3291332   .0215462    15.28   0.000     .2869035    .3713629
  5#Married  |    .588903   .0258186    22.81   0.000     .5382994    .6395065
    5#Cohab  |   .3331812   .0213833    15.58   0.000     .2912708    .3750917
  6#Married  |   .5723954    .024659    23.21   0.000     .5240647    .6207261
    6#Cohab  |   .3365608    .022326    15.07   0.000     .2928026     .380319
  7#Married  |   .5556308   .0238154    23.33   0.000     .5089535     .602308
    7#Cohab  |   .3392442   .0240909    14.08   0.000      .292027    .3864614
  8#Married  |   .5386441   .0233456    23.07   0.000     .4928877    .5844006
    8#Cohab  |   .3412087   .0263531    12.95   0.000     .2895576    .3928598
  9#Married  |    .521473   .0232883    22.39   0.000     .4758288    .5671172
    9#Cohab  |   .3424371   .0288399    11.87   0.000      .285912    .3989622
 10#Married  |   .5041572   .0236542    21.31   0.000     .4577959    .5505185
   10#Cohab  |   .3429177   .0313532    10.94   0.000     .2814666    .4043689
 11#Married  |   .4867382   .0244227    19.93   0.000     .4388705    .5346059
   11#Cohab  |   .3426449   .0337593    10.15   0.000     .2764779     .408812
 12#Married  |   .4692591   .0255474    18.37   0.000      .419187    .5193312
   12#Cohab  |    .341619   .0359719     9.50   0.000     .2711154    .4121226
 13#Married  |    .451764   .0269654    16.75   0.000     .3989127    .5046152
   13#Cohab  |   .3398462    .037939     8.96   0.000     .2654872    .4142052
 14#Married  |   .4342975   .0286077    15.18   0.000     .3782274    .4903677
   14#Cohab  |   .3373389   .0396342     8.51   0.000     .2596573    .4150204
 15#Married  |   .4169046    .030407    13.71   0.000     .3573079    .4765013
   15#Cohab  |    .334115   .0410508     8.14   0.000     .2536569     .414573
 16#Married  |   .3996296   .0323017    12.37   0.000     .3363194    .4629398
   16#Cohab  |    .330198   .0421978     7.83   0.000     .2474918    .4129041
 17#Married  |   .3825164   .0342376    11.17   0.000      .315412    .4496209
   17#Cohab  |   .3256166   .0430971     7.56   0.000     .2411478    .4100854
 18#Married  |   .3656074   .0361681    10.11   0.000     .2947192    .4364956
   18#Cohab  |   .3204042   .0437808     7.32   0.000     .2345954    .4062131
 19#Married  |   .3489435   .0380538     9.17   0.000     .2743594    .4235276
   19#Cohab  |   .3145985   .0442891     7.10   0.000     .2277935    .4014035
 20#Married  |   .3325633   .0398615     8.34   0.000     .2544363    .4106903
   20#Cohab  |   .3082408   .0446673     6.90   0.000     .2206945    .3957871
 21#Married  |   .3165032   .0415635     7.61   0.000     .2350403    .3979662
   21#Cohab  |   .3013757   .0449636     6.70   0.000     .2132486    .3895027
 22#Married  |   .3007969   .0431374     6.97   0.000     .2162492    .3853445
   22#Cohab  |   .2940502   .0452258     6.50   0.000     .2054092    .3826912
 23#Married  |   .2854749   .0445648     6.41   0.000     .1981294    .3728204
   23#Cohab  |   .2863135   .0454983     6.29   0.000     .1971385    .3754886
 24#Married  |   .2705646   .0458319     5.90   0.000     .1807357    .3603934
   24#Cohab  |    .278216    .045819     6.07   0.000     .1884125    .3680195
 25#Married  |   .2560901    .046928     5.46   0.000     .1641128    .3480674
   25#Cohab  |   .2698086   .0462167     5.84   0.000     .1792255    .3603918
 26#Married  |   .2420721   .0478463     5.06   0.000     .1482951    .3358491
   26#Cohab  |   .2611427   .0467098     5.59   0.000     .1695932    .3526923
 27#Married  |   .2285277   .0485826     4.70   0.000     .1333076    .3237478
   27#Cohab  |   .2522691   .0473048     5.33   0.000     .1595535    .3449847
 28#Married  |   .2154706   .0491357     4.39   0.000     .1191664    .3117749
   28#Cohab  |   .2432375    .047997     5.07   0.000     .1491652    .3373099
 29#Married  |   .2029112   .0495071     4.10   0.000     .1058792    .2999433
   29#Cohab  |   .2340965   .0487721     4.80   0.000      .138505     .329688
------------------------------------------------------------------------------

. est store       equal

. 
. mlogit          pool    c.index##i.marst                i.relinc $ivars                                 , cluster(country)

Iteration 0:   log pseudolikelihood = -10037.195  
Iteration 1:   log pseudolikelihood = -8965.2138  
Iteration 2:   log pseudolikelihood = -8922.1568  
Iteration 3:   log pseudolikelihood = -8921.8576  
Iteration 4:   log pseudolikelihood = -8921.8575  

Multinomial logistic regression                 Number of obs     =      8,238
                                                Wald chi2(16)     =          .
                                                Prob > chi2       =          .
Log pseudolikelihood = -8921.8575               Pseudo R2         =     0.1111

                                        (Std. Err. adjusted for 20 clusters in country)
---------------------------------------------------------------------------------------
                      |               Robust
                 pool |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
One___Manager         |
                index |   .0458001   .0117307     3.90   0.000     .0228084    .0687917
                      |
                marst |
               Cohab  |   .4713292   .1859926     2.53   0.011     .1067905    .8358679
                      |
        marst#c.index |
               Cohab  |  -.0066706   .0064614    -1.03   0.302    -.0193347    .0059936
                      |
               relinc |
Woman primary-earner  |  -.0853197   .1403769    -0.61   0.543    -.3604534     .189814
       Equal-earners  |  -.4463408   .2108885    -2.12   0.034    -.8596747   -.0330069
                      |
                  sex |  -.0523806   .1571151    -0.33   0.739    -.3603205    .2555592
                  age |  -.0112706   .0049423    -2.28   0.023    -.0209574   -.0015839
               parent |  -.0522834    .143223    -0.37   0.715    -.3329953    .2284285
                      |
               employ |
            Parttime  |   .2583382   .1145318     2.26   0.024     .0338599    .4828165
          Unemployed  |    .331774   .2778346     1.19   0.232    -.2127719    .8763199
             Student  |   .3470113   .1571898     2.21   0.027      .038925    .6550975
  Not in labor force  |  -.1885389   .1330201    -1.42   0.156    -.4492536    .0721758
                      |
            homemaker |    .058415   .1061611     0.55   0.582    -.1496568    .2664869
                      |
               degree |
 No formal education  |   .5256298   .2029488     2.59   0.010     .1278574    .9234021
      Primary school  |   .3820678    .179237     2.13   0.033     .0307698    .7333659
     Lower secondary  |   .0321427   .1671143     0.19   0.847    -.2953953    .3596806
      Post secondary  |  -.0311475   .1857025    -0.17   0.867    -.3951177    .3328226
Lower level tertiary  |  -.2821706   .2286358    -1.23   0.217    -.7302885    .1659474
Upper level tertiary  |  -.6348168   .1715389    -3.70   0.000    -.9710268   -.2986068
                      |
                hswrk |  -.1056569    .029019    -3.64   0.000    -.1625331   -.0487806
              respmom |   -.074812    .089242    -0.84   0.402    -.2497231    .1000992
              famlife |  -.1742552   .0883278    -1.97   0.049    -.3473746   -.0011359
                _cons |   .3377084   .6431782     0.53   0.600    -.9228977    1.598314
----------------------+----------------------------------------------------------------
Manage___Together     |  (base outcome)
----------------------+----------------------------------------------------------------
Keep_Some___Separate  |
                index |   .0226805   .0126961     1.79   0.074    -.0022035    .0475644
                      |
                marst |
               Cohab  |   2.049568    .147466    13.90   0.000      1.76054    2.338597
                      |
        marst#c.index |
               Cohab  |  -.0599993   .0081493    -7.36   0.000    -.0759716   -.0440271
                      |
               relinc |
Woman primary-earner  |   .1122683   .1109378     1.01   0.312    -.1051658    .3297023
       Equal-earners  |  -.0290107   .1224485    -0.24   0.813    -.2690052    .2109839
                      |
                  sex |   .0433738   .1144068     0.38   0.705    -.1808594     .267607
                  age |  -.0159966   .0042619    -3.75   0.000    -.0243497   -.0076435
               parent |  -.0432978   .0932762    -0.46   0.643    -.2261157    .1395202
                      |
               employ |
            Parttime  |  -.3681471   .1746227    -2.11   0.035    -.7104012   -.0258929
          Unemployed  |  -.2651809   .2313783    -1.15   0.252    -.7186741    .1883123
             Student  |  -.4141721    .133318    -3.11   0.002    -.6754706   -.1528736
  Not in labor force  |  -.1629373    .140596    -1.16   0.246    -.4385005    .1126259
                      |
            homemaker |  -.3125229    .106504    -2.93   0.003    -.5212669    -.103779
                      |
               degree |
 No formal education  |   .4960962   .4285661     1.16   0.247     -.343878     1.33607
      Primary school  |  -.2251282   .1797675    -1.25   0.210    -.5774661    .1272097
     Lower secondary  |  -.0449835   .1281411    -0.35   0.726    -.2961355    .2061685
      Post secondary  |  -.0094526    .165388    -0.06   0.954    -.3336072     .314702
Lower level tertiary  |   .4162835   .1127924     3.69   0.000     .1952146    .6373525
Upper level tertiary  |   .7253217   .1297056     5.59   0.000     .4711033      .97954
                      |
                hswrk |  -.0215244   .0202538    -1.06   0.288    -.0612211    .0181723
              respmom |    .260738   .1238167     2.11   0.035     .0180617    .5034143
              famlife |  -.2258026   .0402472    -5.61   0.000    -.3046857   -.1469195
                _cons |   .3045314    .438008     0.70   0.487    -.5539485    1.163011
----------------------+----------------------------------------------------------------
Keep_All___Separate   |
                index |   .0334111    .011448     2.92   0.004     .0109735    .0558487
                      |
                marst |
               Cohab  |   2.195581   .2409979     9.11   0.000     1.723234    2.667928
                      |
        marst#c.index |
               Cohab  |  -.0389716   .0150993    -2.58   0.010    -.0685656   -.0093776
                      |
               relinc |
Woman primary-earner  |   .2015793   .1446259     1.39   0.163    -.0818823    .4850409
       Equal-earners  |  -.0972303   .1148333    -0.85   0.397    -.3222994    .1278387
                      |
                  sex |   .1317167   .1178689     1.12   0.264    -.0993021    .3627356
                  age |  -.0060734   .0072701    -0.84   0.403    -.0203226    .0081758
               parent |  -.0464134   .1281808    -0.36   0.717    -.2976432    .2048165
                      |
               employ |
            Parttime  |  -.6629163   .1885994    -3.51   0.000    -1.032564   -.2932683
          Unemployed  |   .2584674   .3372036     0.77   0.443    -.4024394    .9193743
             Student  |  -.2312829     .28189    -0.82   0.412    -.7837773    .3212114
  Not in labor force  |   .1762045   .1078065     1.63   0.102    -.0350923    .3875013
                      |
            homemaker |  -.3671587   .1219359    -3.01   0.003    -.6061487   -.1281688
                      |
               degree |
 No formal education  |   .4839121   .3080317     1.57   0.116    -.1198189    1.087643
      Primary school  |   .1193624   .2646484     0.45   0.652    -.3993388    .6380637
     Lower secondary  |   .2356543   .1985886     1.19   0.235    -.1535722    .6248808
      Post secondary  |   .3126006   .1538182     2.03   0.042     .0111224    .6140788
Lower level tertiary  |   .4388086   .1554767     2.82   0.005     .1340799    .7435373
Upper level tertiary  |     .53721    .239763     2.24   0.025     .0672831    1.007137
                      |
                hswrk |   .0521957   .0277396     1.88   0.060    -.0021729    .1065643
              respmom |  -.0765103   .1554293    -0.49   0.623    -.3811462    .2281256
              famlife |  -.4121174   .0273398   -15.07   0.000    -.4657024   -.3585324
                _cons |   .1621267   .5633179     0.29   0.773     -.941956    1.266209
---------------------------------------------------------------------------------------

. margin          i.marst, at(index=(5(2)62)) predict(outcome(3)) post            /* Pool Some    */

Predictive margins                              Number of obs     =      8,238
Model VCE    : Robust

Expression   : Pr(pool==Keep_Some___Separate), predict(outcome(3))

1._at        : index           =           5

2._at        : index           =           7

3._at        : index           =           9

4._at        : index           =          11

5._at        : index           =          13

6._at        : index           =          15

7._at        : index           =          17

8._at        : index           =          19

9._at        : index           =          21

10._at       : index           =          23

11._at       : index           =          25

12._at       : index           =          27

13._at       : index           =          29

14._at       : index           =          31

15._at       : index           =          33

16._at       : index           =          35

17._at       : index           =          37

18._at       : index           =          39

19._at       : index           =          41

20._at       : index           =          43

21._at       : index           =          45

22._at       : index           =          47

23._at       : index           =          49

24._at       : index           =          51

25._at       : index           =          53

26._at       : index           =          55

27._at       : index           =          57

28._at       : index           =          59

29._at       : index           =          61

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   _at#marst |
  1#Married  |   .1455502   .0224333     6.49   0.000     .1015817    .1895188
    1#Cohab  |   .3670557   .0323199    11.36   0.000     .3037099    .4304015
  2#Married  |   .1486432   .0206616     7.19   0.000     .1081471    .1891392
    2#Cohab  |   .3487431    .028976    12.04   0.000     .2919511    .4055351
  3#Married  |   .1516343    .019064     7.95   0.000     .1142696     .188999
    3#Cohab  |   .3306914   .0259405    12.75   0.000     .2798488    .3815339
  4#Married  |   .1545103   .0177456     8.71   0.000     .1197297     .189291
    4#Cohab  |   .3129463     .02333    13.41   0.000     .2672204    .3586722
  5#Married  |   .1572578   .0168332     9.34   0.000     .1242654    .1902502
    5#Cohab  |   .2955517   .0212709    13.89   0.000     .2538614    .3372419
  6#Married  |   .1598636   .0164557     9.71   0.000      .127611    .1921163
    6#Cohab  |   .2785492   .0198775    14.01   0.000       .23959    .3175083
  7#Married  |    .162315    .016708     9.71   0.000     .1295679     .195062
    7#Cohab  |   .2619776   .0192121    13.64   0.000     .2243226    .2996327
  8#Married  |   .1645994   .0176158     9.34   0.000     .1300732    .1991257
    8#Cohab  |   .2458729   .0192495    12.77   0.000     .2081446    .2836011
  9#Married  |   .1667054   .0191317     8.71   0.000      .129208    .2042027
    9#Cohab  |   .2302673   .0198748    11.59   0.000     .1913134    .2692213
 10#Married  |   .1686218   .0211637     7.97   0.000     .1271418    .2101018
   10#Cohab  |   .2151899   .0209227    10.28   0.000     .1741821    .2561977
 11#Married  |   .1703386   .0236099     7.21   0.000     .1240641    .2166131
   11#Cohab  |   .2006656   .0222242     9.03   0.000     .1571068    .2442243
 12#Married  |   .1718468   .0263797     6.51   0.000     .1201435    .2235501
   12#Cohab  |   .1867154    .023636     7.90   0.000     .1403897    .2330411
 13#Married  |   .1731385   .0294004     5.89   0.000     .1155148    .2307622
   13#Cohab  |   .1733564   .0250482     6.92   0.000     .1242628    .2224499
 14#Married  |    .174207   .0326155     5.34   0.000     .1102818    .2381323
   14#Cohab  |   .1606013   .0263816     6.09   0.000     .1088944    .2123082
 15#Married  |    .175047   .0359815     4.86   0.000     .1045245    .2455695
   15#Cohab  |    .148459   .0275811     5.38   0.000     .0944011    .2025168
 16#Married  |   .1756545   .0394641     4.45   0.000     .0983063    .2530027
   16#Cohab  |   .1369341     .02861     4.79   0.000     .0808596    .1930087
 17#Married  |   .1760269   .0430354     4.09   0.000     .0916791    .2603748
   17#Cohab  |   .1260277   .0294454     4.28   0.000     .0683157    .1837396
 18#Married  |   .1761633   .0466722     3.77   0.000     .0846875    .2676391
   18#Cohab  |   .1157367   .0300748     3.85   0.000     .0567912    .1746822
 19#Married  |   .1760639   .0503542     3.50   0.000     .0773714    .2747564
   19#Cohab  |   .1060549   .0304935     3.48   0.001     .0462887    .1658211
 20#Married  |   .1757306   .0540634     3.25   0.001     .0697683    .2816929
   20#Cohab  |   .0969726   .0307032     3.16   0.002     .0367955    .1571498
 21#Married  |   .1751666   .0577832     3.03   0.002     .0619137    .2884195
   21#Cohab  |   .0884774   .0307101     2.88   0.004     .0282866    .1486681
 22#Married  |   .1743765    .061498     2.84   0.005     .0538427    .2949104
   22#Cohab  |   .0805539   .0305244     2.64   0.008     .0207272    .1403806
 23#Married  |   .1733661   .0651932     2.66   0.008     .0455898    .3011425
   23#Cohab  |   .0731848   .0301589     2.43   0.015     .0140743    .1322952
 24#Married  |   .1721425   .0688548     2.50   0.012     .0371895    .3070955
   24#Cohab  |   .0663504   .0296288     2.24   0.025     .0082789    .1244218
 25#Married  |   .1707136   .0724693     2.36   0.018     .0286763    .3127509
   25#Cohab  |   .0600295   .0289506     2.07   0.038     .0032873    .1167716
 26#Married  |   .1690885   .0760238     2.22   0.026     .0200846    .3180925
   26#Cohab  |   .0541995   .0281418     1.93   0.054    -.0009573    .1093564
 27#Married  |   .1672772   .0795058     2.10   0.035     .0114486    .3231057
   27#Cohab  |    .048837   .0272203     1.79   0.073    -.0045138    .1021878
 28#Married  |   .1652901   .0829036     1.99   0.046     .0028021    .3277781
   28#Cohab  |   .0439175   .0262043     1.68   0.094    -.0074419    .0952769
 29#Married  |   .1631384   .0862057     1.89   0.058    -.0058217    .3320986
   29#Cohab  |   .0394163   .0251114     1.57   0.116    -.0098011    .0886338
------------------------------------------------------------------------------

. est store       some

. 
. mlogit          pool    c.index##i.marst                i.relinc $ivars                                 , cluster(country)

Iteration 0:   log pseudolikelihood = -10037.195  
Iteration 1:   log pseudolikelihood = -8965.2138  
Iteration 2:   log pseudolikelihood = -8922.1568  
Iteration 3:   log pseudolikelihood = -8921.8576  
Iteration 4:   log pseudolikelihood = -8921.8575  

Multinomial logistic regression                 Number of obs     =      8,238
                                                Wald chi2(16)     =          .
                                                Prob > chi2       =          .
Log pseudolikelihood = -8921.8575               Pseudo R2         =     0.1111

                                        (Std. Err. adjusted for 20 clusters in country)
---------------------------------------------------------------------------------------
                      |               Robust
                 pool |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
One___Manager         |
                index |   .0458001   .0117307     3.90   0.000     .0228084    .0687917
                      |
                marst |
               Cohab  |   .4713292   .1859926     2.53   0.011     .1067905    .8358679
                      |
        marst#c.index |
               Cohab  |  -.0066706   .0064614    -1.03   0.302    -.0193347    .0059936
                      |
               relinc |
Woman primary-earner  |  -.0853197   .1403769    -0.61   0.543    -.3604534     .189814
       Equal-earners  |  -.4463408   .2108885    -2.12   0.034    -.8596747   -.0330069
                      |
                  sex |  -.0523806   .1571151    -0.33   0.739    -.3603205    .2555592
                  age |  -.0112706   .0049423    -2.28   0.023    -.0209574   -.0015839
               parent |  -.0522834    .143223    -0.37   0.715    -.3329953    .2284285
                      |
               employ |
            Parttime  |   .2583382   .1145318     2.26   0.024     .0338599    .4828165
          Unemployed  |    .331774   .2778346     1.19   0.232    -.2127719    .8763199
             Student  |   .3470113   .1571898     2.21   0.027      .038925    .6550975
  Not in labor force  |  -.1885389   .1330201    -1.42   0.156    -.4492536    .0721758
                      |
            homemaker |    .058415   .1061611     0.55   0.582    -.1496568    .2664869
                      |
               degree |
 No formal education  |   .5256298   .2029488     2.59   0.010     .1278574    .9234021
      Primary school  |   .3820678    .179237     2.13   0.033     .0307698    .7333659
     Lower secondary  |   .0321427   .1671143     0.19   0.847    -.2953953    .3596806
      Post secondary  |  -.0311475   .1857025    -0.17   0.867    -.3951177    .3328226
Lower level tertiary  |  -.2821706   .2286358    -1.23   0.217    -.7302885    .1659474
Upper level tertiary  |  -.6348168   .1715389    -3.70   0.000    -.9710268   -.2986068
                      |
                hswrk |  -.1056569    .029019    -3.64   0.000    -.1625331   -.0487806
              respmom |   -.074812    .089242    -0.84   0.402    -.2497231    .1000992
              famlife |  -.1742552   .0883278    -1.97   0.049    -.3473746   -.0011359
                _cons |   .3377084   .6431782     0.53   0.600    -.9228977    1.598314
----------------------+----------------------------------------------------------------
Manage___Together     |  (base outcome)
----------------------+----------------------------------------------------------------
Keep_Some___Separate  |
                index |   .0226805   .0126961     1.79   0.074    -.0022035    .0475644
                      |
                marst |
               Cohab  |   2.049568    .147466    13.90   0.000      1.76054    2.338597
                      |
        marst#c.index |
               Cohab  |  -.0599993   .0081493    -7.36   0.000    -.0759716   -.0440271
                      |
               relinc |
Woman primary-earner  |   .1122683   .1109378     1.01   0.312    -.1051658    .3297023
       Equal-earners  |  -.0290107   .1224485    -0.24   0.813    -.2690052    .2109839
                      |
                  sex |   .0433738   .1144068     0.38   0.705    -.1808594     .267607
                  age |  -.0159966   .0042619    -3.75   0.000    -.0243497   -.0076435
               parent |  -.0432978   .0932762    -0.46   0.643    -.2261157    .1395202
                      |
               employ |
            Parttime  |  -.3681471   .1746227    -2.11   0.035    -.7104012   -.0258929
          Unemployed  |  -.2651809   .2313783    -1.15   0.252    -.7186741    .1883123
             Student  |  -.4141721    .133318    -3.11   0.002    -.6754706   -.1528736
  Not in labor force  |  -.1629373    .140596    -1.16   0.246    -.4385005    .1126259
                      |
            homemaker |  -.3125229    .106504    -2.93   0.003    -.5212669    -.103779
                      |
               degree |
 No formal education  |   .4960962   .4285661     1.16   0.247     -.343878     1.33607
      Primary school  |  -.2251282   .1797675    -1.25   0.210    -.5774661    .1272097
     Lower secondary  |  -.0449835   .1281411    -0.35   0.726    -.2961355    .2061685
      Post secondary  |  -.0094526    .165388    -0.06   0.954    -.3336072     .314702
Lower level tertiary  |   .4162835   .1127924     3.69   0.000     .1952146    .6373525
Upper level tertiary  |   .7253217   .1297056     5.59   0.000     .4711033      .97954
                      |
                hswrk |  -.0215244   .0202538    -1.06   0.288    -.0612211    .0181723
              respmom |    .260738   .1238167     2.11   0.035     .0180617    .5034143
              famlife |  -.2258026   .0402472    -5.61   0.000    -.3046857   -.1469195
                _cons |   .3045314    .438008     0.70   0.487    -.5539485    1.163011
----------------------+----------------------------------------------------------------
Keep_All___Separate   |
                index |   .0334111    .011448     2.92   0.004     .0109735    .0558487
                      |
                marst |
               Cohab  |   2.195581   .2409979     9.11   0.000     1.723234    2.667928
                      |
        marst#c.index |
               Cohab  |  -.0389716   .0150993    -2.58   0.010    -.0685656   -.0093776
                      |
               relinc |
Woman primary-earner  |   .2015793   .1446259     1.39   0.163    -.0818823    .4850409
       Equal-earners  |  -.0972303   .1148333    -0.85   0.397    -.3222994    .1278387
                      |
                  sex |   .1317167   .1178689     1.12   0.264    -.0993021    .3627356
                  age |  -.0060734   .0072701    -0.84   0.403    -.0203226    .0081758
               parent |  -.0464134   .1281808    -0.36   0.717    -.2976432    .2048165
                      |
               employ |
            Parttime  |  -.6629163   .1885994    -3.51   0.000    -1.032564   -.2932683
          Unemployed  |   .2584674   .3372036     0.77   0.443    -.4024394    .9193743
             Student  |  -.2312829     .28189    -0.82   0.412    -.7837773    .3212114
  Not in labor force  |   .1762045   .1078065     1.63   0.102    -.0350923    .3875013
                      |
            homemaker |  -.3671587   .1219359    -3.01   0.003    -.6061487   -.1281688
                      |
               degree |
 No formal education  |   .4839121   .3080317     1.57   0.116    -.1198189    1.087643
      Primary school  |   .1193624   .2646484     0.45   0.652    -.3993388    .6380637
     Lower secondary  |   .2356543   .1985886     1.19   0.235    -.1535722    .6248808
      Post secondary  |   .3126006   .1538182     2.03   0.042     .0111224    .6140788
Lower level tertiary  |   .4388086   .1554767     2.82   0.005     .1340799    .7435373
Upper level tertiary  |     .53721    .239763     2.24   0.025     .0672831    1.007137
                      |
                hswrk |   .0521957   .0277396     1.88   0.060    -.0021729    .1065643
              respmom |  -.0765103   .1554293    -0.49   0.623    -.3811462    .2281256
              famlife |  -.4121174   .0273398   -15.07   0.000    -.4657024   -.3585324
                _cons |   .1621267   .5633179     0.29   0.773     -.941956    1.266209
---------------------------------------------------------------------------------------

. margin          i.marst, at(index=(5(2)62)) predict(outcome(4)) post            /* Keep Sep             */

Predictive margins                              Number of obs     =      8,238
Model VCE    : Robust

Expression   : Pr(pool==Keep_All___Separate), predict(outcome(4))

1._at        : index           =           5

2._at        : index           =           7

3._at        : index           =           9

4._at        : index           =          11

5._at        : index           =          13

6._at        : index           =          15

7._at        : index           =          17

8._at        : index           =          19

9._at        : index           =          21

10._at       : index           =          23

11._at       : index           =          25

12._at       : index           =          27

13._at       : index           =          29

14._at       : index           =          31

15._at       : index           =          33

16._at       : index           =          35

17._at       : index           =          37

18._at       : index           =          39

19._at       : index           =          41

20._at       : index           =          43

21._at       : index           =          45

22._at       : index           =          47

23._at       : index           =          49

24._at       : index           =          51

25._at       : index           =          53

26._at       : index           =          55

27._at       : index           =          57

28._at       : index           =          59

29._at       : index           =          61

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   _at#marst |
  1#Married  |   .0665469   .0145113     4.59   0.000     .0381052    .0949886
    1#Cohab  |   .2149009   .0328358     6.54   0.000     .1505439    .2792578
  2#Married  |   .0693915   .0141169     4.92   0.000     .0417229    .0970601
    2#Cohab  |    .217217   .0293379     7.40   0.000     .1597157    .2747182
  3#Married  |   .0722764   .0137196     5.27   0.000     .0453865    .0991664
    3#Cohab  |     .21913   .0262239     8.36   0.000     .1677321    .2705279
  4#Married  |   .0751946   .0133395     5.64   0.000     .0490497    .1013395
    4#Cohab  |   .2206224   .0238312     9.26   0.000     .1739141    .2673307
  5#Married  |   .0781382   .0130022     6.01   0.000     .0526544     .103622
    5#Cohab  |   .2216794   .0225829     9.82   0.000     .1774176    .2659411
  6#Married  |   .0810989   .0127398     6.37   0.000     .0561294    .1060684
    6#Cohab  |   .2222889   .0228469     9.73   0.000     .1775098     .267068
  7#Married  |    .084068   .0125899     6.68   0.000     .0593922    .1087439
    7#Cohab  |   .2224422   .0247236     9.00   0.000     .1739848    .2708997
  8#Married  |   .0870364   .0125939     6.91   0.000     .0623528      .11172
    8#Cohab  |   .2221338   .0280025     7.93   0.000     .1672498    .2770177
  9#Married  |   .0899944   .0127924     7.04   0.000     .0649218     .115067
    9#Cohab  |   .2213614   .0323362     6.85   0.000     .1579835    .2847392
 10#Married  |   .0929324   .0132203     7.03   0.000     .0670211    .1188438
   10#Cohab  |   .2201264   .0374049     5.88   0.000     .1468141    .2934386
 11#Married  |   .0958404    .013902     6.89   0.000      .068593    .1230878
   11#Cohab  |   .2184337   .0429671     5.08   0.000     .1342198    .3026476
 12#Married  |   .0987083   .0148487     6.65   0.000     .0696054    .1278112
   12#Cohab  |   .2162916   .0488491     4.43   0.000     .1205492    .3120341
 13#Married  |   .1015262   .0160595     6.32   0.000     .0700502    .1330022
   13#Cohab  |    .213712   .0549231     3.89   0.000     .1060647    .3213594
 14#Married  |   .1042841   .0175245     5.95   0.000     .0699368    .1386314
   14#Cohab  |   .2107099   .0610903     3.45   0.001      .090975    .3304447
 15#Married  |   .1069723   .0192288     5.56   0.000     .0692846      .14466
   15#Cohab  |   .2073034   .0672697     3.08   0.002     .0754572    .3391496
 16#Married  |   .1095814   .0211557     5.18   0.000     .0681171    .1510457
   16#Cohab  |   .2035136   .0733919     2.77   0.006     .0596681    .3473591
 17#Married  |   .1121025   .0232884     4.81   0.000      .066458     .157747
   17#Cohab  |   .1993642   .0793954     2.51   0.012     .0437522    .3549763
 18#Married  |    .114527   .0256117     4.47   0.000     .0643291    .1647249
   18#Cohab  |   .1948812   .0852244     2.29   0.022     .0278444     .361918
 19#Married  |    .116847   .0281112     4.16   0.000     .0617501     .171944
   19#Cohab  |   .1900926   .0908282     2.09   0.036     .0120727    .3681126
 20#Married  |   .1190553   .0307744     3.87   0.000     .0587386    .1793719
   20#Cohab  |   .1850281   .0961601     1.92   0.054    -.0034422    .3734984
 21#Married  |   .1211451   .0335894     3.61   0.000      .055311    .1869792
   21#Cohab  |   .1797186   .1011779     1.78   0.076    -.0185864    .3780236
 22#Married  |   .1231108   .0365456     3.37   0.001     .0514827    .1947389
   22#Cohab  |   .1741959   .1058435     1.65   0.100    -.0332537    .3816454
 23#Married  |   .1249471   .0396326     3.15   0.002     .0472686    .2026257
   23#Cohab  |   .1684925   .1101236     1.53   0.126    -.0473458    .3843307
 24#Married  |     .12665   .0428405     2.96   0.003     .0426842    .2106158
   24#Cohab  |   .1626409   .1139892     1.43   0.154    -.0607738    .3860556
 25#Married  |   .1282159   .0461594     2.78   0.005     .0377452    .2186866
   25#Cohab  |   .1566736   .1174164     1.33   0.182    -.0734583    .3868056
 26#Married  |   .1296422   .0495796     2.61   0.009     .0324679    .2268166
   26#Cohab  |   .1506225   .1203865     1.25   0.211    -.0853306    .3865756
 27#Married  |   .1309273   .0530915     2.47   0.014     .0268699    .2349847
   27#Cohab  |   .1445186   .1228855     1.18   0.240    -.0963326    .3853698
 28#Married  |   .1320701   .0566851     2.33   0.020     .0209693    .2431709
   28#Cohab  |   .1383919   .1249051     1.11   0.268    -.1064176    .3832014
 29#Married  |   .1330704   .0603507     2.20   0.027     .0147853    .2513555
   29#Cohab  |    .132271   .1264417     1.05   0.296    -.1155503    .3800922
------------------------------------------------------------------------------

. est store       sep

. 
. est table oneman equal some sep 

------------------------------------------------------------------
    Variable |   oneman       equal         some         sep      
-------------+----------------------------------------------------
   _at#marst |
  1#Married  |  .13614337    .65175952    .14555023    .06654688  
    1#Cohab  |  .10472153    .31332188     .3670557    .21490088  
  2#Married  |  .14539117    .63657419    .14864316    .06939148  
    2#Cohab  |  .11487466    .31916526     .3487431    .21721698  
  3#Married  |  .15506894    .62102028    .15163434    .07227645  
    3#Cohab  |   .1257296    .32444904    .33069137    .21912999  
  4#Married  |  .16517399    .60512106    .15451035     .0751946  
    4#Cohab  |  .13729813    .32913319    .31294627    .22062241  
  5#Married  |  .17570103    .58890295    .15725784    .07813818  
    5#Cohab  |  .14958772    .33318123    .29555168    .22167937  
  6#Married  |  .18664204     .5723954    .15986365    .08109892  
    6#Cohab  |  .16260107    .33656081    .27854918    .22228893  
  7#Married  |  .19798624    .55563076    .16231496    .08406804  
    7#Cohab  |  .17633591    .33924421    .26197764    .22244225  
  8#Married  |  .20972007    .53864411    .16459944    .08703639  
    8#Cohab  |  .19078463    .34120874    .24587287    .22213377  
  9#Married  |   .2218272      .521473    .16670536    .08999445  
    9#Cohab  |   .2059342     .3424371    .23026733    .22136136  
 10#Married  |  .23428864    .50415716    .16862176    .09293244  
   10#Cohab  |    .221766    .34291773     .2151899    .22012638  
 11#Married  |  .24708281    .48673817     .1703386    .09584042  
   11#Cohab  |  .23825583    .34264492    .20066557    .21843369  
 12#Married  |  .26018576    .46925908    .17184682    .09870834  
   12#Cohab  |  .25537399    .34161897     .1867154    .21629164  
 13#Married  |  .27357132    .45176396    .17313852     .1015262  
   13#Cohab  |  .27308542     .3398462    .17335636    .21371202  
 14#Married  |  .28721137    .43429752    .17420704    .10428408  
   14#Cohab  |  .29134996    .33733887    .16060129    .21070988  
 15#Married  |  .30107614    .41690457    .17504702    .10697228  
   15#Cohab  |  .31012267    .33411496    .14845898     .2073034  
 16#Married  |  .31513446    .39962963     .1756545    .10958141  
   16#Cohab  |  .32935424    .33019799    .13693415    .20351362  
 17#Married  |  .32935414    .38251642    .17602695    .11210249  
   17#Cohab  |  .34899149    .32561661    .12602767    .19936423  
 18#Married  |  .34370227    .36560743    .17616329      .114527  
   18#Cohab  |  .36897785    .32040422     .1157367    .19488123  
 19#Married  |  .35814559    .34894347     .1760639    .11684703  
   19#Cohab  |  .38925401    .31459848    .10605487    .19009264  
 20#Married  |  .37265081     .3325633    .17573061    .11905528  
   20#Cohab  |  .40975852    .30824078    .09697261     .1850281  
 21#Married  |  .38718499    .31650324    .17516663    .12114514  
   21#Cohab  |  .43042842    .30137566    .08847736    .17971856  
 22#Married  |  .40171579    .30079689    .17437653    .12311078  
   22#Cohab  |  .45119996    .29405023    .08055393    .17419589  
 23#Married  |  .41621185    .28547487    .17336613    .12494715  
   23#Cohab  |  .47200921    .28631354    .07318477    .16849248  
 24#Married  |  .43064297    .27056459    .17214246    .12664999  
   24#Cohab  |  .49279274    .27821598    .06635035    .16264093  
 25#Married  |  .44498042    .25609012    .17071357    .12821589  
   25#Cohab  |  .51348826    .26980863    .06002946    .15667364  
 26#Married  |  .45919713    .24207211    .16908851    .12964225  
   26#Cohab  |  .53403521    .26114274    .05419954    .15062251  
 27#Married  |  .47326783    .22852771    .16727716    .13092731  
   27#Cohab  |  .55437531    .25226909    .04883699    .14451861  
 28#Married  |   .4871692    .21547065    .16529007    .13207008  
   28#Cohab  |  .57445306    .24323754     .0439175     .1383919  
 29#Married  |  .50087997    .20291125    .16313842    .13307037  
   29#Cohab  |   .5942162    .23409651    .03941632    .13227098  
------------------------------------------------------------------

. **********************************************************************************************************************
. *Appendix Table B
. **********************************************************************************************************************
. // Dual-earners
. preserve

. drop if dualearn==2 /* Drops 1,353 respondents */
(1,347 observations deleted)

. count
  6,891

. global  ivars "sex age parent i.employ homemaker ib4.degree hswrk respmom famlife"

. 
. mlogit          pool    index i.relinc          i.marst         $ivars                                  , cluster(country) rrr

Iteration 0:   log pseudolikelihood = -8315.1558  
Iteration 1:   log pseudolikelihood = -7624.3841  
Iteration 2:   log pseudolikelihood = -7588.8054  
Iteration 3:   log pseudolikelihood = -7588.5583  
Iteration 4:   log pseudolikelihood = -7588.5582  

Multinomial logistic regression                 Number of obs     =      6,891
                                                Wald chi2(16)     =          .
                                                Prob > chi2       =          .
Log pseudolikelihood = -7588.5582               Pseudo R2         =     0.0874

                                        (Std. Err. adjusted for 20 clusters in country)
---------------------------------------------------------------------------------------
                      |               Robust
                 pool |        RRR   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
One___Manager         |
                index |   1.042926   .0114052     3.84   0.000      1.02081    1.065521
                      |
               relinc |
Woman primary-earner  |   .8990657    .131578    -0.73   0.467     .6748671    1.197746
       Equal-earners  |   .7422003   .1322143    -1.67   0.094     .5234673    1.052332
                      |
                marst |
               Cohab  |    1.51217   .2063016     3.03   0.002     1.157373    1.975731
                  sex |   .9750462    .154949    -0.16   0.874     .7140965    1.331354
                  age |   .9872378   .0059662    -2.13   0.034     .9756133    .9990008
               parent |   .9328679   .1277714    -0.51   0.612     .7132377     1.22013
                      |
               employ |
            Parttime  |   1.166825   .1864851     0.97   0.334       .85303    1.596052
          Unemployed  |   1.386161   .4871696     0.93   0.353     .6960766    2.760391
             Student  |      1.184   .2342635     0.85   0.393     .8034057    1.744892
  Not in labor force  |   .8631863   .1269017    -1.00   0.317     .6470902    1.151448
                      |
            homemaker |   1.039645   .1278011     0.32   0.752     .8170509    1.322883
                      |
               degree |
 No formal education  |   1.722772    .538392     1.74   0.082     .9337157    3.178638
      Primary school  |   1.421494   .2189621     2.28   0.022     1.051063    1.922477
     Lower secondary  |   .9250195    .161121    -0.45   0.655     .6574876     1.30141
      Post secondary  |   .9965209    .216724    -0.02   0.987     .6506787    1.526182
Lower level tertiary  |   .7087898   .1496013    -1.63   0.103       .46866    1.071956
Upper level tertiary  |   .5302173   .0990706    -3.40   0.001     .3676272     .764716
                      |
                hswrk |    .919976   .0271338    -2.83   0.005     .8683026    .9747245
              respmom |   .9912827   .1176347    -0.07   0.941     .7855724    1.250861
              famlife |   .7906097   .0676358    -2.75   0.006     .6685637    .9349351
                _cons |   1.691117   1.177766     0.75   0.451     .4318775    6.621966
----------------------+----------------------------------------------------------------
Manage___Together     |  (base outcome)
----------------------+----------------------------------------------------------------
Keep_Some___Separate  |
                index |    1.00647    .012766     0.51   0.611     .9817574    1.031804
                      |
               relinc |
Woman primary-earner  |    1.10982   .1340156     0.86   0.388     .8759237    1.406173
       Equal-earners  |   .9332854   .1153612    -0.56   0.576     .7324862     1.18913
                      |
                marst |
               Cohab  |   3.210533   .4714377     7.94   0.000     2.407609    4.281228
                  sex |   1.036847   .1086633     0.35   0.730     .8443203    1.273274
                  age |   .9835597   .0038097    -4.28   0.000     .9761211     .991055
               parent |   .9297594   .0811405    -0.83   0.404     .7835846    1.103203
                      |
               employ |
            Parttime  |   .7491592    .111476    -1.94   0.052     .5596469    1.002846
          Unemployed  |   .8369953    .222173    -0.67   0.503      .497484    1.408208
             Student  |   .7090934   .1151563    -2.12   0.034     .5157851    .9748506
  Not in labor force  |   .8393397    .124938    -1.18   0.239     .6269518    1.123677
                      |
            homemaker |    .731929   .0797434    -2.86   0.004     .5911953    .9061645
                      |
               degree |
 No formal education  |   1.297385    .540524     0.62   0.532     .5733718     2.93563
      Primary school  |   .6702062    .113425    -2.36   0.018     .4810075    .9338238
     Lower secondary  |   .9044197   .1134581    -0.80   0.423     .7072746    1.156517
      Post secondary  |   .9657748   .1565507    -0.21   0.830     .7029061     1.32695
Lower level tertiary  |   1.472453    .144017     3.96   0.000     1.215591    1.783591
Upper level tertiary  |   1.955324   .2246161     5.84   0.000     1.561125    2.449062
                      |
                hswrk |   .9695673   .0190412    -1.57   0.116     .9329564    1.007615
              respmom |   1.265181    .162666     1.83   0.067     .9833602    1.627769
              famlife |   .7785256   .0326614    -5.97   0.000     .7170715    .8452463
                _cons |   2.568892   1.014669     2.39   0.017     1.184501    5.571294
----------------------+----------------------------------------------------------------
Keep_All___Separate   |
                index |   1.022157   .0123797     1.81   0.070     .9981788    1.046711
                      |
               relinc |
Woman primary-earner  |   1.242226   .1861919     1.45   0.148     .9260146    1.666417
       Equal-earners  |   .8642232   .1010687    -1.25   0.212     .6871951    1.086855
                      |
                marst |
               Cohab  |   4.766109   .8135142     9.15   0.000     3.410945    6.659678
                  sex |   1.124967   .1288458     1.03   0.304     .8987713     1.40809
                  age |   .9938999   .0071412    -0.85   0.394     .9800014    1.007995
               parent |   1.002651   .1279914     0.02   0.983     .7807127    1.287681
                      |
               employ |
            Parttime  |   .6217632   .1185142    -2.49   0.013     .4279348     .903384
          Unemployed  |   1.490647   .4743618     1.25   0.210     .7989156    2.781306
             Student  |   .9602509   .3044637    -0.13   0.898     .5158186    1.787609
  Not in labor force  |   1.232819   .1483308     1.74   0.082     .9738321    1.560682
                      |
            homemaker |   .6715531    .078422    -3.41   0.001       .53417    .8442697
                      |
               degree |
 No formal education  |   1.568766   .5265934     1.34   0.180     .8125168    3.028894
      Primary school  |   1.193474    .326572     0.65   0.518     .6980673    2.040462
     Lower secondary  |   1.273285   .2582902     1.19   0.234      .855572    1.894937
      Post secondary  |    1.41245   .2076157     2.35   0.019     1.058901    1.884044
Lower level tertiary  |   1.549444   .2080847     3.26   0.001     1.190865    2.015994
Upper level tertiary  |   1.625919   .3816573     2.07   0.038     1.026346    2.575753
                      |
                hswrk |   1.037674   .0253976     1.51   0.131     .9890707    1.088666
              respmom |   .9264268   .1561253    -0.45   0.650     .6658295    1.289018
              famlife |   .6595762   .0165364   -16.60   0.000     .6279488    .6927965
                _cons |   1.592204   .9301354     0.80   0.426      .506691    5.003277
---------------------------------------------------------------------------------------
Note: _cons estimates baseline relative risk for each outcome.

. estat           ic

Akaike's information criterion and Bayesian information criterion

-----------------------------------------------------------------------------
       Model |        Obs  ll(null)  ll(model)      df         AIC        BIC
-------------+---------------------------------------------------------------
           . |      6,891 -8315.156  -7588.558      19    15215.12   15345.04
-----------------------------------------------------------------------------
               Note: N=Obs used in calculating BIC; see [R] BIC note.

. mlogit          pool    c.index##i.relinc       i.marst         $ivars                                  , cluster(country) rrr

Iteration 0:   log pseudolikelihood = -8315.1558  
Iteration 1:   log pseudolikelihood = -7620.8903  
Iteration 2:   log pseudolikelihood = -7581.8874  
Iteration 3:   log pseudolikelihood =  -7581.482  
Iteration 4:   log pseudolikelihood = -7581.4817  

Multinomial logistic regression                 Number of obs     =      6,891
                                                Wald chi2(16)     =          .
                                                Prob > chi2       =          .
Log pseudolikelihood = -7581.4817               Pseudo R2         =     0.0882

                                        (Std. Err. adjusted for 20 clusters in country)
---------------------------------------------------------------------------------------
                      |               Robust
                 pool |        RRR   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
One___Manager         |
                index |   1.048604   .0115576     4.31   0.000     1.026195    1.071503
                      |
               relinc |
Woman primary-earner  |   1.159274   .1989777     0.86   0.389     .8281057    1.622879
       Equal-earners  |   1.089374   .2751756     0.34   0.735     .6639931     1.78727
                      |
       relinc#c.index |
Woman primary-earner  |   .9889463    .008383    -1.31   0.190     .9726516    1.005514
       Equal-earners  |   .9812103    .006856    -2.71   0.007     .9678644    .9947402
                      |
                marst |
               Cohab  |   1.500457   .2069696     2.94   0.003     1.145014     1.96624
                  sex |   .9761853   .1550902    -0.15   0.879      .714988    1.332803
                  age |   .9875131   .0059635    -2.08   0.037     .9758938    .9992708
               parent |   .9450612   .1304888    -0.41   0.682     .7209925    1.238765
                      |
               employ |
            Parttime  |   1.184795   .1857538     1.08   0.279     .8713464    1.611001
          Unemployed  |   1.405785    .493861     0.97   0.332     .7061331    2.798667
             Student  |    1.17689   .2291559     0.84   0.403     .8035181    1.723757
  Not in labor force  |   .8555398   .1252938    -1.07   0.287     .6420691    1.139984
                      |
            homemaker |   1.046821   .1285647     0.37   0.709     .8228724    1.331718
                      |
               degree |
 No formal education  |   1.681309   .5125647     1.70   0.088     .9250175    3.055944
      Primary school  |   1.425319   .2222818     2.27   0.023     1.049942    1.934902
     Lower secondary  |   .9284041   .1613735    -0.43   0.669     .6603631    1.305243
      Post secondary  |    .997571   .2150668    -0.01   0.991     .6537819    1.522141
Lower level tertiary  |   .7073001   .1495854    -1.64   0.102     .4672882    1.070588
Upper level tertiary  |   .5288805   .0988467    -3.41   0.001     .3666653    .7628609
                      |
                hswrk |     .91996    .026979    -2.84   0.004     .8685731    .9743871
              respmom |   .9972179   .1180723    -0.02   0.981     .7906902    1.257691
              famlife |   .7918631   .0675874    -2.73   0.006     .6698816    .9360567
                _cons |   1.424525   .9688434     0.52   0.603     .3756244    5.402397
----------------------+----------------------------------------------------------------
Manage___Together     |  (base outcome)
----------------------+----------------------------------------------------------------
Keep_Some___Separate  |
                index |   1.008946   .0142531     0.63   0.528     .9813941    1.037272
                      |
               relinc |
Woman primary-earner  |   1.085149    .197364     0.45   0.653     .7597576      1.5499
       Equal-earners  |   1.142565   .2995151     0.51   0.611     .6835098    1.909929
                      |
       relinc#c.index |
Woman primary-earner  |   1.001304   .0099947     0.13   0.896     .9819053    1.021086
       Equal-earners  |   .9860563   .0163561    -0.85   0.397     .9545144    1.018641
                      |
                marst |
               Cohab  |   3.204335   .4730174     7.89   0.000     2.399304    4.279475
                  sex |   1.038262   .1077145     0.36   0.717     .8472253    1.272374
                  age |    .983614   .0038603    -4.21   0.000      .976077    .9912091
               parent |   .9333887   .0825877    -0.78   0.436     .7847781    1.110141
                      |
               employ |
            Parttime  |   .7538876   .1158931    -1.84   0.066     .5577681    1.018966
          Unemployed  |   .8371478   .2234824    -0.67   0.506     .4960986    1.412655
             Student  |   .7036835   .1098925    -2.25   0.024     .5181403    .9556687
  Not in labor force  |   .8349163   .1236884    -1.22   0.223     .6245137    1.116205
                      |
            homemaker |   .7319121   .0792781    -2.88   0.004     .5919156    .9050197
                      |
               degree |
 No formal education  |   1.242707   .4760197     0.57   0.571     .5865645    2.632825
      Primary school  |   .6671158   .1124363    -2.40   0.016     .4794452    .9282468
     Lower secondary  |   .9067292   .1148828    -0.77   0.440     .7073432    1.162318
      Post secondary  |   .9686894   .1567812    -0.20   0.844     .7053726    1.330303
Lower level tertiary  |   1.472983   .1433052     3.98   0.000     1.217265    1.782422
Upper level tertiary  |    1.95807   .2260625     5.82   0.000     1.561548    2.455279
                      |
                hswrk |   .9694995   .0190706    -1.57   0.115     .9328331    1.007607
              respmom |   1.267779    .162999     1.85   0.065     .9853805    1.631108
              famlife |    .779131   .0328562    -5.92   0.000     .7173234    .8462642
                _cons |   2.437566   .9857281     2.20   0.028     1.103415    5.384856
----------------------+----------------------------------------------------------------
Keep_All___Separate   |
                index |   1.022746   .0146847     1.57   0.117     .9943658    1.051936
                      |
               relinc |
Woman primary-earner  |   1.268618   .2965275     1.02   0.309      .802362    2.005816
       Equal-earners  |   .8576959   .1551006    -0.85   0.396     .6017375     1.22253
                      |
       relinc#c.index |
Woman primary-earner  |   .9981298   .0093056    -0.20   0.841     .9800568    1.016536
       Equal-earners  |   .9992482   .0085034    -0.09   0.930     .9827201    1.016054
                      |
                marst |
               Cohab  |   4.758678   .8199895     9.05   0.000     3.394783    6.670536
                  sex |   1.126991   .1272943     1.06   0.290     .9031849    1.406255
                  age |   .9940042   .0071035    -0.84   0.400     .9801786    1.008025
               parent |   1.002532   .1281319     0.02   0.984     .7803824    1.287919
                      |
               employ |
            Parttime  |   .6223022   .1207735    -2.44   0.015     .4254064    .9103293
          Unemployed  |   1.483871   .4721538     1.24   0.215     .7953382    2.768474
             Student  |   .9581787   .3025504    -0.14   0.892     .5160298    1.779173
  Not in labor force  |   1.233181   .1498078     1.73   0.084     .9719011    1.564701
                      |
            homemaker |   .6715814   .0780537    -3.43   0.001     .5347722    .8433901
                      |
               degree |
 No formal education  |   1.588734   .5502162     1.34   0.181     .8058602    3.132149
      Primary school  |   1.189446   .3282584     0.63   0.530     .6925224    2.042941
     Lower secondary  |   1.269023    .256103     1.18   0.238     .8544515     1.88474
      Post secondary  |   1.409991   .2063119     2.35   0.019     1.058443    1.878302
Lower level tertiary  |   1.548819   .2059772     3.29   0.001     1.193437    2.010026
Upper level tertiary  |   1.622072   .3744939     2.10   0.036     1.031692    2.550294
                      |
                hswrk |   1.037854   .0254166     1.52   0.129     .9892149    1.088885
              respmom |   .9284704   .1559686    -0.44   0.659     .6680045    1.290496
              famlife |   .6603286   .0167297   -16.38   0.000     .6283398     .693946
                _cons |   1.561764   .9011915     0.77   0.440      .504014     4.83936
---------------------------------------------------------------------------------------
Note: _cons estimates baseline relative risk for each outcome.

. estat           ic

Akaike's information criterion and Bayesian information criterion

-----------------------------------------------------------------------------
       Model |        Obs  ll(null)  ll(model)      df         AIC        BIC
-------------+---------------------------------------------------------------
           . |      6,891 -8315.156  -7581.482      19    15200.96   15330.88
-----------------------------------------------------------------------------
               Note: N=Obs used in calculating BIC; see [R] BIC note.

. mlogit          pool    c.index##i.marst        i.relinc        $ivars                                  , cluster(country) rrr

Iteration 0:   log pseudolikelihood = -8315.1558  
Iteration 1:   log pseudolikelihood = -7591.8282  
Iteration 2:   log pseudolikelihood = -7554.0866  
Iteration 3:   log pseudolikelihood = -7553.7179  
Iteration 4:   log pseudolikelihood = -7553.7175  

Multinomial logistic regression                 Number of obs     =      6,891
                                                Wald chi2(16)     =          .
                                                Prob > chi2       =          .
Log pseudolikelihood = -7553.7175               Pseudo R2         =     0.0916

                                        (Std. Err. adjusted for 20 clusters in country)
---------------------------------------------------------------------------------------
                      |               Robust
                 pool |        RRR   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
One___Manager         |
                index |   1.043004   .0122692     3.58   0.000     1.019232    1.067331
                      |
                marst |
               Cohab  |   1.310536   .2786824     1.27   0.203      .863859    1.988177
                      |
        marst#c.index |
               Cohab  |    .998404   .0077435    -0.21   0.837     .9833418    1.013697
                      |
               relinc |
Woman primary-earner  |   .9048986   .1306514    -0.69   0.489     .6818698    1.200877
       Equal-earners  |   .7413897   .1328345    -1.67   0.095     .5218397    1.053309
                      |
                  sex |   .9754861   .1536412    -0.16   0.875      .716399    1.328273
                  age |   .9866924   .0062266    -2.12   0.034     .9745636    .9989722
               parent |   .9269049   .1295738    -0.54   0.587     .7047647    1.219063
                      |
               employ |
            Parttime  |   1.168115   .1865975     0.97   0.331     .8541073    1.597565
          Unemployed  |   1.395297   .4965281     0.94   0.349     .6946394    2.802682
             Student  |    1.18148   .2333703     0.84   0.399     .8022212    1.740039
  Not in labor force  |   .8666832   .1249674    -0.99   0.321      .653319    1.149729
                      |
            homemaker |   1.034411   .1252908     0.28   0.780     .8158182    1.311575
                      |
               degree |
 No formal education  |   1.728347   .5337784     1.77   0.076     .9435134    3.166022
      Primary school  |   1.428474   .2165055     2.35   0.019     1.061355    1.922578
     Lower secondary  |   .9279811   .1625096    -0.43   0.670      .658378    1.307986
      Post secondary  |   .9935518   .2146355    -0.03   0.976     .6505891     1.51731
Lower level tertiary  |   .7068902    .149625    -1.64   0.101      .466854    1.070343
Upper level tertiary  |   .5270915   .0985509    -3.43   0.001     .3653724    .7603896
                      |
                hswrk |   .9203276   .0269491    -2.84   0.005     .8689955     .974692
              respmom |    .990578   .1166132    -0.08   0.936     .7864719    1.247654
              famlife |   .7873647   .0657531    -2.86   0.004     .6684852    .9273851
                _cons |   1.838481   1.271079     0.88   0.378     .4741979    7.127849
----------------------+----------------------------------------------------------------
Manage___Together     |  (base outcome)
----------------------+----------------------------------------------------------------
Keep_Some___Separate  |
                index |   1.016662   .0120636     1.39   0.164     .9932903    1.040583
                      |
                marst |
               Cohab  |   7.225771   1.151528    12.41   0.000     5.287292    9.874954
                      |
        marst#c.index |
               Cohab  |   .9437457    .009029    -6.05   0.000     .9262141    .9616091
                      |
               relinc |
Woman primary-earner  |   1.100599   .1357117     0.78   0.437     .8643112    1.401485
       Equal-earners  |    .923155   .1140185    -0.65   0.517     .7246747    1.175997
                      |
                  sex |   1.029415   .1074985     0.28   0.781     .8388851     1.26322
                  age |   .9842653   .0040171    -3.89   0.000     .9764233    .9921703
               parent |   .9547475    .087779    -0.50   0.614     .7973142    1.143267
                      |
               employ |
            Parttime  |   .7374647   .1106123    -2.03   0.042     .5496288    .9894935
          Unemployed  |    .807867   .2157396    -0.80   0.424     .4786609     1.36349
             Student  |   .6960314   .1131585    -2.23   0.026      .506108    .9572257
  Not in labor force  |   .8348995   .1273572    -1.18   0.237      .619142    1.125844
                      |
            homemaker |   .7376786   .0800566    -2.80   0.005     .5963352    .9125232
                      |
               degree |
 No formal education  |   1.392813   .5694767     0.81   0.418     .6249765    3.104001
      Primary school  |   .7048483   .1418059    -1.74   0.082     .4751662    1.045552
     Lower secondary  |   .8884147   .1094124    -0.96   0.337     .6978889    1.130954
      Post secondary  |   .9507845   .1607296    -0.30   0.765     .6826324    1.324272
Lower level tertiary  |    1.45561   .1534126     3.56   0.000      1.18395    1.789603
Upper level tertiary  |   1.965617   .2328378     5.71   0.000     1.558366    2.479295
                      |
                hswrk |   .9666211   .0191192    -1.72   0.086     .9298652     1.00483
              respmom |   1.267017   .1604285     1.87   0.062     .9885625    1.623905
              famlife |   .7842436   .0342557    -5.56   0.000     .7198972    .8543414
                _cons |   2.010187   .8880407     1.58   0.114     .8456699    4.778284
----------------------+----------------------------------------------------------------
Keep_All___Separate   |
                index |   1.028759    .011422     2.55   0.011     1.006614    1.051391
                      |
                marst |
               Cohab  |   8.081687   1.665692    10.14   0.000     5.395894    12.10433
                      |
        marst#c.index |
               Cohab  |   .9686219   .0129181    -2.39   0.017     .9436309    .9942747
                      |
               relinc |
Woman primary-earner  |   1.231047   .1880331     1.36   0.174      .912557    1.660692
       Equal-earners  |   .8601059   .1015798    -1.28   0.202     .6823759    1.084127
                      |
                  sex |    1.11738   .1254679     0.99   0.323     .8966469    1.392452
                  age |      .9946   .0070379    -0.77   0.444     .9809011     1.00849
               parent |   1.026228    .129096     0.21   0.837     .8019841    1.313174
                      |
               employ |
            Parttime  |     .61407   .1186367    -2.52   0.012     .4205019    .8967426
          Unemployed  |   1.462717   .4708273     1.18   0.237     .7783427    2.748841
             Student  |   .9625438   .3211861    -0.11   0.909      .500481      1.8512
  Not in labor force  |   1.224434   .1451428     1.71   0.088     .9705883     1.54467
                      |
            homemaker |   .6788856   .0800218    -3.29   0.001     .5388446     .855322
                      |
               degree |
 No formal education  |   1.687592   .5586944     1.58   0.114     .8820003    3.228987
      Primary school  |   1.229866   .3499957     0.73   0.467     .7040805     2.14829
     Lower secondary  |   1.260483   .2671707     1.09   0.275      .831988    1.909663
      Post secondary  |   1.407261   .2148096     2.24   0.025     1.043383    1.898039
Lower level tertiary  |   1.550279   .2256417     3.01   0.003     1.165516    2.062061
Upper level tertiary  |   1.656461   .4058199     2.06   0.039     1.024811    2.677435
                      |
                hswrk |   1.036224   .0262656     1.40   0.160     .9860024    1.089004
              respmom |   .9223277   .1546042    -0.48   0.630     .6640542    1.281053
              famlife |   .6635816   .0160773   -16.93   0.000     .6328071    .6958527
                _cons |   1.298987   .7675221     0.44   0.658     .4080018    4.135685
---------------------------------------------------------------------------------------
Note: _cons estimates baseline relative risk for each outcome.

. estat           ic

Akaike's information criterion and Bayesian information criterion

-----------------------------------------------------------------------------
       Model |        Obs  ll(null)  ll(model)      df         AIC        BIC
-------------+---------------------------------------------------------------
           . |      6,891 -8315.156  -7553.717      19    15145.43   15275.36
-----------------------------------------------------------------------------
               Note: N=Obs used in calculating BIC; see [R] BIC note.

. restore

. 
. log close
      name:  <unnamed>
       log:  C:\Users\Joanna\Dropbox\Repositories\ISSP_Income-Pooling\docs\ISSPdata_2020.02.04.log
  log type:  text
 closed on:   4 Feb 2020, 15:51:38
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
